[
  {
    "url": "https://bdjobs.com/h/details/1458052?ln=1",
    "company_name": "Flow Sleek",
    "job_title": "SEO Data Entry Executive (Part Time)",
    "location": "Khulna",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "SEO Data Entry Executive (Part Time) : Flow Sleek Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Flow Sleek SEO Data Entry Executive (Part Time) Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 4 Age: 18 to 30 years Location: Khulna Salary: Tk. 5000 - 5000 (Monthly) Published: 12 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 18 to 30 years প্রথম ১৫ দিন আমরা আপনাকে কাজ শিখিয়ে নেব এই সময় ট্রায়িং পিরিয়ড হিশেবে গণ্য হবে। আগে থেকে কম্পিউটার চালানোতে পারদর্শী হলে তাকে প্রাধান্য দেয়া হবে। দৌলতপুর এর আশে পাশে বাসা হলে তাকে প্রাধান্য দেয়া হবে। Responsibilities & Context অফিসের সময় আমরা আপনাকে ট্রেনিং দিব, এবং আপনাদের প্র্যাক্টিকাল অফিসের কাজ করতে হবে। অফিস সময় সকাল ৯ টা থেকে দুপুর ২ টা পর্যন্ত অথবা ৩ টা থেকে ৮ টা পর্যন্ত । কেউ বেশি কাজ করলে সেই অনুযায়ী পেমেন্ট পাবে এসইও: অন-পেইজ , অফ-পেইজ , মেটা ট্যাগস, কীওয়ার্ড এনালাইসিস, এসইও টুলস, লিঙ্ক বিল্ডিং, ওয়েবসাইট বেসিক ডিজাইন, কেস স্টাডিজ এবং লাইভ প্রোজেক্ট। এই দুই শিফট এ কাজ করার সুযোগ আছে । Compensation & Other Benefits পার্ট টাইম কাজের সুযোগ আছে। দৌলতপুর এর আশে পাশে বাসা হলে তাকে প্রাধান্য দেয়া হবে। কম্পিউটার চালানোতে পারদর্শী হলে তাকে প্রাধান্য দেয়া হবে। Employment Status Part Time Gender Only males are allowed to apply. Job Location Khulna Company Information Flow Sleek Follow Address: Beside Daulotpur Sub-registry Office, Kulibagan, Daulotpur, Khulna Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter C"
  }
]