[
  {
    "url": "https://bdjobs.com/h/details/1458432?ln=1",
    "company_name": null,
    "job_title": null,
    "location": "",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "",
    "job_description": "Jobs Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The job is not available now! The job announcement you are trying to view is not available now! Go to Job List Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458478?ln=1",
    "company_name": "A Reputed Group of Company",
    "job_title": "Manager/ Sr. Manager  – Trade Marketing",
    "location": "Dhaka",
    "salary": null,
    "experience": "At least 10 years",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Manager/ Sr. Manager  – Trade Marketing : A Reputed Group of Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Reputed Group of Company Manager/ Sr. Manager  – Trade Marketing Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Experience: At least 10 years Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience At least 10 years The applicants should have experience in the following business area(s): Food (Packaged)/Beverage, Manufacturing (FMCG) Additional Requirements Minimum 10–12 years of experience in Trade Marketing, Sales, or Commercial roles within FMCG, preferably in snacks or food & beverage manufacturing. Proficiency in MS Office and business reporting or data analysis tools like Power BI is highly valued. Solid analytical skills with the ability to use sales and market data to drive decisions. Strong leadership and team management skills. Responsibilities & Context Work closely with Sales, Marketing, and Distribution teams to ensure strong alignment between brand strategy and in-market execution. Develop and implement trade-marketing strategies to drive sales growth, market share, and brand visibility across all trade channels. Manage and optimize the trade marketing budget, ensuring efficient allocation and cost-effective execution of programs. Analyze market trends, shopper insights, and channel performance to identify growth opportunities and improve trade effectiveness. Track, evaluate, and report on the performance of trade campaigns and promotions, recommending improvements based on data and insights. Monitor execution quality in the market and ensure compliance with brand standards and guidelines. Lead, train, and develop the trade marketing team to build strong category and execution capabilities. Compensation & Other Benefits Mobile bill,Tour allowance Festival Bonus: 2 Lunch Facilities: Partially Subsidize Salary Review: Yearly Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information A Reputed Group of Company Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্র"
  },
  {
    "url": "https://bdjobs.com/h/details/1458346?ln=1",
    "company_name": "A Leading Food & Beverage Industry",
    "job_title": "Asst. Manager/Dy. Manager (Marketing & Brand)",
    "location": "Dhaka (Gulshan)",
    "salary": "Negotiable",
    "experience": "4 to 8 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Asst. Manager/Dy. Manager (Marketing & Brand) : A Leading Food & Beverage Industry Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Leading Food & Beverage Industry Asst. Manager/Dy. Manager (Marketing & Brand) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 01 Location: Dhaka (Gulshan) Salary: Negotiable Experience: 4 to 8 years Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Business Administration (BBA) in Marketing Master of Business Administration (MBA) in Marketing Experience 4 to 8 years The applicants should have experience in the following business area(s): Food (Packaged)/Beverage Responsibilities & Context Context: To support the planning, execution, and monitoring of marketing and brand initiatives across multiple channels, ensuring consistent brand positioning Job Responsibilities: Assist in brand positioning, effective campaign execution, market competitiveness, and contribution to business growth. Support the development and execution of marketing and brand strategies aligned with organizational objectives. Assist in brand positioning, brand architecture, and pricing strategy development under senior leadership guidance. Translate brand vision and guidelines into actionable marketing plans and go-to-market strategies. Coordinate and execute marketing campaigns across digital, advertising, trade marketing, events, and promotional platforms. Ensure brand messaging consistency across all communication channels, including digital platforms, websites, email campaigns, POS materials, and events. Support creative development processes to deliver impactful and engaging brand communications. Assist in new product development initiatives, product portfolio planning, and market launch execution. Conduct market, consumer, and competitor research to identify growth opportunities, risks, and trends. Monitor product distribution performance and collect market and consumer feedback for improvement initiatives. Track, measure, and report marketing campaign performance including ROI, KPIs, and market impact. Analyze brand performance, market trends, and consumer insights to support strategic decision-making. Assist in setting campaign benchmarks, budgets, and market projections. Coordinate with internal teams (Sales, Supply Chain, Finance, Production) to ensure smooth execution of marketing initiatives. Work closely with sales and channel teams to enhance brand visibility, demand generation, and channel effectiveness. Liaise with external agencies, vendors, and partners to ensure timely and quality delivery of marketing activities. Support ongoing marketing, advertising, and promotional activities. Contribute innovative ideas for brand building, consumer engagement, and business growth initiat"
  },
  {
    "url": "https://bdjobs.com/h/details/1458342?ln=1",
    "company_name": "Joypurhat Rural Development Movement (JRDM)",
    "job_title": "Employment Support Officer (ESO)",
    "location": "Joypurhat",
    "salary": null,
    "experience": "At least 7 years",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Employment Support Officer (ESO) : Joypurhat Rural Development Movement (JRDM) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Joypurhat Rural Development Movement (JRDM) Employment Support Officer (ESO) Application Deadline : 17 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 01 Age: At most 45 years Location: Joypurhat Salary: Tk. 47700 (Monthly) Experience: At least 7 years Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Science (BSc) in Civil Engineering Bachelor of Science (BSc) in Computer Science & Engineering BSc Engineering in CSE/ EEE/Civil/ Mechanical Engineering/IPE from any Govt. approved university. or/ Master’s in Business Administration/Management/ Economics/ Development Studies/ Social Work/Sociology/ from any Govt. approved university. The applicant must have at least one 1st Divisions/Classes or equivalent CGPA in the academic career. Applicants having more than one third class/division or equivalent grade in their entire academic Experience At least 7 years Additional Requirements Age At most 45 years At least 7 years of full-time experience in the field of development sector (only full-time work experiences after Bachelor`s or Master`s degree will be counted). Applicants must have 3 years of full-time experience in Skills development/ TVET Management. Experience in employment support, training facilitation, career services, Project Management/Entrepreneurship Development/ Pedagogy Training. Preference will be given to candidates who have prior experience working with key stakeholders in the skills development and apprenticeship sector, including BTEB, NSDA and relevant private sector actors. Experience in implementing or managing national or large-scale apprenticeship or work-based learning programs will be considered an added advantage. Responsibilities & Context The Joypurhat Rural Development Movement (JRDM) is a national level voluntary organization. The organization is registered under the Bureau of NGO Affairs and the Ministry of Social Welfare, Whose certificate numbers are 1794 and Joy- 159/95 respectively and it is also registered with the Microcredit Regulatory Authority (MRA) with certificate number 01421-02528-00278. PROJECT: Recovery and Advancement of Informal Sector Employment (RAISE) MAJOR RESPONSIBILITIES: (include, but are not limited to) Career Preparation & Counseling Provide individual and group counseling during and after training. Help apprentices set career goals and plan accordingly. Conduct sessions on CV writing, interview preparation, workplace behavior, etc. Coordinate Recognition of Prior Learning (RPL) certification where applicable. Employment & Entrepreneurship Support Match graduates with job or self-employment opportunities. Guide apprentices on business startup and link them with financial and supp"
  },
  {
    "url": "https://bdjobs.com/h/details/1458183?ln=1",
    "company_name": "ISHO Limited",
    "job_title": "Lead, Information Technology",
    "location": "Dhaka",
    "salary": null,
    "experience": "8 to 10 years",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Lead, Information Technology : ISHO Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List ISHO Limited Lead, Information Technology Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At least 30 years Location: Dhaka Salary: Negotiable Experience: 8 to 10 years Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Science (BSc) in Computer Engineering Master of Science (MSc) in Computer Science & Engineering Experience 8 to 10 years The applicants should have experience in the following business area(s): Furniture, Group of Companies, Interior Design, Restaurant, Retail Store Additional Requirements Age At least 30 years Responsibilities & Context Provide technical leadership and architecture direction for a scalable, secure ERP system built on Python/Django. Design, develop and maintain ERP modules using Python, Django and Django REST Framework. Ensure high code quality through best practices, clean architecture, documentation and rigorous code reviews. Design and optimize databases using MySQL/PostgreSQL with strong focus on performance, integrity and security. Lead, mentor and manage software engineers, including task allocation, sprint planning and delivery timelines. Manage production deployment and server infrastructure on Linux (Ubuntu/CentOS) using Nginx and Gunicorn. Implement system reliability, monitoring, and performance optimization across application and database layers. Develop and maintain secure, well-documented RESTful APIs for internal and third-party integrations. Enforce application security and compliance following OWASP standards, authentication, authorization and data encryption. Drive continuous improvement and R&D, evaluating new technologies, tools and DevOps practices (CI/CD, cloud). Skills & Expertise Django REST Framework Git and Github Linux OWASP Python Relational database systems: MySQL PostgreSQL Oracle Compensation & Other Benefits Weekly 2 holidays,Gratuity Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka Job Highlights Lead and scale a secure ERP system using Python/Django, own architecture and deployments, mentor engineers, optimize performance and databases, build REST APIs and drive innovation with modern DevOps and cloud technologies. Company Information ISHO Limited Follow Address: House# 27 (Leve-3), Road- 12 , Block# H, Banani, Dhaka-1213, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা"
  },
  {
    "url": "https://bdjobs.com/h/details/1458378?ln=1",
    "company_name": "A Reputed Garments Industry",
    "job_title": "Executive / Senior Executive-Fire Safety",
    "location": "Gazipur",
    "salary": null,
    "experience": "4 to 8 years",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Executive / Senior Executive-Fire Safety : A Reputed Garments Industry Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Reputed Garments Industry Executive / Senior Executive-Fire Safety Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: 24 to 32 years Location: Gazipur Salary: Negotiable Experience: 4 to 8 years Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor of Science (BSc) in Electrical & Electronic Engineering Bachelor of Science (BSc) Six months Fire Safety Manager Courser from Bangladesh Fire Service and Civil Defense is mandatory. Experience 4 to 8 years The applicants should have experience in the following business area(s): Garments, Textile Additional Requirements Age 24 to 32 years The applicants should have experience in the following business area(s): Textile, Garments, Sweater Industry. Six months Fire Safety Manager Courser from Bangladesh Fire Service and Civil Defense is mandatory. Communication skills in both English and Bengali in verbal and written. Ability to work independently and as part of a team. Be able to cope with pressure, flexible, and adaptable. Highly self-motivated, self-directed, and proactive. Responsibilities & Context Ensure fire safety for the workplace & building. Daily fire equipment check & maintain needful action. Conduct fire drill monthly. Regular/ weekly fire training with fire safety team & general workers. Report to management in case of any risk. Daily floor visit & ensure to Floor Compliance and follow up the Daily Compliance Check List given by the higher authority of compliance department. To ensure having personal safety equipment’s like mask, metal gloves, eye guard, needle guard, pulley cover, goggles, ear plug, gum boot, rubber apron, ear plug for workers are working in machines & chemical stores. Conduct the awareness program on rules and regulation, compliance & welfare issues, health, hygiene & safety; first aid etc. Conduct all types of Fire & Safety related tasks of knit dyeing mills. Any other job as assigned by the management from time to time. Skills & Expertise Fire Safety Fire safety Management Fire Protection and Detection System fire detection Fire Safety Training Fire Evacuation Drill Suggested by Fire drill Fire Safety Fire Safety Training Compensation & Other Benefits Mobile bill,Insurance Salary Review: Yearly Festival Bonus: 2 As per company policy Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Gazipur Read Before Apply Candidates must have 6 months of fire safety training from the Fire Service & Civil Defense. Company Information A Reputed Garments Industry Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য "
  },
  {
    "url": "https://bdjobs.com/h/details/1458292?ln=1",
    "company_name": "Sonali Samaj Foundation",
    "job_title": "ফিল্ড অফিসার",
    "location": "Netrokona",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "ফিল্ড অফিসার : Sonali Samaj Foundation Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Sonali Samaj Foundation ফিল্ড অফিসার Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 8 Age: At most 35 years Location: Netrokona Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Higher Secondary Bachelor/Honors এইচ এস সি অথবা সমমান Additional Requirements Age At most 35 years নিজস্ব বাহন (সাইকেল/স্কুটি/মটরসাইকেল) থাকা বাধ্যতামূলক। Responsibilities & Context \"সোনালী সমাজ ফাউন্ডেশন” একটি স্বেচ্ছাসেবী উন্নয়নমূলক সংস্থা। সংস্থাটি ঋণ, শিক্ষা, স্বাস্থ্য, প্রশিক্ষন, পরিবেশ উন্নয়ন সহ অন্যান্য আর্থ-সামাজিক উন্নয়ন কার্যক্রম পরিচালনা করে থাকে। \"সোনালী সমাজ ফাউন্ডেশন” সংস্থাটি মাইক্রোক্রেডিট রেগুলেটরী অথরিটি (এমআরএ) প্রাঃ অনুমোদিত, যার নং ২০২১০১৫৭৫। জরুরী ভিত্তিতে নিম্নোক্ত পদে যোগ্য, অভিজ্ঞ ও অনভিজ্ঞ জনবল নিয়োগ করা হবে। আগ্রহী প্রার্থীদের স্ব-হস্তে দরখাস্ত করার জন্য আহব্বান করা যাচ্ছে। \"নেত্রকোনা জেলায় কাজ করতে আগ্রহীগন আবেদন করবেন\"। কাজের ধরণ: মাঠ পর্যায়ে Skills & Expertise Suggested by Field or Project Organizer Project Management Compensation & Other Benefits বেতন: ৩মাস শিক্ষানবিশ ১০,০০০/-স্থায়ী হলে-১৬০০০/- টাকা সুবিধা সমূহ: একক আবাসিক ফি। নিয়োগ পরীক্ষায় উত্তীর্ণদের ৩ মাস শিক্ষানবিশ হিসেবে নিয়োগ দেওয়া হবে। শিক্ষানবিশ শেষে মুল্যায়ন সাপেক্ষে সংস্থার প্রচলিত বেতন কাঠামোতে অর্ন্তভুক্ত করা হবে। চাকুরী স্থায়ী করণের পর সংস্থার নিয়ম অনুযায়ী মূল বেতনের সামান ২টি উৎসব বোনাস, পিএফ ফান্ড, গ্রাচ্যুইটি, বার্ষিক ইনক্রিমেন্ট, মোবাইল বিল প্রদান করা হবে। সাইকেল এর জন্য মেরামত বিল দেওয়া হয়। নিজস্ব মটরসাইকেল ও বৈধড্রাইভিং লাইসেন্স থাকলে স্থায়ীকরনের পর জ্বলানি বিল (সংস্থার নিয়ম অনুযায়ী) প্রদান করা হয়। মাতৃত্ব/পিতৃত্বকালীন ছুটি ও প্রমোশনের সুবিধা থাকবে। Workplace Work at office Employment Status Full Time Job Location Netrokona Read Before Apply শর্তাবলী: সকল ফিল্ড অফিসারের জন্য ফেরত যোগ্য ১০,০০০/- টাকা (ফেরতযোগ্য) জামানত এবং দুইজন অভিভাবক কর্তৃক ৩০০ টাকার নন জুডিশিয়াল স্ট্যাম্পে অঙ্গীকার নামাসহপ্রযোজ্য অন্যান্য জামানত প্রদান বাধ্যতামূলক। নিয়োগ পরীক্ষার সময় সকল প্রকার মূল সনদ পত্র সংঙ্গে নিয়ে আসতে হবে। নিয়োগ পরিক্ষায় অংগ্রহনের জন্য কোন টিএ/ডিএ প্রদান করা হবে না। যে কোন ধরনের তদবির প্রার্থীর অযোগ্যতা বলে গন্য হবে। শিক্ষার্থীদের পরিক্ষা দেওয়ার সুযোগ দেওয়া হয়। নোট: নিয়োগের ক্ষেত্রে নারী/পুরুষ সম সুযোগ প্রদান করা হবে। ধুমপায়ীদের আবেদন করার প্রয়োজন নেই। Apply Procedure Hard Copy আগ্রহী প্রার্থীগণকে জীবন বৃত্তান্ত, প্রয়োজনীয় কাগজপত্র (শিক্ষাগত যোগ্যতা, চারিত্রিক সনদপত্র, জাতীয় পরিচয়পত্রের ফটোকপি ও অভিজ্ঞতার সনদ পত্র) এবং সদ্য তোলা ০৩ কপি পাসপোর্ট সাইজের রঙ্গিন ছবি সহ বরাবর নির্বাহী পরিচালক, \"সোনালী সমাজ ফাউন্ডেশন\" নরনারায়ণপুর, হিরনপুর, পূর্বধলা, নেত্রকোনা এই ঠিকানায় আগামী ১৫/০৩/২০২৬ ইং তারিখের মধ্যে কুরিয়ার/ডাকযোগে আবেদন প্রেরণের জন্য অনুরোধ করা হলো। আবেদনপত্রের অবশ্যই মোবাইল নম্বর এবং খামের উপরে পদের নাম উল্লেখ করতে হবে। শুধুমাএ বাছাইকৃত যোগ্য প্রার্থীদের নিয়োগ পরীক্ষায় অংশগ্রহনের"
  },
  {
    "url": "https://bdjobs.com/h/details/1458328?ln=1",
    "company_name": "The Mahal Fashions Bangladesh Ltd. (A Concern of RKD Group)",
    "job_title": "Supervisor",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "The applicants should have experience in the following area (s): 3-5 years across luxury retail, fashion merchandising, business growth strategy, market expansion, and operations.",
    "education": "Experience Requirements",
    "deadline": "23 Feb 2026",
    "job_description": "Supervisor : The Mahal Fashions Bangladesh Ltd. (A Concern of RKD Group) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The Mahal Fashions Bangladesh Ltd. (A Concern of RKD Group) Supervisor Application Deadline : 23 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 02 Location: Dhaka Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Graduate/Postgraduate Diploma in any discipline Additional Requirements Educational qualifications can be relaxed for experienced candidates. Experience Requirements The applicants should have experience in the following area (s): 3-5 years across luxury retail, fashion merchandising, business growth strategy, market expansion, and operations. Salary: According to BIDA Guideline Responsibilities & Context Luxury & Fashion Retail Operations. Business Growth & Strategy. Merchandising, Market Expansion, Team Leadership, Brand Development, Store Launch. Scale-up, International Retail Consulting. Skills & Expertise Suggested by Merchandising Merchandising and Marketing Brand Planning/ Development Workplace Work at office Employment Status Full Time Job Location Dhaka Read Before Apply Apply Instruction: Please send your resume to info@rkdgroup.co with all relevant documents by February 23, 2026. Apply Procedure Email Your CV Send your CV to the given email info@rkdgroup.co or Email your CV from My Bdjobs account Company Information The Mahal Fashions Bangladesh Ltd. (A Concern of RKD Group) Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessi"
  },
  {
    "url": "https://bdjobs.com/h/details/1456848?ln=1",
    "company_name": "Win Champion BD Ltd.",
    "job_title": "Senior Officer - Accounts And Finance",
    "location": "Dinajpur (Parbatipur)",
    "salary": null,
    "experience": "3 to 7 years",
    "education": null,
    "deadline": "06 Mar 2026",
    "job_description": "Senior Officer - Accounts And Finance : Win Champion BD Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Win Champion BD Ltd. Senior Officer - Accounts And Finance Application Deadline : 06 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: 28 to 45 years Location: Dinajpur (Parbatipur) Salary: Negotiable Experience: 3 to 7 years Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Master of Business Administration (MBA) in Accounting Bachelor of Business Administration (BBA) in Accounting Master of Business Administration (MBA) in Accounting/Finance Bachelor of Business Administration (BBA) in Accounting/Finance RJSC Return RJSC Share Increment/Reduce Monthly Tax Return Annual Tax Return Monthly VAT Return Annual VAT Audit FDI Report Tax Assessment Experience 3 to 7 years The applicants should have experience in the following business area(s): NGO, Packaging Industry, Toy Additional Requirements Age 28 to 45 years Responsibilities & Context ·         Petty cash related activities (Providing IOU/Advance and adjustment process. Payment of petty expenses bills). ·         VAT & Tax related activities .Preparing all the vouchers (Debit, Credit, Journal, sales, Purchase etc.) Ledger reconciliations and report time to time to Management. ·         Monthly salary disbursement. ·         Ensure monthly, quarterly & yearly financial reports are submitted to Management. ·         Documents prepare for custom audit. ·         Develop and monitor accounts & financial operation, reporting, and internal control system. ·         Have to work with ERP software-based accounting system. ·         Have to work in Tally Software. ·         All kind of banking works. ·         Export-Import related customs work. . Reviewing and updating financial policies & procedures, ensure proper implementation & function of performing documents. ·         Build up a better relation & correspondence with buyers, bankers, C & F agent and others. ·         Any other task, which is assigned by management. Skills & Expertise Time Management Communication in English Observation and recommendations capability with risk assesment Accounts and audit Financial Analysis Compensation & Other Benefits T/A,Mobile bill,Insurance Salary Review: Yearly Festival Bonus: 2 Increment after completion of successful probation period Promotion opportunity Free Medical check up inside the factory Sound working environment Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dinajpur (Parbatipur) Apply Procedure Email Your CV Send your CV to the given email manager-cyhr@sonic-dg.com or Email your CV from My Bdjobs account Company Information Win Champion BD Ltd. Follow More jobs from this comp"
  },
  {
    "url": "https://bdjobs.com/h/details/1458285?ln=1",
    "company_name": "Chowa a luxury lifestyle",
    "job_title": "Social Media Presenter",
    "location": "Dhaka (GULSHAN 2)",
    "salary": null,
    "experience": "At least 5 years",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Social Media Presenter : Chowa a luxury lifestyle Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Chowa a luxury lifestyle Social Media Presenter Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 25 to 35 years Location: Dhaka (GULSHAN 2) Salary: Negotiable Experience: At least 5 years Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience At least 5 years The applicants should have experience in the following business area(s): Healthcare/Lifestyle product Additional Requirements Age 25 to 35 years Responsibilities & Context Plan and create tech & gadget content for social media platforms (Facebook, YouTube, TikTok, Instagram, etc.) Generate creative daily video ideas and produce content Set up studio, lighting, and shoot videos Present on camera or provide voiceover as needed Create stylistic tech review videos (without music) Prepare videos for editing and final delivery Generate ideas for static content (posters, thumbnails) Execute product promotional content following brand guidelines Develop new content formats based on market trends Skills & Expertise Suggested by Content Creation Social Media Management Social Media Marketing (SMM) Compensation & Other Benefits Performance bonus Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (GULSHAN 2) Company Information Chowa a luxury lifestyle Follow Address: House 7/A, Level 2, Road 41, Gulshan 2, Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About "
  },
  {
    "url": "https://bdjobs.com/h/details/1458344?ln=1",
    "company_name": "South East Textiles (Pvt.) Ltd.,Unit -2 (A Unit of Inetrstoff Group)",
    "job_title": "Senior Executive / Assistant Manager – Supplier Fabric Technologist (Sainsbury’s)",
    "location": "Tangail (Mirzapur)",
    "salary": null,
    "experience": "5 to 8 years",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Senior Executive / Assistant Manager – Supplier Fabric Technologist (Sainsbury’s) : South East Textiles (Pvt.) Ltd.,Unit -2 (A Unit of Inetrstoff Group) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List South East Textiles (Pvt.) Ltd.,Unit -2 (A Unit of Inetrstoff Group) Senior Executive / Assistant Manager – Supplier Fabric Technologist (Sainsbury’s) Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 01 Location: Tangail (Mirzapur) Salary: Negotiable Experience: 5 to 8 years Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Experience 5 to 8 years The applicants should have experience in the following business area(s): Garments, Textile Additional Requirements B.Sc. In Textile Engineering. 4–8 years of experience in fabric QA / fabric technology / product development. Prior experience working with UK or EU buyers (especially Sainsbury’s, M&S, Tesco, Next, Primark) will be a strong advantage. • Strong exposure to knit, woven, and denim fabrics (depending on business need). • Strong knowledge of fabric construction, dyeing, printing, and finishing processes. • Hands-on experience with fabric testing standards (ISO, AATCC, ASTM, BS). • Clear understanding of color fastness, physical & chemical testing parameters. • Familiar with RSL, MRSL, and chemical compliance. Soft Skills & Competencies • Strong analytical and problem-solving ability. • Excellent communication and stakeholder management skills. • Ability to work under pressure and manage multiple suppliers/projects. • Good presentation and reporting skills. • Proactive, detail-oriented, and commercially aware. • Good command of English (written & verbal) for buyer communication. Responsibilities & Context The Senior Executive / Assistant Manager – Supplier Fabric Technologist will be responsible for providing end-to-end fabric technical support for Sainsbury’s supply base. The role involves close coordination with buyers, sourcing teams, garment technologists, testing laboratories, and fabric mills to ensure that all fabrics meet Sainsbury’s quality standards, performance requirements, sustainability guidelines, and compliance protocols. The position plays a critical role in fabric development, bulk approval, quality risk management, and problem-solving to ensure right-first-time production and on-time delivery Job Responsibilities: Fabric Development & Approval •\tReview and evaluate fabric specifications, swatches, lab dips, strike-offs, and bulk submissions as per Sainsbury’s standards. •\tSupport fabric development for new qualities, finishes, and constructions based on buyer requirements. •\tEnsure fabric performance meets required standards (GSM, shrinkage, color fastness, pilling, spirality, dimensional stability, etc.). Testing & Compliance •\tCoordinate with nominated third-party labs (e.g."
  },
  {
    "url": "https://bdjobs.com/h/details/1458348?ln=1",
    "company_name": "Prime Asset Group",
    "job_title": "Sr. Manager/ Asst. General Manager",
    "location": "Dhaka",
    "salary": null,
    "experience": "6 to 8 years",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Sr. Manager/ Asst. General Manager : Prime Asset Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Prime Asset Group Sr. Manager/ Asst. General Manager Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 28 to 40 years Location: Dhaka Salary: Negotiable Experience: 6 to 8 years Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Master of Business Administration (MBA) Experience 6 to 8 years The applicants should have experience in the following business area(s): Real Estate Additional Requirements Age 28 to 40 years The applicants should have experience in the following area(s): Marketing, Corporate Marketing The applicants should have experience in the following business area(s): Real Estate Good communication & negotiation skill. Strong leadership skill. Ability to work under pressure. Responsibilities & Context We are looking for a young, dynamic and energetic marketing and sales assistant general manager who has experience in the Bangladesh Real Estate/ Land Development industry . This candidate should have at least 6 to 8 years of proven experience in marketing properties, obtaining leads for the sales team to pursue and constantly find ways to innovate and integrate said innovations into the company. Highly knowledgeable on Real Estate / Land business and present market. Responsible for the entire Sales including policy formulation and implementation. Responsible to lead Sales Team and have to achieve team target. Lead the team for daily customer visit and follow up accordingly. Create new corporate/ industrial or group customer to accrue the sales target. Prepare daily work report as well as week closing report at the weekend. Time to time report to the supervisor. Able to find some new corporate house/individual customers who are eligible to buy our product. Create a strong data base and able to handle it independently. Building a strong relationship with the customers. Must be a team player, proactive, self-motivated and willing to take initiative and result oriented. Aggressive for sales completion with excellent leadership capability. Any other responsibilities as and when assigned by the management will be treated as a duty. Skills & Expertise land Sales Real Estate Marketing Sales & Marketing Suggested by Business Development Corporate Marketing Real Estate relationship building Sales Management sales strategy Team Leadership Compensation & Other Benefits Mobile bill Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Prime Asset Group Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ ক"
  },
  {
    "url": "https://bdjobs.com/h/details/1458491?ln=1",
    "company_name": "Arif Academy Inc",
    "job_title": "Spoken English Teacher",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 10000 - 20000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Spoken English Teacher : Arif Academy Inc Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Arif Academy Inc Spoken English Teacher Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 3 Location: Anywhere in Bangladesh Salary: Tk. 10000 - 20000 (Monthly) Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Responsibilities & Context Spoken English Responsibilities: Conduct Spoken English online classes for both kids and adults using both Laptop & Smart Board technology. Deliver engaging lessons focused on fluency, pronunciation, grammar, and vocabulary. Must have good computer literacy and be confident in using Zoom, PowerPoint, and other online tools. Use interactive teaching methods like role-plays, storytelling, group discussions, and multimedia activities. Assess students’ progress and provide constructive feedback. Adapt teaching techniques for different age groups and learning styles. Stay updated with modern digital teaching tools to enhance classroom engagement. Skills & Expertise Teaching/ Training Employment Status Part Time Job Location Anywhere in Bangladesh Company Information Arif Academy Inc Follow More jobs from this company Address: 7/1, Aurangajeb Road, Block-A ,Level-6, Mohammadpur, Dhaka 1207, Bangladesh. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get rea"
  },
  {
    "url": "https://bdjobs.com/h/details/1458247?ln=1",
    "company_name": "Bitopi Group",
    "job_title": "Jr. Executive - Commercial (Export)",
    "location": "Dhaka (Mirpur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "24 Feb 2026",
    "job_description": "Jr. Executive - Commercial (Export) : Bitopi Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bitopi Group Jr. Executive - Commercial (Export) Application Deadline : 24 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 20 to 40 years Location: Dhaka (Mirpur) Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 40 years Prior experience of dealing documentation for major buyers like Primark, H&M and Zara is highly preferred. Must be an Excel Expert (VLOOKUP and Pivot Tables) Young, energetic and possesses sound knowledge of RMG export documentation. Responsibilities & Context The Jr. Executive – Commercial (Export) will assist in export documentation and shipment coordination. The role involves liaising with buyers, freight forwarders, banks, and internal teams to ensure timely shipments in compliance with export regulations and company procedures. Brief JD: Prepare Sales Contracts, Commercial Invoices and all necessary shipping documents. Manage booking submissions and issue EXP. Constant follow-up with C&F agents and Freight Forwarders to ensure timely shipments. Skills & Expertise Export Documentation MS Excel vlookup Compensation & Other Benefits Provident fund,Insurance,Mobile bill Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Service Benefits, One & Half day weekly Holiday, Leave encashment & other benefits as per existing policy of the Company. Workplace Work at office Employment Status Full Time Job Location Dhaka (Mirpur) Read Before Apply Interested candidates are requested to apply with CV and photograph through Online or on below e-mail address within the deadline by following below instruction(in case of email): 1.Write the position & Department`s name in the subject. 2.Share your expected salary and benefits at the email body. 3.Don`t send any resume who doesn`t have relevant working experience & Interviewed for the same within last six months Company Information Bitopi Group Follow Address: 822/3, Begum Rokeya Sharani, Shewrapara, Mirpur, Dhaka- 1216, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid "
  },
  {
    "url": "https://bdjobs.com/h/details/1458497?ln=1",
    "company_name": "YAMAAN",
    "job_title": "Senior Digital Marketing Executive (Sales Focused)",
    "location": "Dhaka (Banani)",
    "salary": "Tk. 30000 - 35000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Senior Digital Marketing Executive (Sales Focused) : YAMAAN Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List YAMAAN Senior Digital Marketing Executive (Sales Focused) Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 20 to 30 years Location: Dhaka (Banani) Salary: Tk. 30000 - 35000 (Monthly) Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 30 years Responsibilities & Context Job Context YAMAAN is seeking a sales-driven Senior Digital Marketing Executive with proven experience in clothing/fashion products. The ideal candidate must be highly focused on increasing online sales through data-driven digital marketing and be able to present previous sales performance reports. Skills & Expertise Meta Ads (Advanced) Google Ads & Google Analytics (GA4) SEO (On-page, Off-page, Technical) Conversion Rate Optimization (CRO) Facebook Pixel & GTM Data analysis & reporting Key Responsibilities Plan, run, and optimize Meta (Facebook & Instagram) Ads for sales growth Manage Google Ads Execute SEO strategies to increase traffic and conversions Track and optimize ROAS, CPA, conversion rate, and overall sales performance Set up and manage Facebook Pixel, GA4, and Google Tag Manager Prepare and present sales and campaign performance reports Optimize ad budgets for maximum ROI Improve e-commerce sales funnels based on data and customer behavior Mandatory Requirements Hands-on experience with Clothing / Fashion / Lifestyle products Strong sales-focused mindset and interest in revenue growth Ability to show previous sales data, ad reports, and ROI results Experience running e-commerce sales campaigns Experience & Education 3–5 years of experience in Digital Marketing Minimum 2 years in fashion/clothing sales campaigns Bachelor’s degree preferred (practical experience prioritized) Skills & Expertise Facebook Ads Manager Facebook campaign Facebook marketing Facebook Pixel Google Ads Meta Marketing SEO and Digital Marketing SEO and Google ads Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Banani) Company Information YAMAAN Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean "
  },
  {
    "url": "https://bdjobs.com/h/details/1457891?ln=1",
    "company_name": "Southwest Composite Ltd.",
    "job_title": "Deputy Manager-ETP",
    "location": "Gazipur (Kaliakair)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Deputy Manager-ETP : Southwest Composite Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Southwest Composite Ltd. Deputy Manager-ETP Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 32 to 45 years Location: Gazipur (Kaliakair) Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 32 to 45 years Responsibilities & Context Operational Management: Manage and monitor daily ETP operations, including inlet effluent quality , treatment processes (biological, chemical), and final discharge to ensure compliance with environmental standards. Team Leadership: Supervise, train, and guide shift operators and technicians to ensure safety and operational efficiency. Maintenance & Troubleshooting: Oversee preventive and breakdown maintenance of machinery (pumps, aerators, filters) to minimize downtime. Compliance & Reporting: Ensure all discharge meets legal standards, manage documentation for audits (e.g., ISO, Pollution Control Board), and prepare daily shift reports. Process Optimization & Safety: Identify opportunities to reduce chemical and energy consumption (cost saving) and strictly implement safety protocols. Resource Management: Manage chemical inventory, handle reject water/sludge, and collaborate with maintenance teams for repairs. Skills & Expertise EMS ETP and WTP Health Safety and Environment Leadership and teamwork Microsoft Office Suggested by EMS ETP and WTP Health Safety and Environment Compensation & Other Benefits Mobile bill Salary Review: Yearly Lunch Facilities: Partially Subsidize Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Gazipur (Kaliakair) Apply Procedure Email Your CV Send your CV to the given email it.hr@southwest-bd.com or Email your CV from My Bdjobs account Company Information Southwest Composite Ltd. Follow Address: Plot # 122, Ward # 06, Kalampur (Chandara), KaliaKoir, Gazipur-1750 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! "
  },
  {
    "url": "https://bdjobs.com/h/details/1458389?ln=1",
    "company_name": "American School of English",
    "job_title": "Teacher - English Medium",
    "location": "Dhaka (Keraniganj Model Town)",
    "salary": "Negotiable",
    "experience": "",
    "education": "",
    "deadline": "19 Feb 2026",
    "job_description": "Teacher - English Medium : American School of English Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List American School of English Teacher - English Medium Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 4 Age: 24 to 35 years Location: Dhaka (Keraniganj Model T... Dhaka (Keraniganj Model Town) Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 24 to 35 years Preference will be given to candidates residing in Keraniganj. Responsibilities & Context Digital Content Creation: Teachers will create slides for lessons using PowerPoint with the help of computers, projectors, internet, audio-video and other materials. Making the lesson interesting and easy to understand: Thinking about difficult topics will be presented to students in an easy way by adding pictures, charts, diagrams, video clips and animations through multimedia. Keeping students focused: Multimedia makes classes more effective, interesting and enjoyable for students, which will help them maintain their attention. Modern and effective teaching: By using multimedia, teachers go beyond the traditional methods and create a student-friendly environment, which will help increase the quality of education. Training and skill acquisition: Teachers are given the necessary training to conduct multimedia classes, so that they can use these digital materials effectively. Skills & Expertise ENGLISH MEDIUM SCHOOL Experience in English Medium School Suggested by Curriculum Development Education FLUENCY IN ENGLISH LANGUAGE Lesson Planning Teaching/ Training Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Keraniganj Model Town) Company Information American School of English Follow Address: Hazi Mohammad Samsul Haque Villah, House-33, Road-2, Block-B, Model Town, Kadamtali, Keraniganj,Dhaka-1319 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq"
  },
  {
    "url": "https://bdjobs.com/h/details/1458448?ln=1",
    "company_name": "Paragon Group",
    "job_title": "AM/Sr. Officer (Sales - Egg, DOC & Pullet))",
    "location": "Bogura, Chattogram, Gazipur, Jashore, Sylhet",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "AM/Sr. Officer (Sales - Egg, DOC & Pullet)) : Paragon Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Paragon Group AM/Sr. Officer (Sales - Egg, DOC & Pullet)) Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Age: 32 to 40 years Location: Bogura, Chattogram, Gazip... Bogura, Chattogram, Gazipur, Jashore, Sylhet Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 32 to 40 years Responsibilities & Context Paragon Group is one of the largest and leading Agro-Industrial business conglomerate. We are seeking energetic, self-driven and experienced professionals for the role of Assistant Manager / Senior Officer (Sales – Egg, DOC & Pullet) . The selected candidates will be responsible for driving sales and marketing activities nationwide, ensuring customer satisfaction and contributing to the company’s continued success. Job Responsibility: Collaborate effectively with customers, dealers and sales team to achieve monthly, quarterly and annual sales targets in both volume and revenue. Develop and maintain strong relationships with dealers and farmers. Monitor market trends, competitor activities and provide feedback. Identifying problems and make agreeable solutions for increasing sales. Ensure customer orders for Commercial Eggs, DOCs and Pullets as well as pricing, delivery, payment confirmation, etc. Innovating new dealers/farmers & developing relations with new and existing customers. Work closely with the Technical Service Team to ensure quality pre- and post-sales support Any other relevant assignment given by the management/superior. Skills & Expertise Delivery Management Pricing Sales & Marketing Compensation & Other Benefits T/A,Mobile bill,Gratuity Salary Review: Yearly Festival Bonus: 3 As per policy. Workplace Work at office Employment Status Full Time Job Location Bogura, Chattogram, Gazipur, Jashore, Sylhet Read Before Apply Candidates with proven experience in the sales of Egg, DOC, and Pullet at reputed poultry companies are strongly encouraged to apply immediately. Company Information Paragon Group Follow More jobs from this company Address: Paragon House (Floor # 10), 5 Mohakhali C/A, Dhaka-1212 Website: www.paragongroup-bd.com Business: Paragon Group is one of the largest business conglomerate in the country. Main businesses are Poultry, Feeds, Dairy, FMCG, Plastic Bag, FIBC, Solar power, Footwear, etc. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়র"
  },
  {
    "url": "https://bdjobs.com/h/details/1458338?ln=1",
    "company_name": "Brahmaputra International University",
    "job_title": "Lecturer (Department of Law)",
    "location": "Jamalpur (Jamalpur Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Lecturer (Department of Law) : Brahmaputra International University Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Brahmaputra International University Lecturer (Department of Law) Application Deadline : 15 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Location: Jamalpur (Jamalpur Sadar) Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Responsibilities & Context Deliver lectures, tutorials, and seminars in assigned law courses in accordance with the approved curriculum and academic calendar. Prepare lesson plans, course outlines, teaching materials, and assessment tools to ensure effective learning outcomes. Evaluate studentsʼ performance through examinations, assignments, presentations, and research work with fairness and transparency. Provide academic guidance, mentoring, and consultation to students to support their academic and professional development. Encourage critical thinking, legal reasoning, ethical awareness, and research-oriented learning among students. Skills & Expertise Suggested by Curriculum Development Legal Affairs Lesson Planning Teaching/ Training Compensation & Other Benefits Weekly 2 holidays Festival Bonus: 2 Salary Review: Yearly Other benefits as per BRIU policy. Excellent working environment. Scope for continuous learning and career development Workplace Work at office Employment Status Full Time Job Location Jamalpur (Jamalpur Sadar) Read Before Apply Interested candidates are requested to submit their CV with cover letter and attach file of all academic certificates and marksheets, photograph (passport size) by email or hard copy. Location: Jamalpur (Jamalpur Sadar) The Registrar, Brahmaputra International University, Foujdari Morh, Jamalpur- 2000. Email: sfmu.job@gmail.com Apply Procedure Email Your CV Send your CV to the given email sfmu.job@gmail.com Company Information Brahmaputra International University Follow Address: Foujdari Morh, Jamalpur Sadar, Jamalpur-2000 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Regist"
  },
  {
    "url": "https://bdjobs.com/h/details/1458365?ln=1",
    "company_name": "A Reputed Group of Company",
    "job_title": "Assistant Manager - Quality (Self Inspection)-Knit Garments",
    "location": "Dhaka, Gazipur",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Assistant Manager - Quality (Self Inspection)-Knit Garments : A Reputed Group of Company Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Reputed Group of Company Assistant Manager - Quality (Self Inspection)-Knit Garments Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 30 to 40 years Location: Dhaka, Gazipur Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 30 to 40 years The applicants should have experience in the following area(s): Knit Garments, Quality Control/ Audit. Basic Computer skill, Garments/Textiles ERP, Advanced Microsoft Excel. Experience in Knit Garments Manufacturing Processes, Yarn Dyeing, Knitting, Dyeing and Finishing, Cutting, Sewing, Finishing etc. Communication and leadership skill is mandatory.Should have knowledge of all aspect of quality control methods and practices including AQL levels and other prevailing international standards. Positive professional attitude, self-motivated and team player. Responsibilities & Context Must be able to supervise knit garments product inspection processes, identifying and addressing defects. Perform tests for GSM, shrinkage, skewness, color fastness, and tensile strength. Monitoring compliance with industry standards. Collaborating with production teams to address quality concerns. Maintaining detailed reports on quality metrics and recommended improvements. Reducing inspection errors by implementing a new training program. Training team members on inspection techniques and quality standards. Ensure good housekeeping maintaining health & safety including 5S and compliance. Coordinate with Buying office, PPC, Merchandising, & related departments for smooth production purpose. Any other task assigned by the Management. Skills & Expertise knit garments quality Self Inspection Quality Control Audit/ Inspect Quality assurance and control Quality Control Quality controlling Compensation & Other Benefits Mobile bill,Medical allowance,Insurance,Over time allowance Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka, Gazipur Company Information A Reputed Group of Company Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 096"
  },
  {
    "url": "https://bdjobs.com/h/details/1458387?ln=1",
    "company_name": "Tycoon Hi-Tech Park Ltd.",
    "job_title": "Technician - Air Conditioner & Refrigerator, Television & Home Appliance",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Technician - Air Conditioner & Refrigerator, Television & Home Appliance : Tycoon Hi-Tech Park Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Tycoon Hi-Tech Park Ltd. Technician - Air Conditioner & Refrigerator, Television & Home Appliance Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 20 Age: 18 to 35 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 35 years Minimum 1–3 years of relevant field experience . Good knowledge of electrical circuits, wiring diagrams, and safety practices. Ability to use testing instruments such as multimeter, clamp meter, and gas gauges. Physically fit to handle fieldwork, lifting equipment, and working at heights (for AC/TV installation). Willingness to travel for on-site service calls. Basic communication skills to interact with customers professionally. Ability to diagnose problems independently and complete jobs within deadlines. Familiarity with inverter technology and smart appliances is an added advantage. Willingness to work flexible hours, including weekends or emergency calls when required. Honest, disciplined, and customer-service oriented. Responsibilities & Context Air Conditioner (AC)- Install, service, and repair split, window, and inverter air conditioners. Diagnose cooling, electrical, and mechanical faults. Perform gas charging, vacuuming, and leak detection. Repair or replace compressors, fan motors, capacitors, thermostats, and PCBs. Clean filters, coils, blowers, and drainage systems. Ensure correct electrical connections, earthing, and safety standards. Test system performance after servicing and installation. Refrigerator (Fridge)– Install and service single-door, double-door, and side-by-side refrigerators. Diagnose cooling issues, noise problems, and electrical faults. Handle refrigerant charging and leakage repairs. Repair or replace compressors, thermostats, defrost timers, heaters, sensors, and fans. Check insulation, door gaskets, and temperature control systems. Perform preventive maintenance to improve efficiency and lifespan. Television (TV)- Install and service LED, LCD, Smart TVs, and Android TVs. Diagnose display, sound, power, and connectivity issues. Repair or replace SMPS, main boards, T-Con boards, speakers, and panels (if feasible). Update software and configure smart TV settings. Ensure proper mounting, wiring, and signal connectivity. Test picture quality, audio output, and overall performance after repair. Home Appliances- Service and repair washing machines, microwave ovens, geysers, dishwashers, mixers and others. Diagnose electrical and mechanical faults in household appliances. Replace defective parts such as motors, timers, heati"
  },
  {
    "url": "https://bdjobs.com/h/details/1458496?ln=1",
    "company_name": "BHAIYA ROYAL FOOD AND BEVERAGE LIMITED",
    "job_title": "Accounts Manager",
    "location": "Cumilla (Laksam), Dhaka (Banani)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Accounts Manager : BHAIYA ROYAL FOOD AND BEVERAGE LIMITED Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List BHAIYA ROYAL FOOD AND BEVERAGE LIMITED Accounts Manager Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 25 to 50 years Location: Cumilla (Laksam), Dhaka (... Cumilla (Laksam), Dhaka (Banani) Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 50 years Responsibilities & Context 1. Financial Management & Reporting Oversee daily accounting operations and bookkeeping. Prepare monthly, quarterly, and annual financial statements. Ensure accurate recording of transactions in accounting systems. Monitor cash flow and working capital. Prepare management reports for decision-making. 2. Budgeting & Forecasting Develop annual budgets and financial forecasts. Track budget performance and analyze variances. Support management in financial planning. 3. Compliance & Audit Ensure compliance with local tax laws, VAT/GST, and statutory requirements. Coordinate with external auditors and manage audit processes. Maintain proper financial records and documentation. Implement internal controls to prevent fraud and errors. 4. Taxation & Regulatory Filings Prepare and submit tax returns, VAT, withholding tax, and other regulatory filings. Ensure timely payment of government dues. Liaise with tax authorities when required. 5. Accounts Payable & Receivable Supervise invoicing, collections, and credit control. Manage supplier payments and reconciliations. Monitor overdue receivables and follow up for collection. 6. Banking & Treasury Manage banking relationships and transactions. Handle reconciliations of bank statements. Support loan documentation and credit facilities. Oversee POS/QR and payment gateway settlements if applicable. 7. Team Leadership Supervise and train accounting staff. Allocate tasks and review team output. Improve processes and efficiency within the finance department. 8. Systems & Process Improvement Maintain accounting software and ERP systems. Recommend improvements to accounting procedures. Support digital transformation in finance operations. 9. Business Support Provide financial insights to management. Assist in pricing, cost control, and profitability analysis. Support strategic decisions with financial data. 10. Documentation & Record Keeping Maintain organized financial records and backups. Ensure proper filing of contracts, invoices, and vouchers. Skills & Expertise Accounts and Finance Workplace Work at office Employment Status Full Time Job Location Cumilla (Laksam), Dhaka (Banani) Company Information BHAIYA ROYAL FOOD AND BEVERAGE LIMITED Follow Address: House-57, Road-13/B, Block-E, Banani, Dhaka-1213 Websit"
  },
  {
    "url": "https://bdjobs.com/h/details/1458359?ln=1",
    "company_name": "South East Textile (Pvt.) Ltd. -Unit -2( Interstoff Group)",
    "job_title": "Sr. Executive/Executive (Electrical & Mechanical Eng.)-Technical Service Department (TSD)",
    "location": "Tangail (Mirzapur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Sr. Executive/Executive (Electrical & Mechanical Eng.)-Technical Service Department (TSD) : South East Textile (Pvt.) Ltd. -Unit -2( Interstoff Group) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List South East Textile (Pvt.) Ltd. -Unit -2( Interstoff Group) Sr. Executive/Executive (Electrical & Mechanical Eng.)-Technical Service Department (TSD) Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 04 Location: Tangail (Mirzapur) Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Responsibilities & Context Electrical Responsibility : Collect and analyze data and perform basic electrical tasks as required. Assemble electrical and electronic systems, using hand tools and measuring instruments. Collaborate with electrical engineers and other personnel to identify, define, and solve departmental problems. Build, calibrate, maintain, troubleshoot and repair electrical instruments or testing equipment. Investigate equipment failures and difficulties to diagnose faulty operation, and to make recommendations. Monitor personnel functions, such as supervision of electricians, technicians, and other engineers. Establish and coordinate the maintenance and safety procedures, service schedule, and supply of materials required to maintain machines and equipment in the prescribed condition. Assist superior to execute and evaluate workers’ performance, motivating workers, Incentive planning, disciplinary matters, and training needs. Other duties and responsibilities as assigned by the Technical section head pertaining to the safety, quality, compliance issues, and efficiency of the factory. Ensure the total electrical safety of the plant. To perform day to day maintenance, Electronics card repairing and operational activities of assigned unit. Hand work to machine maintenance, repair, installation, testing, commissioning, operation and maintenance activities of Compressor, WTP, Pumps, Submersible pumps, Substation and diesel generators. Monitor and ensure the operation and maintenance must take up as per our company standard. Ability to handle multiple task/trouble shooting of modern operational machines. Good report writing skill for submission of technical evaluation report and proposal for improvement of works. Perform emergency support duty as and when required by the company. Adopt safety measures among all of his subordinates. Must have adequate knowledge about BNBC, NFPA, ACCORD, RSC/NIRAPON or any other Brand audit require mats Mechanical Responsibility : Responsible machine layout set up as per production requirement. He will make a plan monthly or yearly about the machine maintenance/Schedule all equipment’s and machineries. Responsible to the proper preventive maintenanc"
  },
  {
    "url": "https://bdjobs.com/h/details/1458345?ln=1",
    "company_name": "Khandoker Enterprise",
    "job_title": "Sales Representative",
    "location": "Patuakhali",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Sales Representative : Khandoker Enterprise Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Khandoker Enterprise Sales Representative Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 10 Age: At least 19 years Location: Patuakhali Salary: Tk. 15000 - 20000 (Monthly) Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 19 years Responsibilities & Context সরাসরি সাক্ষাৎকারে কিছু নারী ও পুরুষ সেলসম্যান নিয়োগ রবি ও এয়ারটেল পরিবেশক খন্দকার এন্টারপ্রাইজ পটুয়াখালী। Skills & Expertise Sales Sales & Marketing Salesman Suggested by Sales Representative Customer Service Client Service/ Marketing Compensation & Other Benefits বেসিক ৭০০০টাকা।\nইন্সেন্টিভ ১০৫০০টাকা।\nরুট খরচ (আলোচনা সাপেক্ষে)\nআরো বিভিন্ন ক্যাম্পেইনে ২৫০০টাকা।\nসর্বমোট বেতন ২০ হাজার টাকা। (রুট খরচ বাদে) Workplace Work at office Employment Status Full Time Job Location Patuakhali Company Information Khandoker Enterprise Follow Address: Old Ferighat,Town Kakilapur Beside Toll Ghor Patuakhali Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458307?ln=1",
    "company_name": "MEGASAN Medical Industries BD Ltd.",
    "job_title": "অফিস সহায়ক (পুরুষ/মহিলা)",
    "location": "Dhaka",
    "salary": "Tk. 10000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "অফিস সহায়ক (পুরুষ/মহিলা) : MEGASAN Medical Industries BD Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List MEGASAN Medical Industries BD Ltd. অফিস সহায়ক (পুরুষ/মহিলা) Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka Salary: Tk. 10000 (Monthly) Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Responsibilities & Context অফিসের জন্যে জরুরি ভিত্তিতে একজন অফিস সহকারি প্রয়োজন সকাল ১০টা থেকে রাত ৮.৩০টা অফিস ক্লিনিং এবং চা বানানোর কাজ। Skills & Expertise Suggested by Peon Office Assistance Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information MEGASAN Medical Industries BD Ltd. Follow Address: ????? ????? ???/?,??? ???,???? Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458415?ln=1",
    "company_name": "Icicle Corporation",
    "job_title": "Sales Executive",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Sales Executive : Icicle Corporation Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Icicle Corporation Sales Executive Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 05 Age: 25 to 30 years Location: Anywhere in Bangladesh Salary: Tk. 25000 - 35000 (Monthly) Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 30 years Responsibilities & Context Identify and generate new business leads (B2B / B2C depending on product) Reach out to prospects via calls, emails, LinkedIn, and meetings Understand client needs and present suitable software solutions Prepare and deliver product demos and sales presentations Convert leads into paying customers Skills & Expertise Suggested by Client Relationship Management Client Service/ Marketing Sales & Marketing Sales target Customer Service Compensation & Other Benefits Tour allowance,Medical allowance,Over time allowance,Performance bonus,Profit share Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Icicle Corporation Follow Address: House 61 (Level-5) Road 6/A Dhanmondi R/A Dhaka-1209 Business: Icicle Corporation bring ideas into Automation .We offer   efficient  business solution and  provide full support of  web applications. We  develop  systems from scratch  also provide maintenance support. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel L"
  },
  {
    "url": "https://bdjobs.com/h/details/1458429?ln=1",
    "company_name": "A Reputed Group of Companies",
    "job_title": "Officer- Welfare & Counselling",
    "location": "Narayanganj",
    "salary": "Tk. 26000 - 28000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Officer- Welfare & Counselling : A Reputed Group of Companies Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Reputed Group of Companies Officer- Welfare & Counselling Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 25 to 32 years Location: Narayanganj Salary: Tk. 26000 - 28000 (Monthly) Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 32 years Responsibilities & Context Ensure all welfare activities in compliance with Bangladesh Labor Act 2006, Labor Rules 2015 & 2022, and BEPZA regulations. Conduct new employee orientation, welfare meetings, and training on Grievance, OHS, and Workers’ Rights. Implement and monitor an effective Grievance Management System and ensure smooth two-way communication between management and workers. Monitor worker welfare facilities (dining, washrooms, drinking water, sanitation, etc.) Ensure proper health & safety practices, especially in production areas. Prepare, maintain, update, and properly preserve all required documents, registers, and records for compliance, audits, and reporting purposes. Ensure maternity leave and maternity benefits are provided in accordance with applicable labor laws, and maintain proper documentation and records. Skills & Expertise Conflict Resolution Collaboration and Teamwork Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Narayanganj Company Information A Reputed Group of Companies Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.co"
  },
  {
    "url": "https://bdjobs.com/h/details/1458410?ln=1",
    "company_name": "Uttaran",
    "job_title": "Senior Internal Auditor",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "Senior Internal Auditor : Uttaran Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Uttaran Senior Internal Auditor Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 1 Age: At most 45 years Location: Anywhere in Bangladesh Salary: Tk. 50000 - 60000 (Monthly) Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At most 45 years Experience Requirements At least 5 year(s) in Audit department Other Requirements Minimum 5 years experiences of working in relevant position in NGO The applicants should have experience in the following area(s): Audit Proven experience in planning, budgeting, financial management, Audit, Financial Motoring procedures. Accounting Software, General Accounting, Sound Knowledge of Microsoft Office Package Can fluent conversation (Speaking & hearing) and make report in both English and Bangla Motorcycle driving with license Responsibilities & Context Job Context: Uttaran is an NGO working in Bangladesh since 1985 to uphold rights and entitlements and to improve the socio-economic condition of the poor and disadvantaged community people. Uttaran is a people-centered organization using a rights-based approach to alleviate poverty, diversify livelihood opportunities and empower poor communities of Bangladesh. Uttaran is seeking a highly skilled Internal Auditor to join our team. The successful candidate will be responsible for monitor, audit and update all project accounts and report. Uttaran invites applications for the vacant position titled- Internal Auditor Reports to: Director Employment Status: Contractual- Fixed Term Contract Job Responsibilities Represent internal audit unit of Uttaran. Develop annual internal audit plan for approval of Audit Committee. Prepare risk based internal audit plans as per annual internal audit plan. Lead the audit plan execution process at project field level. Find audit findings and report confidentially to Director Issue evidence based balanced audit reports with acknowledgement of achievements, and recommendations. Conduct follow-up of the audit reports implementation and maintain follow-up data base. Conduct field visits for audit related works. Submit semi-annual and annual reports on activities and results of the internal audit activities to Director and Audit Committee, chaired by Director and responsible for independently and professionally functioning internal audit unit. Ensure audit processes developed are followed while performing audit works. Make sure that the internal audit unit through adequate coverage of audit Provide facilitation, process design, training, and other non-executive, consultancy, services, as per request of Divisions and Provincial offices and endorsed by Director. Make sure internal audit unit acts and performs as pe"
  },
  {
    "url": "https://bdjobs.com/h/details/1458177?ln=1",
    "company_name": "Iqra Islamic School",
    "job_title": "প্রধান শিক্ষক",
    "location": "Natore",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "প্রধান শিক্ষক : Iqra Islamic School Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Iqra Islamic School প্রধান শিক্ষক Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Natore Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements শিক্ষায় সুদৃঢ় জ্ঞান ও ইসলামিক মূল্যবোধে বিশ্বাসী হতে হবে। পাঠদান ও শিক্ষা প্রশাসনে বাস্তব অভিজ্ঞতা থাকতে হবে। বিদ্যালয় পরিচালনা, পাঠ পরিকল্পনা, পরীক্ষা ব্যবস্থাপনা ও ছাত্র-শৃঙ্খলা সম্পর্কে পর্যাপ্ত ধারণা থাকতে হবে। শিক্ষক ও কর্মচারীদের নেতৃত্ব প্রদান, তদারকি ও মূল্যায়নে সক্ষম হতে হবে। বাংলায় সাবলীল যোগাযোগ দক্ষতা (ইংরেজি জানলে অগ্রাধিকার) বিদ্যালয়ের সার্বিক উন্নয়নে দূরদৃষ্টি, সততা, নেতৃত্বগুণ ও অঙ্গীকার থাকতে হবে। Responsibilities & Context নাটোর জেলার অন্তর্গত বাগাতিপাড়া উপজেলা পর্যায়ে অবস্থিত সাধারণ শিক্ষার সমন্বয়ে পরিচালিত একটি ইসলামিক স্কুলে একজন যোগ্য, অভিজ্ঞ ও দূরদর্শী প্রধান শিক্ষক নিয়োগ দেওয়া হবে। দায়িত্বসমূহ: বিদ্যালয়ের সার্বিক শিক্ষাগত, প্রশাসনিক ও শৃঙ্খলাবিষয়ক তদারকি পাঠদানের মান নিশ্চিতকরণ ও পাঠ্যক্রম বাস্তবায়ন শিক্ষক উন্নয়ন পর্যবেক্ষণ ও মূল্যায়ন আধুনিক শিক্ষার সাথে সামঞ্জস্য রেখে ইসলামিক পরিবেশ বজায় রাখা পরিচালনা পর্ষদ, অভিভাবক ও শিক্ষা কর্তৃপক্ষের সাথে সমন্বয় রক্ষা Skills & Expertise Suggested by Teaching Teaching and Training Teaching/ Training Compensation & Other Benefits যোগ্যতা ও অভিজ্ঞতার ভিত্তিতে আকর্ষণীয় বেতন বিদ্যালয়ের নীতিমালা অনুযায়ী অন্যান্য সুযোগ-সুবিধা Workplace Work at office Employment Status Full Time Job Location Natore Apply Procedure Hard Copy আগ্রহী প্রার্থীগণকে সম্পূর্ণ জীবনবৃত্তান্ত (CV), সাম্প্রতিক পাসপোর্ট সাইজ ছবি এবং শিক্ষাগত ও প্রশিক্ষণ সনদের অনুলিপিসহ আগামী ২৮ ফেব্রুয়ারি, ২০২৬ ইং তারিখের মধ্যে নিম্নোক্ত ঠিকানায় আবেদন করতে অনুরোধ করা হচ্ছে: পরিচালক, ইকরা ইসলামিক স্কুলল তমালতলা, বাগাতিপাড়া, নাটোর। যোগাযোগ ০১৭১১-৫২১২৩৮ Email: interprojectmd@yahoo.com শুধুমাত্র বাছাইকৃত প্রার্থীদের সাক্ষাৎকারের জন্য ডাকা হবে। Company Information Iqra Islamic School Follow Address: Mipur DOHS Dhaka 1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Pr"
  },
  {
    "url": "https://bdjobs.com/h/details/1458485?ln=1",
    "company_name": "INAYAT LIGHTING",
    "job_title": "Digital Platform Executive",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Digital Platform Executive : INAYAT LIGHTING Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List INAYAT LIGHTING Digital Platform Executive Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 20 to 30 years Location: Dhaka Salary: Tk. 12000 - 15000 (Monthly) Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 30 years Mastery of Canva is now a standard requirement. Proficiency in Adobe Photoshop/Illustrator is a major advantage. Knowledge of using AI Tools Understanding hierarchy, typography, and color theory so posts look professional, not amateur. Shooting high-quality video on a smartphone. Editing using apps like CapCut, Premiere Rush, or InShot (cutting to music, adding captions, transitions). Responsibilities & Context All social media management. Develop a monthly content calendar that aligns with company goals (e.g., product launches, holidays, industry news). Ensure a mix of content types: Educational (How-to), Inspirational (Quotes/Stories), Promotional (Sales), and Entertaining (Memes/Trends). Tailor tone of voice to the specific platform (e.g., professional and data-driven for LinkedIn; casual and visual for Facebook,Instagram). Research and select relevant hashtags (#) to increase reach. Create static images, carousels, and infographics using tools like Canva, Adobe Photoshop,Figma, AI tools. Film and edit short-form video (Reels, TikToks, Shorts). This includes adding captions, trending audio, and transitions. Skills & Expertise Creativity and Innovation Designing Digital Marketing (Social Media Marketing) Graphic Design and Digital Content Creation Suggested by Creative Design Typography Compensation & Other Benefits Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information INAYAT LIGHTING Follow Address: House-6/20 (2nd floor), Block# E, Satmasjid Road, Lalmatia, Dhaka, Bangladesh Website: https://www.inayatlighting.com/ Business: INAYAT Trading is a venture with a passion for Lighting and Interiors. We compile our collections with love and attention. This venture is brought to you by a team of entrepreneurs with over a decade of experience in providing integrated lighting & interior solutions. We are a team of lighting enthusiasts who are passionate about providing our customers with the highest quality lighting fixtures at affordable prices. Our products are carefully curated from top manufacturers and designers, ensuring that our customers always have access to the latest styles and trends. You can transform any room at the flick of a switch with our stylish range of lighting solutions. Discover everything from stunning chandeliers, simple ceiling lights, and elegant table lamps to"
  },
  {
    "url": "https://bdjobs.com/h/details/1458077?ln=1",
    "company_name": "Tek Group",
    "job_title": "Executive Marketing Officer",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "10 Mar 2026",
    "job_description": "Executive Marketing Officer : Tek Group Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Tek Group Executive Marketing Officer Application Deadline : 10 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 3 Age: 20 to 35 years Location: Anywhere in Bangladesh Salary: Tk. 20000 - 25000 (Monthly) Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 35 years Proficiency in Microsoft Office (Word, Excel, PowerPoint). Proficiency in English & Bangla typing. Strong written and verbal communication skills. Excellent organizational and multitasking ability. Positive attitude with eagerness to learn and growth. Responsibilities & Context Promote company services and product to support business growth. Identify and develop new business opportunities. Communicate with existing and potential clients professionally. Maintain good relationships with key stakeholders. Provide client support and respond to inquiries in a timely manner. Maintain and update client and marketing records. Conduct market research and collect Client feedback. Coordinate with management and other departments for smooth operations. Assist in marketing and promotional activities. Follow up with clients to ensure service satisfaction. Assist in preparing and maintaining business and financial documentation. Help organize files, correspondence, and program documentation. Contribute to regular administrative and coordination tasks. Prepare regular activity and performance reports. Skills & Expertise Communication Corporate Marketing Credit Management Digital Marketing Flexibility and Adaptability Presentation skill Proactive and Positive attitude Sales & Marketing Transparency Suggested by Client Relationship Management Client Service/ Marketing Marketing Compensation & Other Benefits T/A,Mobile bill,Performance bonus Salary Review: Yearly Lunch Facilities: Partially Subsidize Festival Bonus: 2 Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information Tek Group Follow Address: Blue Bell Floor#02 , House No#33A , Road No#99 , Gulshan-2 Business: Pyrolysis oil is the end product of waste tyre and plastic pyrolysis, the oil is wide used as industrial fuel to substitute furnace oil or industrial diesel. Typical industrial applications of pyrolysis oil as a fuel, the fuel oil is mainly used in Machine do not require high quality fuel oil. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন ক"
  },
  {
    "url": "https://bdjobs.com/h/details/1458409?ln=1",
    "company_name": "Cargo Center Limited, Expo Group Bangladesh",
    "job_title": "Analyst – Maintenance & IT",
    "location": "Gazipur (Tongi)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Analyst – Maintenance & IT : Cargo Center Limited, Expo Group Bangladesh Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Cargo Center Limited, Expo Group Bangladesh Analyst – Maintenance & IT Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 01 Age: 23 to 30 years Location: Gazipur (Tongi) Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 23 to 30 years BSc in Electrical & Electronic Engineering (EEE) or Electrical Engineering. Strong command of English. Minimum 1-3 years of experience in relevant fields. Experience in plant, factory, or warehouse electrical work and maintenance is preferred. Proficient in MS Word, Excel, PowerPoint, AutoCAD. Hands-on experience with warehouse equipment, generators, and IT support. Responsibilities & Context • Design and implement maintenance strategies, procedures, and equipment utilization methods. • Ensure equipment is operational as per lifecycle and prepare SOPs/checklists as required. • Carry out routine scheduled maintenance and respond promptly to equipment faults. • Maintain periodical maintenance logs and reports for audit purposes. • Oversee generator servicing, fuel, operation, and backup electricity support. • Ensure proper usage, maintenance, and cleanliness of electrical/electronic equipment (e.g., conveyor belts, forklifts, baggage scanning machines, DB boards, motors, AC units). • Assist in the procurement of mechanical and electrical equipment with proper approvals. • Maintain a complete record of equipment and asset inventory. • Manage service agreements and coordinate with vendors. • Check and support IT systems: servers, LAN, Wi-Fi, printers, scanners, PCs, UPS, IPS, attendance devices, CCTV, PABX, PA system, etc. • Assist the Project Manager in IT setup, electrical installation, and project-related work. • Oversee repair and maintenance of furniture, office equipment, warehouse infrastructure, and other development projects. • Settle monthly utility bills. • Perform any other tasks assigned by the line manager. Compensation & Other Benefits Provident fund,Mobile bill,Weekly 2 holidays,Performance bonus,Insurance,Profit share,Gratuity Salary Review: Yearly Festival Bonus: 2 Lunch Allowance Paternity Leave Bravement Leave Funeral Allowance Hajj Leave Earn Leave Encashment Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Gazipur (Tongi) Apply Procedure Email Your CV Send your CV to the given email bari@cargocenterbd.com or Email your CV from My Bdjobs account Company Information Cargo Center Limited, Expo Group Bangladesh Follow Address: 82, 83 Machimpur, Nishat Nagar, Tongi, Kamarpara, Gazipur Business: EXPO Group has started its journey in 1981 with an indelible visio"
  },
  {
    "url": "https://bdjobs.com/h/details/1458217?ln=1",
    "company_name": "Shimantik Sylhet",
    "job_title": "কমিউনিটি মোবিলাইজার (মহিলা)",
    "location": "Bandarban, Brahmanbaria, Cox`s Bazar, Cumilla, Habiganj, Khagrachhari, Moulvibazar, Rangamati, Sunamganj, Sylhet",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "কমিউনিটি মোবিলাইজার (মহিলা) : Shimantik Sylhet Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Shimantik Sylhet কমিউনিটি মোবিলাইজার (মহিলা) Application Deadline : 28 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Bandarban, Brahmanbaria, ... Bandarban, Brahmanbaria, Cox`s Bazar, Cumilla, Habiganj, Khagrachhari, Moulvibazar, Rangamati, Sunamganj, Sylhet Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements অতিরিক্ত যোগ্যতাসম্পন্ন প্রার্থীদের ক্ষেত্রে শিক্ষাগত যোগ্যতা শিথিলযোগ্য। সংশ্লিষ্ট জেলার স্থানীয় প্রার্থীদের অগ্রাধিকার দেওয়া হবে। এনজিওতে স্বাস্থ্য, পুষ্টি ও পরিবার পরিকল্পনা, পন্য বিপনন কার্যক্রম বাস্তবায়ন এবং অন্যান্য কর্মসূচী বাস্তবায়নে কাজের অভিজ্ঞতা সম্পন্ন প্রার্থীদের অগ্রাধিকার দেয়া হবে। Responsibilities & Context জাতীয় পর্যায়ের উন্নয়ন সংস্থা সীমান্তিক সিলেট, সুনামগঞ্জ, মৌলভিবাজার, হবিগঞ্জ, ব্রাহ্মণবাড়িয়া, কক্সবাজার, রাঙ্গামাটি, খাগড়াছড়ি, বান্দরবান ও কুমিল্লা জেলার বিভিন্ন উপজেলায় নারী ও শিশু স্বাস্থ্যের মানোন্নয়নের লক্ষ্যে সোশ্যাল মার্কেটিং কোম্পানি (এসএমসি) এর অর্থায়নে দীর্ঘদিন যাবৎ কমিউনিটি মোবিলাইজেশন প্রোগ্রাম এর কার্যক্রম পরিচালনা করে আসছে। প্রোগ্রামটি বাস্তবায়নের লক্ষ্যে জরুরি ভিত্তিতে উল্লেখিত পদে জনবল নিয়োগের জন্য যোগ্য বাংলাদেশি নাগরিকদের নিকট থেকে দরখাস্ত আহ্বান করা যাচ্ছে। পদের দায়িত্ব ও কর্তব্য: নির্ধারিত কর্মএলাকায় লক্ষিত জনগোষ্ঠীর মধ্যে স্বাস্থ্য ও আচরণগত ইতিবাচক পরিবর্তন সৃষ্টি করা। মা ও শিশুর স্বাস্থ্য, পুষ্টি এবং পরিবার পরিকল্পনা সামগ্রীর গুণগত মানসম্পন্ন চাহিদা সৃষ্টি ও সহজলভ্যতা নিশ্চিত করা। উঠান বৈঠক, গর্ভবতী মা সমাবেশ, নব দম্পাতি সমাবেশ এবং শিক্ষা প্রতিষ্ঠানে সেশন আয়োজনের মাধ্যমে মা, শিশু ও কিশোর-কিশোরীদের মাঝে স্বাস্থ্য বিষয়ক সচেতনতামূলক বার্তা প্রদান করে চাহিদা সৃষ্টি ও সহজলভ্যতা নিশ্চিত করা। বিভিন্ন স্বাস্থ্য বিষয়ক ক্যাম্পেইন পরিকল্পনা ও বাস্তবায়ন করা। ক্ষুদ্র উদ্যোক্তা তৈরি, তত্ত্বাবধান এবং নিয়মিত মনিটরিং করা। Compensation & Other Benefits T/A,Provident fund,Mobile bill Salary Review: Yearly Festival Bonus: 3 Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Bandarban, Brahmanbaria, Cox`s Bazar, Cumilla, Habiganj, Khagrachhari, Moulvibazar, Rangamati, Sunamganj, Sylhet Read Before Apply আগ্রহী প্রার্থীদেরকে একটি pdf ফাইলে, নির্বাহী পরিচালক, সীমান্তিক, বরাবরে সদ্য তোলা রঙিন ছবি ও মোবাইল নম্বর উল্লেখ সহ আবেদন পত্র ও পূর্ণাঙ্গ জীবন বৃত্তান্ত আগামী ২৮/০২/২০২৬ ইং তারিখের মধ্যে careers.shimantikcmp@gmail.com ইমেইলের প্রেরন করতে হবে। ইমেইলের বিষয়ে অবশ্যই পদের নাম ও পছন্দের জেলা উল্লেখ করতে হবে। Apply Procedure Email Your CV Send your CV to the given email careers.shimantikcmp@gmail.com Company Information Shimantik Sylhet Follow Address: Dr. Ahmed Al-Kabir- Shimantik Complex Masimpur, Sylhet Business: Shimantik, a national non-government organization in Bangladesh, started its activities back in 1979 initially to provid"
  },
  {
    "url": "https://bdjobs.com/h/details/1458361?ln=1",
    "company_name": "M. M. Multifiber Ltd.",
    "job_title": "AGM, Production",
    "location": "Dhaka (Green Road)",
    "salary": "Tk. 330000 - 380000 (Monthly)",
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "AGM, Production : M. M. Multifiber Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List M. M. Multifiber Ltd. AGM, Production Application Deadline : 25 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka (Green Road) Salary: Tk. 330000 - 380000 (Monthly) Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Experience: 8 to 12 years in the relevant field Responsibilities & Context Direct, plan, and coordinate manufacturing processes to meet production goals, schedules, and quality standards. Prepare and maintain production budgets, manage costs, and implement cost-reduction strategies. Enforce health and safety regulations, ensure compliance with legal/statutory standards (ISO, GMP), and maintain high quality control. Manage raw materials, inventory, equipment maintenance, and workflow to reduce downtime and improve efficiency. Supervise, train, and evaluate staff performance, assigning roles across production teams to maximize productivity. Develop operational strategies, communicate performance metrics (KPIs) to senior leadership, and implement process improvements. Liaise with purchasing, sales, and logistics teams to align production with company needs. Sets short- and long-term production strategies, balancing production lines for maximum capacity. Identifies cost-saving opportunities and manages the production budget. Any other tasks assigned by the Management. Skills & Expertise Suggested by Sales & Marketing Logistics Management Purchase/ Procurement Raw material planning Cost and Inventory Management Workplace Work at office Employment Status Full Time Job Location Dhaka (Green Road) Apply Procedure Hard Copy Apply Instruction: Deserving persons (local & expatriate) may apply with a CV along with 2 (two) recent passport size photographs and photocopies of all academic and experience certificates before the expiry of the publication of this advertisement to: M. M. Multifiber Ltd. Khwaja Enayetpuri Tower, 17 Bir Uttam K.M. Shafiullah Road (Green Road), Dhaka-1205, Bangladesh. Company Information M. M. Multifiber Ltd. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul "
  },
  {
    "url": "https://bdjobs.com/h/details/1457778?ln=0",
    "company_name": "Posted by Anonymous",
    "job_title": "Driver",
    "location": "Dhaka (Banasree)",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "08 Feb 2027",
    "job_description": "Driver : Posted by Anonymous Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Posted by Anonymous Driver Application Deadline : 08 Feb 2027 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 0 to 0 years Location: Dhaka (Banasree) Published: 08 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 0 to 0 years Responsibilities & Context জরুরি ভিত্তিতে বনশ্রীতে একটি কোম্পানির মালিকের ব্যক্তিগত গাড়ি চালানোর জন্য দক্ষ, সৎ, আন্তরিক ও পেশাদার একজন ড্রাইভার দরকার। তাকে হাইব্রিড গাড়ি চালানোর অভিজ্ঞতা সম্পন্ন ও অধুৃপায়ী হতে হবে। শিক্ষাগত যোগ্যতা: কমপক্ষে অষ্টম শ্রেণী পাস। গাড়ি চালানোর অভিজ্ঞতা: কমপক্ষে ০৭ বছর যোগাযোগ : ০১৩৩৫ ১০৫ ৮৮৮ (01335105888) . Employment Status Full Time Job Location Dhaka (Banasree) Company Information Posted by Anonymous Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1458364?ln=1",
    "company_name": "Bandhu Social Welfare Society",
    "job_title": "Medical Assistant",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "Medical Assistant : Bandhu Social Welfare Society Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Bandhu Social Welfare Society Medical Assistant Application Deadline : 18 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: 20 to 35 years Location: Dhaka Salary: Tk. 20674 - 23294 (Monthly) Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 35 years Experience to work with key population will be get preference. Experience to report writing & documentation. Experience on working in HIV/AIDS prevention program. Responsibilities & Context Provide quality STI and other health services to the Hijra and other marginalized population at service centers, which include DICs, Sub-DICs, Outlets and Satellites, and community settings. Provide differentiated HIV testing services (HTS) (including HIV self-testing, partner testing, index testing, couple testing, social-network based testing) to the the Hijra and other marginalized population at service centers and community settings. Conduct physical examinations of the beneficiaries maintaining proper infection prevention procedure and ensure privacy during physical examination. Record present and past medical complaints of beneficiaries properly in the health card and prescribe medicines as per the treatment protocol; ensure proper dispensing of drugs including STI to beneficiaries of the service centers and maintain records accordingly. Provide prescriptions or facilitate referral for STIs of the Hijra and other marginalized population Provide referral services to the Hijra and other marginalized population for complicated STIs and other required services to GoB health facilities. Provide counseling assistance in regards to personal risk assessments, perform 4Cs according to National as well as project guideline during counseling; demonstrate proper use of health product; Ensure availability and maintenance of proper clinical set up (e.g. patient bed, spot light, patient screen, adequate lighting facilities, running water supply etc.), infection prevention equipment and clinical equipment (e.g. BP machine, thermometer, weight machine, proctoscope etc.). Ensure that they are in operation and properly used. Ensure that adequate medicines are kept in the store in proper environment as per the standard practice and relevant SoP; update medicine stock register regularly, review medicine stock, notify regarding any stock-out/short expiry situation to concerned authority at least four (4) months back and prepare medicine requisition when required. Ensure ethical issues like confidentiality, non-discriminatory attitude towards the Hijra and other marginalized population are maintained; and treat beneficiaries with respect and d"
  },
  {
    "url": "https://bdjobs.com/h/details/1458484?ln=1",
    "company_name": "INAYAT LIGHTING",
    "job_title": "Senior Executive - Sales & Marketing (Lighting Division)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Senior Executive - Sales & Marketing (Lighting Division) : INAYAT LIGHTING Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List INAYAT LIGHTING Senior Executive - Sales & Marketing (Lighting Division) Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Age: 25 to 40 years Location: Dhaka Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 40 years Bike riding skill & having own driving license is mandatory 3–5 years of experience in lighting sector. Proven track record in project-based B2B sales and specification-driven markets. Experience working with architects, interior designers, developers, and hospitality clients. Exposure to startup environments or premium / luxury brands preferred. Strong knowledge of architectural, decorative, and technical lighting solutions. Understanding of lighting concepts such as lux levels, color temperature, beam angles, and controls. Familiarity with smart lighting, automation systems, and sustainable lighting solutions. Ability to drive brand visibility through industry events, exhibitions, and networking. Experience in pricing strategy, margin management, and deal negotiations. Excellent communication, presentation, and interpersonal skills. Client-centric approach with a focus on long-term partnerships. Results-driven, well-groomed, and brand-conscious professional. Willingness to travel extensively for projects and business development. Responsibilities & Context Sales Growth & Business Development Drive sales revenue for architectural, commercial, and decorative lighting products across assigned regions or key accounts. Identify and develop new business opportunities with architects, interior designers, showroom, real estate company, universities, hospitals contractors, distributors, and corporate clients. Build and maintain strong relationships with channel partners, dealers, and project consultants. Prepare and execute sales plans to meet monthly, quarterly, and annual targets. Negotiate pricing, contracts, and project terms to maximize profitability. Branding & Market Presence Strengthen brand visibility and positioning in the lighting market through strategic outreach and engagement. Promote the company’s lighting solutions through presentations, product demos, exhibitions, and industry events. Work closely with the marketing team to align sales activities with branding campaigns. Ensure consistent brand messaging across all customer touchpoints. Gather market and competitor insights to support brand differentiation. Project & Key Account Management Manage end-to-end lighting projects, from lead generation to order closure and post-sales coordination. Coordinate with design, production, and installation teams to ensu"
  },
  {
    "url": "https://bdjobs.com/h/details/1458452?ln=1",
    "company_name": "Fiber @ Home Ltd.",
    "job_title": "Network Patrolling Officer",
    "location": "Dhaka (GULSHAN 1)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Network Patrolling Officer : Fiber @ Home Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Fiber @ Home Ltd. Network Patrolling Officer Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Age: 25 to 32 years Location: Dhaka (GULSHAN 1) Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 32 years Basic understanding of underground fiber cable and network setup Hands-on experience in field patrolling and site inspection Ability to work and communicate with internal teams and external authorities Familiarity with shifting, protecting, and safeguarding fiber network during field activities Responsibilities & Context Engage proactively to safeguard LDP (Local Distribution Point), HH (Hand Hole), HH Slab (Hand Hole Slab), BDB Box (Building Distribution Box), and FAT/MFAT (Fiber Access Terminal / Mini Fiber Access Terminal) from damage during development or excavation activities conducted by different authorities. Monitor field team movements to prevent existing Backbone network cuts at high-risk locations. Physically inspect existing LDP quality and report findings to the concerned Zone In-charge following standard procedures. Conduct joint visits for shifting or relocating existing networks due to development activities in coordination with Infrastructure Planning, Implementation and zonal teams. Proactively follow up with concerned authorities and share existing network drawings of Fiber@Home Ltd during underground or HDD (Horizontal Directional Drilling) activities to reduce network damage risks. Compensation & Other Benefits Mobile bill, Provident fund, Weekly 2 holidays, Profit share Lunch Facilities: Partially Subsidize Salary Review: Yearly Festival Bonus: 2 Life Insurance, Medical Insurance, Welfare Fund. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (GULSHAN 1) Company Information Fiber @ Home Ltd. Follow More jobs from this company Address: House # 7/B, Road # 13, Gulshan-1, Dhaka-1212 Business: Fiber @ Home Ltd. is the company which acquired the NTTN (Nationwide Telecommunication Transmission Network) & ITC (International Terrestrial Cable )  license, issued by the GOB. Fiber @ Home has been formed with the professionals and financial backing from leading telecommunication entrepreneurs of the country and in the venture of laying out fiber optic network to cover Bangladesh and beyond with a view to facilitate our ever expanding telecommunication sector. This fiber optic network will eventually become the major backbone for all kinds of telecommunications and electronic entertainment services that we are enjoying these days. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যা"
  },
  {
    "url": "https://bdjobs.com/h/details/1458317?ln=1",
    "company_name": "KEPZ Trust Hospital",
    "job_title": "Specialist / Consultant (Physical Medicine)",
    "location": "Chattogram",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Specialist / Consultant (Physical Medicine) : KEPZ Trust Hospital Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List KEPZ Trust Hospital Specialist / Consultant (Physical Medicine) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Chattogram Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Ambitious, Dedicated, Hard Working Development Experiences particularly on Medical. Must have valid registration with BMDC. Willing to take challanges of work pressure & development deadline. To perform additional duties to meet with the Company`s needs as required and assigned by management. Responsibilities & Context Provide expert clinical assessment, diagnosis, and treatment for patients with musculoskeletal, neurological, and chronic pain conditions. Lead and develop physical medicine and pain management services, therapies, and rehabilitation pathways. Work collaboratively with surgeons, physicians, therapists, and allied healthcare teams. Conduct outpatient clinic consultations and inpatient care as required. Develop individualized treatment plans including therapeutic interventions, medication management, and interventional pain procedures (if qualified). Monitor and document patient outcomes, treatment efficacy, and progress. Educate patients, families, and junior staff on pain control, rehabilitation goals, and home management plans. Contribute to hospital quality improvement, clinical protocols, medical education, and pain management strategies. Experience with interventional pain procedures (e.g., nerve blocks, injections) is an advantage. Ability to contribute to clinical guideline development and rehabilitation program design. Commitment to evidence-based practice and patient-centered care. Participate in clinical audits and quality improvement initiatives Teach and support junior clinical staff, maintain patient records, and uphold hospital policies. Skills & Expertise Suggested by Doctor Health Health/ Medical Medicine Workplace Work at office Employment Status Full Time Job Location Chattogram Company Information KEPZ Trust Hospital Follow Address: KEPZ Trust Hospital, PS. Karnaphuli , Chattogram, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle"
  },
  {
    "url": "https://bdjobs.com/h/details/1458451?ln=1",
    "company_name": "AW Communication",
    "job_title": "Motion Video Editor",
    "location": "Chattogram (Agrabad)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Motion Video Editor : AW Communication Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List AW Communication Motion Video Editor Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 01 Age: At least 20 years Location: Chattogram (Agrabad) Salary: Tk. 20000 - 25000 (Monthly) Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 20 years Strong proficiency in Adobe After Effects & Adobe Premiere Pro Solid understanding of motion design, animation principles, and video storytelling Experience with color correction, sound syncing, and visual pacing Ability to translate concepts into engaging visual narratives A strong portfolio showcasing motion graphics and video editing work Attention to detail and a creative mindset Nice to Have (Bonus Skills) Knowledge of Photoshop / Illustrator Experience with social media ad creatives Basic understanding of branding and digital marketing Ability to work independently and take creative ownership Responsibilities & Context About the Role If After Effects feels like home and Premiere Pro is your playground , we’re looking for a creative storyteller who can turn ideas into visually compelling motion content. You’ll work closely with our creative and marketing team to produce engaging videos for brands, campaigns, and digital platforms. Key Responsibilities Create high-quality motion graphics and video edits for digital marketing, social media, and branding campaigns Edit videos using Adobe Premiere Pro with strong pacing, transitions, and storytelling Design animations, titles, lower-thirds, and visual effects using Adobe After Effects Collaborate with content strategists, designers, and clients to understand project requirements Optimize videos for different platforms (Facebook, Instagram, YouTube, Ads, etc.) Maintain brand consistency across all visual outputs Manage multiple projects and meet deadlines efficiently Skills & Expertise Designing Motion Design motion graphics Video Editing Video Editor Suggested by Motion Video Adobe indesign Video content creating Compensation & Other Benefits Performance bonus Festival Bonus: 2 Creative freedom and growth opportunities Collaborative and friendly work environment Opportunity to work on diverse local & international projects Performance-based growth and long-term collaboration potential Workplace Work at office Employment Status Full Time Job Location Chattogram (Agrabad) Company Information AW Communication Follow Address: Chattogram Software Technology Park, Singapore Bangkok Market, Agrabad, Chattogram. Business: AW Communication (aka AWC Global limited internationally) is a MULTIDIMENSIONAL BPO Firm, run by some Dedicated, Energetic and Dynamic young entrepreneurs. AW Communication provides you t"
  },
  {
    "url": "https://bdjobs.com/h/details/1458460?ln=1",
    "company_name": "SGS Bangladesh Limited",
    "job_title": "Project Engineer _Office Relocation",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Project Engineer _Office Relocation : SGS Bangladesh Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List SGS Bangladesh Limited Project Engineer _Office Relocation Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements 3 to 4 years of relevant experience in fit-out or laboratory projects (Textile Laboratory is an extra preference). Experience working in PMC-led or multi-vendor project environments is preferred. Strong site execution and coordination capability. Ability to interpret drawings and technical specifications. Good reporting and communication skills.Proactive, detail-oriented, and able to work independently on-site. Responsibilities & Context Provide day-to-day on-site supervision of civil works, MEP (Mechanical, Electrical, and Plumbing), fit-out, installation, and related activities. Coordinate with PMC and vendors to ensure work is executed in line with approved drawings, specifications, and timelines. Monitor site progress and submit daily and weekly progress reports. Support coordination of critical workstreams, including laboratory setup and validation, HVAC (Heating, Ventilation, and Air Conditioning) and utility works, equipment relocation, and fit-out execution. Ensure compliance with safety, quality, and regulatory requirements, and promptly flag any deviations or risks. Support inspections, testing, commissioning, and final project handover activities. Employment Status Contractual Job Location Dhaka Read Before Apply The Contractual Engineer will provide full-time on-site supervision and coordination to ensure effective execution of the relocation project. The role focuses on timely issue resolution and strict adherence to quality, safety, and schedule requirements. Contract Type & Duration: Fixed-term contractual engagement for 8–9 months, from onboarding through project close-out. The role will cover fit-out, installation, commissioning, validation, and final handover phases. Company Information SGS Bangladesh Limited Follow More jobs from this company Address: House No. 37, Road No. 24, Gulshan-1, Dhaka - 1212 Business: SGS is the world’s leading Testing, Inspection and Certification company. We operate a network of over 2,500 laboratories and business facilities across 115 countries, supported by a team of 99,500 dedicated professionals. With over 145 years of service excellence, we combine the precision and accuracy that define Swiss companies to help organizations achieve the highest standards of quality, compliance and sustainability.\n\nOur brand promise – when you need to be sure – underscores our commitment to trust, integrity and reliability, enabling busin"
  },
  {
    "url": "https://bdjobs.com/h/details/1458298?ln=1",
    "company_name": "Da Birulia.",
    "job_title": "Housekeeper (Experienced)",
    "location": "Dhaka (Savar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "Housekeeper (Experienced) : Da Birulia. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Da Birulia. Housekeeper (Experienced) Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: At least 20 years Location: Dhaka (Savar) Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 20 years Minimum 1–2 years experience as a Housekeeper in a hotel/resort/guest house Knowledge of proper cleaning methods and hygiene standards Physically fit and able to work long hours if required Honest, punctual, and hardworking Ability to follow instructions and work as part of a team Local candidates from Savar/Birulia area will get preference Responsibilities & Context Da Birulia Private Resort is seeking two experienced Housekeepers to maintain high standards of cleanliness, hygiene, and guest comfort across resort rooms and common areas. The role requires attention to detail, discipline, and prior experience in hotels or resorts. Key Responsibilities: * Clean and maintain guest rooms, cottages, washrooms, and balconies as per resort standards * Ensure cleanliness of common areas (lobby, dining area, walkways, staff areas) * Change bed linens, towels, and replenish toiletries regularly * Report maintenance issues or damaged items to the supervisor immediately * Follow daily, weekly, and deep-cleaning schedules * Handle cleaning equipment and chemicals safely * Assist during peak occupancy, events, or group bookings * Maintain discipline, hygiene, and professional behavior at all times Skills & Expertise Housekeeping Compensation & Other Benefits Duty roster as per resort operation Accommodation/meal (if applicable – optional based on management decision) Salary: Negotiable (based on experience) Free accommodation & food provided Festival bonus as per company policy Performance bonus based on work efficiency and behavior Career growth opportunity Yearly salary review. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Savar) Company Information Da Birulia. Follow Address: House 996 Road 9/A, Avenue 11 Mirpur DOHS Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for "
  },
  {
    "url": "https://bdjobs.com/h/details/1458495?ln=1",
    "company_name": "Arif Academy Inc",
    "job_title": "Digital Marketer",
    "location": "Anywhere in Bangladesh",
    "salary": "Tk. 15000 - 25000 (Monthly)",
    "experience": "",
    "education": "",
    "deadline": "11 Mar 2026",
    "job_description": "Digital Marketer : Arif Academy Inc Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Arif Academy Inc Digital Marketer Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Location: Anywhere in Bangladesh Salary: Tk. 15000 - 25000 (Monthly) Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Responsibilities & Context Job Description: We are looking for a Digital Marketer to grow our online IELTS/Spoken English school. You will be responsible for the entire student acquisition funnel—from creating content that builds trust with test-takers to managing paid ads and optimizing our email automation. Core Responsibilities Develop and execute a content calendar focused on high-value IELTS topics. Create engaging short-form and long-form educational guides (blogs/YouTube) that showcase our teaching expertise. Manage \"Social Proof\" by collecting and showcasing student success stories and testimonial videos. Lead Generation & Funnel Management: Design and optimize lead magnets to capture student emails. Manage WhatsApp, Email marketing automation (drip campaigns) to nurture free users into paid course enrollees. Paid Acquisition (PPC): Run targeted ad campaigns on Facebook/Instagram (retargeting website visitors) and Google Ads (targeting keywords like \"IELTS online course\" or \"IELTS preparation\"). Monitor ROI (Return on Investment) and CPA (Cost Per Acquisition) to ensure profitable student enrollment. Community Management: Engage with students in our social media comments, Facebook Groups, or Telegram channels to build community and trust. Answer pre-sales questions via DMs or email with a helpful, consultative tone. Requirements (Skills & Experience): Experience: 2+ years in digital marketing, preferably in EdTech, online coaching, or language learning sectors. Technical Skills: Proficiency with Google Analytics & Search Console to track traffic and conversion rates. Experience with email marketing tools. Basic graphic design (Canva/Photoshop) and video editing skills (CapCut/Premiere) for social content. Soft Skills: Ability to communicate effectively with a diverse, international audience of non-native English speakers. Understanding the \"pain points\" of IELTS students (fear of failure, deadline pressure) to write copy that resonates. Proven track record of selling digital courses or info-products. Familiarity with the IELTS exam structure (Academic vs. General Training). Experience managing student communities on Telegram or Discord. Knowledge of SEO strategies specifically for educational keywords. Skills & Expertise Digital Marketing (Social Media Marketing) Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Arif Academy Inc"
  },
  {
    "url": "https://bdjobs.com/h/details/1458144?ln=1",
    "company_name": "Kingston Hospital Ltd.",
    "job_title": "Pharmacist",
    "location": "Dhaka (Mirpur12)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Pharmacist : Kingston Hospital Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Kingston Hospital Ltd. Pharmacist Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 20 to 35 years Location: Dhaka (Mirpur12) Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 35 years Proper knowledge about all kind of medicine, drug and surgical item. Proper knowledge about storage & order system. Customer satisfaction should be the main focus. Have a clear idea regarding the pharmacy inventory system. Understanding customer needs, selling process properly Good knowledge about pharmacy software. Responsibilities & Context Kingston Hospital: Looking for a skilled pharmacist for Kingston Model Pharmacy. Responsibilities: Maintain good liaison with all the suppliers and pharmaceutical companies. Maintain government regulations and government standards in the Pharma business. Preparation of regular sales and cash statement. Preparing purchase order, grn, performing inventory & stock in medicine to the pharmacy software etc. Keep pharmacy always neat and clean. Management of expired medicine. Well behave with customer & patient. Any other responsibility as and when given by the management. Skills & Expertise Communication Skill Presentation skill Reporting and Documentation Well Behaved Suggested by Inventory Control Pharmaceuticals Pharmacist Quality Control Compensation & Other Benefits Festival Bonus: 2 Salary Review: Yearly Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mirpur12) Company Information Kingston Hospital Ltd. Follow Address: House No. 51 & 52, Road No. 01 and 02, Block -D, Sohidbag, Mirpur-12, Dhaka- 1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ই"
  },
  {
    "url": "https://bdjobs.com/h/details/1458277?ln=1",
    "company_name": "GPH Ispat Limited",
    "job_title": "Officer - Costing",
    "location": "Chattogram (Sitakunda)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Officer - Costing : GPH Ispat Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List GPH Ispat Limited Officer - Costing Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Location: Chattogram (Sitakunda) Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Strong knowledge of cost accounting and industrial costing concepts. Practical experience in SAP (production, consumption, costing modules preferred). Proficiency in MS Excel and financial analysis tools. Strong analytical, reconciliation, and reporting skills. Ability to work closely with cross-functional teams (Production, Store, Engineering). Good communication and coordination skills. Responsibilities & Context Job Purpose To support plant financial operations by preparing accurate costing, production reconciliation, budgeting, and analytical reports, ensuring effective cost control and timely financial information for management decision-making. Prepare daily log sheets and breakdown reports for cost analysis purposes. Prepare and circulate daily cost analysis reports for the plant to management. Prepare daily production, delivery, and closing stock reports and share with respective HODs. Prepare daily reconciliation reports (Actual vs SAP) for production and consumption data. Prepare monthly product-wise cost-benefit analysis reports. Prepare daily and monthly power consumption reports for monitoring and analysis. Prepare investment feasibility reports as required by management. Assist in preparation of departmental budgets and cost optimization plans. Prepare post-budget variance reports with detailed root cause analysis for any deficit or surplus. During plant shutdowns, coordinate with Production and Store departments to take floor stock. Prepare and submit shutdown-related reports as per management requirements. Maintain regular communication with Production teams to ensure timely and accurate production and consumption entries in SAP. Support data accuracy and compliance in SAP-related costing and reporting activities. Perform any other duties assigned by the line manager from time to time in line with organizational needs. Skills & Expertise Budgeting and Forecasting Costing Planning and budget SAP Financial Analysis Compensation & Other Benefits Provident fund,Profit share,Gratuity,Insurance,Mobile bill Lunch Facilities: Full Subsidize Festival Bonus: 3 Pick and Drop facility Full subsidize Additional Alternative weekly weekend facility Workplace Work at office Employment Status Full Time Job Location Chattogram (Sitakunda) Read Before Apply Please mention “Application for Officer-Costing” in subject line Apply Procedure Email Your CV Send your CV to the given email career@gphispat.com.bd or Email"
  },
  {
    "url": "https://bdjobs.com/h/details/1458384?ln=1",
    "company_name": "HTI Surgical",
    "job_title": "Store and Inventory Executive (Back Office - Desk Job)",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Store and Inventory Executive (Back Office - Desk Job) : HTI Surgical Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List HTI Surgical Store and Inventory Executive (Back Office - Desk Job) Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Minimum 3 years of experience in store or inventory management (back office/desk-based role preferred). Strong knowledge of inventory documentation and reporting procedures. Proficiency in MS Excel, MS Word, and inventory. High attention to detail and strong organizational skills. Good communication skills and ability to work independently. Responsibilities & Context Job Description: We are looking for a skilled and detail-oriented Store and Inventory Executive for a back-office desk-based position in Dhaka. The selected candidate will be responsible for maintaining accurate inventory records, coordinating stock documentation, and supporting inventory operations through systematic reporting and data management. Key Responsibilities: Maintain and update inventory records, stock registers, and documentation. Prepare daily, weekly, and monthly inventory reports. Monitor stock movement through system entries and documentation control. Coordinate with store, procurement, and accounts departments regarding stock updates. Verify inventory data, delivery notes, and issue records for accuracy. Support physical stock audits by reconciling system data with reports. Ensure proper filing and record-keeping in compliance with company policies. Assist management with inventory analysis and reporting as required. Fulfill duties assigned by the top management. Skills & Expertise Suggested by Inventory Management Inventory Store Management Store Management Store/ inventory Compensation & Other Benefits Competitive salary Professional work environment Career growth opportunities Employment Status Full Time Job Location Dhaka Company Information HTI Surgical Follow More jobs from this company Address: BTI Emporium, Level-6, Mirpur Road, Shyamoli, Dhaka-1207 Business: HTI Surgical has been recognized as the market leader in the manufacturing and distribution medical equipment in the field of Dermatology, Hair Transplant, Plastic and Aesthetic Surgery, Ophthalmology, Gynecology and General surgery. We are the pioneer to provide Plastic and Cosmetic surgical as well as non surgical items from worldwide reputed company; Liposuction Cannula from UK, Liposuction machine from Nouvag Range- Switzerland, and all types of instruments for Obesity management. We can provide Silicone Breast Implants and give you assurance for lifelong guarantee from Hong Kong, Brazil and USA. We have Sili"
  },
  {
    "url": "https://bdjobs.com/h/details/1457661?ln=1",
    "company_name": "Leatherex Footwear Ind. Ltd.",
    "job_title": "Manager - HR Admin And Compliance",
    "location": "Dhaka (Savar)",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "09 Mar 2026",
    "job_description": "Manager - HR Admin And Compliance : Leatherex Footwear Ind. Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Leatherex Footwear Ind. Ltd. Manager - HR Admin And Compliance Application Deadline : 09 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 2 Age: At least 30 years Location: Dhaka (Savar) Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 30 years Responsibilities & Context Human Resources Develop, implement, and monitor HR policies, procedures, and SOPs in line with labor law and company standards Manage recruitment, onboarding, contracts, confirmations, promotions, transfers, and separations Oversee attendance, leave, payroll coordination, increments, and disciplinary processes Maintain employee records, HRIS, and personnel files with confidentiality and accuracy Handle grievances, employee relations, and conflict resolution Lead performance appraisal processes and support training & development initiatives Ensure compliance with Bangladesh Labor Law and buyer code of conduct Administration Oversee general administration, office management, and facility support services Manage security, transport, housekeeping, canteen, and utility services Coordinate licenses, renewals, statutory documents, and factory registrations Supervise admin staff and vendors; control admin budgets and expenses Ensure smooth coordination between management, departments, and external parties Compliance Ensure full compliance with Bangladesh Labor Law and buyer Codes of Conduct Lead and manage buyer, third-party, and regulatory audits (BSCI, SEDEX/SMETA, ILO, HIGG etc.) Prepare, implement, and close Corrective Action Plans (CAPs) within required timelines Maintain complete, accurate, and audit-ready compliance documentation and records Act as the primary compliance focal point for buyers, auditors, and authorities Monitor compliance in working hours, wages, overtime, leave, and employment practices Oversee health, safety, fire, and environmental compliance, including drills and risk assessments Conduct internal audits and regular factory inspections to identify and prevent non-compliance Manage grievance mechanisms and worker welfare committees Deliver compliance training and awareness programs for workers and management Reporting & Leadership Prepare HR, admin, and compliance reports for management and buyers Advise management on labor risk, compliance gaps, and improvement plans Lead and develop HR, admin, and compliance teams to ensure operational excellence Skills & Expertise Administration Compliance Factory HR Administration Health Safety Environment HR and Administration HR and compliance Payroll Administration Suggested by Human Resource Management Human R"
  },
  {
    "url": "https://bdjobs.com/h/details/1458370?ln=1",
    "company_name": "Disabled Development and Research Center (DDRC)",
    "job_title": "CBR Programe Officer",
    "location": null,
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "CBR Programe Officer : Disabled Development and Research Center (DDRC) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Disabled Development and Research Center (DDRC) CBR Programe Officer Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Chattogram Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Responsibilities & Context The Community-Based Rehabilitation (CBR) Officer will be responsible for implementing, monitoring, and supporting inclusive CBR activities in the community. This role focuses on ensuring the active participation and empowerment of children and youth with disabilities across all domains of CBR, including education, health, livelihood, social participation, and empowerment. The CBR Officer will collaborate closely with families, community stakeholders, and service providers to create an enabling and inclusive environment. Job Location: The position is based in Chattogram City Corporation of Chattogram District and with regular travel to Thana and Word level for implementation of project activities smoothly. Responsibilities: Mobilize local communities to actively engage in and participate in CBR activities. Within the framework of the CBR matrix, work with families and communities to identify, implement, and establish measures to empower persons with disabilities in sustainable ways. Collaborate with families and communities to undertake relevant activities to prevent disabilities. This includes, but is not limited to, conducting talks on prevention, identification, referral, and follow-up tailored to each family’s needs and addressing their questions. Conduct home visits to persons with disabilities and provide training to enhance their skills and abilities, enabling their participation in family and social life. Provide social support to children with disabilities and their families. Identify and refer children with disabilities requiring care to the appropriate services. Conduct follow-ups for persons referred to services and care facilities. Encourage communities to offer economic empowerment opportunities in inclusive ways. Participate in the planning, effective organization, and reporting of community outreach programs. Collaborate with local government services and authorities to provide support to children and youth with disabilities. Partner with NGOs to implement sustainable interventions for children with disabilities. Work closely with persons with disabilities, actively involving them in program activities. Undertake local resource mobilization initiatives to support children with disabilities. Raise awareness among households and communities about Ear, Nose, and Throat (ENT) health, as well as mental health (MH). Identify and refer indi"
  },
  {
    "url": "https://bdjobs.com/h/details/1458349?ln=1",
    "company_name": "Farees Construction Limited",
    "job_title": "Executive (Accounts) cum Auditor",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Executive (Accounts) cum Auditor : Farees Construction Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Farees Construction Limited Executive (Accounts) cum Auditor Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Practical Experience in Microsoft Word, Excel, Email Correspondence & Tally Software. Good command over English & Bangla both in writing & speaking Interpersonal skills. Report writing and Presentation Skills. Responsibilities & Context Adequate Knowledge on Accounting methods and software (Tally/Excel/Ms Office). Ability to endorse bills & vouchers and ensure posting on ERP (Enterprise Resource Planning) software. Experience in preparing monthly, quarterly and yearly financial statements, year-end closing and different kinds of financial reports. Analytical capacity and interpret variances (Budget vs. Actual) on monthly basis. Skills & Expertise Suggested by Accounting Accounting Software Accounts and Finance Employment Status Full Time Job Location Anywhere in Bangladesh Apply Procedure Email Your CV Send your CV to the given email rbornali@yahoo.com Company Information Farees Construction Limited Follow Address: House # 657, Road # 10, Ave-04, Mirpur DOHS, Dhaka-1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter"
  },
  {
    "url": "https://bdjobs.com/h/details/1457914?ln=0",
    "company_name": "Unknown",
    "job_title": "Driver",
    "location": "Dhaka (Dhanmondi 27)",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "08 Feb 2027",
    "job_description": "Driver : Unknown Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Unknown Driver Application Deadline : 08 Feb 2027 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Age: 0 to 0 years Location: Dhaka (Dhanmondi 27) Published: 08 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age 0 to 0 years Responsibilities & Context পদের নাম : অফিস এসিস্ট্যান্টট ক্যাম ড্রাইভার পদ সংখ্যা : ০১ (পুরুষ) প্রতিষ্ঠান : হোয়াইট হল কর্মস্থল : ধানমন্ডি ২৭, ধানমন্ডি, ঢাকা। দায়িত্বসমূহ: * বেশিরভাগ সময় অফিস এ কাজ করতে হবে। * অফিসের ফাইল, ডকুমেন্ট দেখে রাখা এবং সংরক্ষণ করা। অফিসার কাজে সহায়তা করা। * গাড়ী চালান।  সপ্তাহে ২ অথবা ৪ দিন গাড়ি চালানোর ডিউটি থাকতে পারে। যোগ্যতা: * শিক্ষাগত যোগ্যতা: ন্যূনতম স্নাতক পাস * অভিজ্ঞতা: ন্যূনতম ১ বছর * প্রয়োজনীয় দক্ষতা: * কম্পিউটার ব্যবহার করার অভিজ্ঞতা থাকতে হবে। MS Office- ব্যাসিক জানা থাকা লাগবে। * বৈধ লাইসেন্স থাকতে হবে। * গাড়ি চালাতে জানতে হবে। রোড সম্পর্কে ধারনা থাকলে ভালো। বেতন ও সুবিধা: * আলোচনা সাপেক্ষ * ব্যাচেলর হলে থাকা এবং ২ বেলা খাবারের ব্যবস্থা করা দেওয়া যাবে। * অন্যান্য সুযোগ-সুবিধা কোম্পানির নীতিমালা অনুযায়ী প্রযোজ্য। যদি আপনি যোগ্য প্রার্থী হয়ে থাকেন। আপনার সিভি আমাদের পাঠাতে পারেন। **শুধু মাত্র পুরুষ প্রার্থীগন আবেদন করবেন। আবেদন পদ্ধতি: আগ্রহী প্রার্থীদের CV পাঠাতে পারেন আমাদের এই ইমেইলে অথবা হোয়াটসঅ্যাপ — সাবজেক্টঃ Application for Office Assistant cum Driver 📧 prianka.athar@gmail.com WhatsApp: 01926-671130 Employment Status Full Time Job Location Dhaka (Dhanmondi 27) Company Information Unknown Follow More jobs from this company Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com Accessibility of the Organization This company has following facilities for person of disabilities Accessible documentation and alternative formats Accessible Washrooms / Toilets Adapted Transport facility for Distant Travelling Assistive Software, communication and computer devices Available Flexible working shifts “Accessibility features are self-reported by the employer and we trust the reliability of this information. We unable to verify the employer’s accessibility features statement. Please use the report feature in this page if you believe this information is innacurate.” Back to Top ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্র"
  },
  {
    "url": "https://bdjobs.com/h/details/1458399?ln=1",
    "company_name": "Shimantik Sylhet",
    "job_title": "প্যারামেডিক (মহিলা)",
    "location": "Bandarban, Brahmanbaria, Cox`s Bazar, Cumilla, Habiganj, Khagrachhari, Moulvibazar, Rangamati, Sunamganj, Sylhet",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "প্যারামেডিক (মহিলা) : Shimantik Sylhet Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Shimantik Sylhet প্যারামেডিক (মহিলা) Application Deadline : 28 Feb 2026 Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Bandarban, Brahmanbaria, ... Bandarban, Brahmanbaria, Cox`s Bazar, Cumilla, Habiganj, Khagrachhari, Moulvibazar, Rangamati, Sunamganj, Sylhet Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements আবেদনকারীকে অবশ্যই বাংলাদেশ নার্সিং কাউন্সিল / বাংলাদেশ রাষ্ট্রীয় চিকিৎসা অনুষদ সনদপ্রাপ্ত (বিএমএন্ডডিসি) কর্তৃক রেজিষ্ট্রেশন প্রাপ্ত হতে হবে। এছাড়াও এনজিওতে স্বাস্থ্য, পুষ্টি ও পরিবার পরিকল্পনা, পন্য বিপনন কার্যক্রম বাস্তবায়ন, স্যাটেলাইট ভিত্তিক মা সমাবেশ এবং অন্যান্য কর্মসূচী বাস্তবায়নে কাজের অভিজ্ঞতা সম্পন্ন প্রার্থীদের অগ্রাধিকার দেয়া হবে। অতিরিক্ত যোগ্যতাসম্পন্ন প্রার্থীদের ক্ষেত্রে শিক্ষাগত যোগ্যতা শিথিলযোগ্য। সংশ্লিষ্ট জেলার স্থানীয় প্রার্থীদের অগ্রাধিকার দেওয়া হবে। Responsibilities & Context জাতীয় পর্যায়ের উন্নয়ন সংস্থা সীমান্তিক সিলেট, সুনামগঞ্জ, মৌলভিবাজার, হবিগঞ্জ, ব্রাহ্মণবাড়িয়া, কক্সবাজার, রাঙ্গামাটি, খাগড়াছড়ি, বান্দরবান ও কুমিল্লা জেলার বিভিন্ন উপজেলায় নারী ও শিশু স্বাস্থ্যের মানোন্নয়নের লক্ষ্যে সোশ্যাল মার্কেটিং কোম্পানি (এসএমসি) এর অর্থায়নে দীর্ঘদিন যাবৎ কমিউনিটি মোবিলাইজেশন প্রোগ্রাম এর কার্যক্রম পরিচালনা করে আসছে। প্রোগ্রামটি বাস্তবায়নের লক্ষ্যে জরুরি ভিত্তিতে উল্লেখিত পদে জনবল নিয়োগের জন্য যোগ্য বাংলাদেশি নাগরিকদের নিকট থেকে দরখাস্ত আহ্বান করা যাচ্ছে। পদের দায়িত্ব ও কর্তব্য: নির্ধারিত কর্মএলাকায় লক্ষিত জনগোষ্ঠীর মধ্যে স্বাস্থ্য ও আচরণগত ইতিবাচক পরিবর্তন সৃষ্টি করা। গর্ভবতী মা ও শিশু এর স্বাস্থ্য, পুষ্টি এবং পরিবার পরিকল্পনা সামগ্রীর গুণগত মানসম্পন্ন চাহিদা সৃষ্টি ও সহজলভ্যতা নিশ্চিত করা। স্যাটেলাইট ভিত্তিক উঠান বৈঠক এর মাধ্যমে গর্ভবতী মায়েদের গর্ভকালীন স্বাস্থ্যসেবা প্রদান ও স্বাস্থ্য বিষয়ক সচেতনতামূলক বার্তা প্রদান করে চাহিদা সৃষ্টি ও সহজলভ্যতা নিশ্চিত করা। ৫ বছরের নিচে শিশুদের গ্রোথ মনিটরিং সেবা প্রদান বিভিন্ন স্বাস্থ্য বিষয়ক ক্যাম্পেইন পরিকল্পনা ও বাস্তবায়ন করা। ক্ষুদ্র উদ্যোক্তা তৈরি, তত্ত্বাবধান এবং নিয়মিত মনিটরিং করা। Compensation & Other Benefits T/A,Provident fund,Mobile bill Salary Review: Yearly Festival Bonus: 3 Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Bandarban, Brahmanbaria, Cox`s Bazar, Cumilla, Habiganj, Khagrachhari, Moulvibazar, Rangamati, Sunamganj, Sylhet Read Before Apply আগ্রহী প্রার্থীদেরকে একটি pdf ফাইলে, নির্বাহী পরিচালক, সীমান্তিক, বরাবরে সদ্য তোলা রঙিন ছবি ও মোবাইল নম্বর উল্লেখ সহ আবেদন পত্র ও পূর্ণাঙ্গ জীবন বৃত্তান্ত আগামী ২৮/০২/২০২৬ ইং তারিখের মধ্যে careers.shimantikcmp@gmail.com ইমেইলের প্রেরন করতে হবে। ইমেইলের বিষয়ে অবশ্যই পদের নাম ও পছন্দের জেলা উল্লেখ করতে হবে। Apply Procedure Email Your CV Send your CV to the given email careers.shimantikcmp@gmail.com Company Information Shimantik Sylhet Follow Address"
  },
  {
    "url": "https://bdjobs.com/h/details/1458326?ln=1",
    "company_name": "KEPZ Trust Hospital",
    "job_title": "Specialist / Consultant (Gynae & Obst.)",
    "location": "Chattogram",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "28 Feb 2026",
    "job_description": "Specialist / Consultant (Gynae & Obst.) : KEPZ Trust Hospital Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List KEPZ Trust Hospital Specialist / Consultant (Gynae & Obst.) Application Deadline : 28 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Chattogram Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Ambitious, Dedicated, Hard Working Development Experiences particularly on Medical. Must have valid registration with BMDC. Preferred: Experience in hospitals with over 250 beds. Willing to take challanges of work pressure. To perform additional duties to meet with the Company`s needs as required and assigned by management. Responsibilities & Context Examine, diagnose, and treat various conditions and diseases that affect women’s health, such as infections, hormonal disorders, cancers, etc Perform tests and procedures, such as pap smears, pelvic exams, ultrasounds, biopsies, etc Prescribe medications and treatments according to best practices and evidence-based guidelines. Provide prenatal care and monitor the health of pregnant women and their fetuses. Deliver babies using natural or surgical methods and provide postnatal care. Perform surgeries operations and procedures such as cesarean sections, Normal deliveries hysterectomies, tubal ligations, etc. Educate and advise women on family planning, contraception, fertility, menopause, and other topics related to women’s health. Educate and advise women on family planning, contraception, fertility, menopause, and other topics related to women’s health. Refer patients to other specialists or services when needed. Maintain accurate and confidential medical records and documentation. Keep up to date with the latest developments and research in the field of obstetrics and gynecology. Participate in clinical audits and quality improvement initiatives Teach and support junior clinical staff, maintain patient records, and uphold hospital policies. Skills & Expertise Suggested by Gynae and Obs. Obstetrics and Gynaecology Workplace Work at office Employment Status Full Time Job Location Chattogram Company Information KEPZ Trust Hospital Follow Address: KEPZ Trust Hospital, PS. Karnaphuli , Chattogram, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs."
  },
  {
    "url": "https://bdjobs.com/h/details/1458413?ln=1",
    "company_name": "Prosanti Shop",
    "job_title": "Videographer / Ads Video Creator",
    "location": "Dhaka (Khilgaon)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Videographer / Ads Video Creator : Prosanti Shop Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Prosanti Shop Videographer / Ads Video Creator Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka (Khilgaon) Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements যোগ্যতা: Videography-তে বাস্তব কাজের অভিজ্ঞতা Ads / Performance Content সম্পর্কে পরিষ্কার ধারণা সময়নিষ্ঠ, টিমওয়ার্কে দক্ষ এবং শেখার মানসিকতা আমাদের কী দরকার: Reels / Short-form Ads ভিডিও (১০–৬০ সেকেন্ড) বানানোর অভিজ্ঞতা Facebook & Instagram Ads ভিডিও বানানোর বাস্তব অভিজ্ঞতা Hook-based shooting বোঝা (প্রথম ৩–৫ সেকেন্ডে অ্যাটেনশন ধরে রাখা) Vertical (9:16) ফরম্যাটে কাজের অভ্যাস Camera ও Lighting-এর বেসিক জ্ঞান Product / Testimonial / UGC ভিডিও শুট করতে পারা Selling mindset — cinematic না, converting ভিডিও বানাতে জানতে হবে বেসিক এডিটিং জ্ঞান থাকতে হবে (অথবা Editor-কে সঠিকভাবে গাইড দিতে পারা) অবশ্যই পূর্বের Ads Video Portfolio থাকতে হবে Responsibilities & Context Hook, Retention আর Conversion—এই তিনটা যদি আপনি বোঝেন, তাহলে আপনি আমাদের টিমের জন্য পারফেক্ট ফিট। কাজের মূল দায়িত্ব: সোশ্যাল মিডিয়া ও মার্কেটিংয়ের জন্য ভিডিও শুট প্রোডাক্ট ফটোগ্রাফি Reels, Ads ও YouTube কন্টেন্টের জন্য বেসিক এডিটিং / এডিট গাইড Lighting, Framing ও Storytelling দিয়ে কনটেন্টকে প্রেজেন্টেবল করা Skills & Expertise Suggested by Advertisement Digital Marketing (Social Media Marketing) Video Editing Compensation & Other Benefits সেলারি: ২৫,০০০ - ৩০,০০০ টাকা (অভিজ্ঞতা অনুযায়ী) Workplace Work at office Employment Status Full Time Job Location Dhaka (Khilgaon) Read Before Apply আবেদন করবেন যেভাবে: আপনার CV + Ads Video Portfolio (লিংক) পাঠান Email: riazuli20@gmail.com Subject: Application for Videographer Apply Procedure Email Your CV Send your CV to the given email riazuli20@gmail.com or Email your CV from My Bdjobs account Company Information Prosanti Shop Follow Address: Patwari goli chowrasta, near friend kindergarten, 107/A,bashabo,dhaka. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning R"
  },
  {
    "url": "https://bdjobs.com/h/details/1458407?ln=1",
    "company_name": "Ascent Health Limited",
    "job_title": "Call Center Coordinator",
    "location": "Dhaka",
    "salary": "",
    "experience": "",
    "education": null,
    "deadline": "25 Feb 2026",
    "job_description": "Call Center Coordinator : Ascent Health Limited Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ascent Health Limited Call Center Coordinator Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 20 to 35 years Location: Dhaka Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 20 to 35 years Bachelor’s degree or equivalent work experience 1–3 years of experience in a call center environment Strong organizational and multitasking skills Good communication and interpersonal abilities Proficiency in call center software, CRM systems, and MS Excel Ability to work under pressure in a fast-paced environment Experience with workforce management (WFM) tools Basic knowledge of quality assurance and performance metrics Leadership or team coordination experience Responsibilities & Context Operations & Coordination Coordinate daily call center activities to ensure adequate staffing and smooth workflow Monitor call queues, call volumes, and agent availability Assign tasks and balance workloads among agents Escalate urgent customer issues to supervisors or managers when necessary Agent Support Provide real-time support to call center agents during shifts Assist new hires during onboarding and initial training periods Address basic agent concerns related to schedules, systems, or processes Scheduling & Attendance Prepare and maintain agent work schedules, breaks, and shift rotations Track attendance, tardiness, and leave records Ensure coverage during peak hours and unexpected absences Performance Monitoring & Reporting Track key performance indicators (KPIs) such as: Call volume Average handling time (AHT) First call resolution (FCR) Customer satisfaction (CSAT) Prepare daily, weekly, and monthly performance reports Identify trends and highlight performance gaps Quality & Compliance Ensure agents follow call scripts, policies, and compliance standards Support quality assurance initiatives and corrective action plans Assist in call audits and feedback sessions Skills & Expertise Call Center Good English communication skills (verbal and Written) Interpersonal Skill Multitasking Organizational Skills Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Ascent Health Limited Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 0189"
  },
  {
    "url": "https://bdjobs.com/h/details/1458426?ln=1",
    "company_name": "L.N Textile Ltd.",
    "job_title": "Senior Accountant",
    "location": "Narsingdi",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "21 Feb 2026",
    "job_description": "Senior Accountant : L.N Textile Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List L.N Textile Ltd. Senior Accountant Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 01 Age: 30 to 40 years Location: Narsingdi Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 30 to 40 years Strong Team building and leadership skills. Comprehensive knowledge of VAT/TAX regulations, AIT, TDS, and WHT compliance. Sound knowledge on computer literacy (MS Office, MS Excel, Accounting Software like Tally, ERP etc.)Excellent communication, coordination, and deadline management skills. Responsibilities & Context Prepare and finalize monthly, quarterly, and annual financial statements in compliance with applicable accounting standards. Record daily financial transactions payroll, expenses. Reconcile bank statements and accounts. Prepare and maintain accounting journals, ledgers and documentation for business transactions (disbursements, receipts, vouchers, accounts payable/receivable. Ensure compliance with accounting standards and regulations. Assist with budgeting, forecasting, and cost control. Monitor cash flow and financial performance. Support internal and statutory audits, prepare audit schedules, and resolve audit queries. Maintain fixed asset accounting, depreciation, and asset verification. Assist in financial planning, pricing decisions, and profitability analysis. Coordinate with external consultants, auditors, bankers, and regulatory bodies. Support month-end and year-end closing activities within timelines. Maintain accurate documentation and ensure data integrity in ERP/accounting systems. Use accounting software Tally. Provide financial information to management and stakeholders. Must have work experience as Accountant in Dyeing and Printing Factory. Compensation & Other Benefits Mobile bill Salary Review: Yearly Festival Bonus: 2 Weekly Holiday. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Narsingdi Company Information L.N Textile Ltd. Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Re"
  },
  {
    "url": "https://bdjobs.com/h/details/1458398?ln=1",
    "company_name": "building technology & ideas ltd.",
    "job_title": "Manager – Property Security Management (PSM) - Operations",
    "location": "Dhaka (Gulshan)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Manager – Property Security Management (PSM) - Operations : building technology & ideas ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List building technology & ideas ltd. Manager – Property Security Management (PSM) - Operations Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka (Gulshan) Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements ·         Defense Background preferred, especially Master Warrant Officer / Warrant Officer from Armed Forces. ·         Training on Safety & Security Management is preferred. ·         Capable to handle working pressure, candidate to be sincere, hardworking. ·         Willing to Travel to the various projects throughout the Dhaka City. ·         Sound physique. Responsibilities & Context Job Description ·         Accountable for all his work to the GM-PSM and will first report any incident/accident to the GM-PSM. ·         Managing the operations of the SBU (Property Security and Management) having about 500 Support Staffs (SSs) including Building Managers (BM), Security Officers, Supervisor, Caretakers (CTs), Security Guards (SGs) and Cleaners (CLs), Electricians, Plumbers, Lift Mans, Pool Technicians in bti projects both ongoing and handed over projects across Dhaka city. ·         Sourcing, screening and deployment of required numbers of experienced Building Managers, Caretakers, Security Guards, & Cleaners to meet up specific requirements. ·         Conducting training regularly and periodically to ensure professional development of Support Staffs. ·         Monitoring the daily activities of team members, supervising administrative works of Security Dept. ·         Performance management - set KPIs and evaluate performance to ensure goal accomplishment. ·         Maintaining Central Store/Record of Dress of SSs i.e., Store Maintenance, Dress Registers maintenance, ·         Monitoring & providing Monthly Central Training on Duties & Responsibilities the Support Staffs to increase awareness and professionalism. ·         Providing Technical Training on Fire Fighting, Fire Panel, Fire Hydrant, Lift and Generator/Substation operation. ·         Overseeing the SS salary preparation, distribution & procedure are maintained properly as per company policy. ·         Preparing monthly report of Resign, Run, Sleeping, Termination & Black list etc. & submitting those on regular basis & providing other on demand. ·         Ensuring of the project visit of Security Officers as per policy by reviewing the project visit sheet & preparing the monthly visit report and supervising the performance of Team members. ·         Taking feedback of customers & site personnel regarding service standar"
  },
  {
    "url": "https://bdjobs.com/h/details/1458357?ln=1",
    "company_name": "Golden Bricks",
    "job_title": "Front Desk Executive",
    "location": "Dhaka (Mirpur12)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Front Desk Executive : Golden Bricks Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Golden Bricks Front Desk Executive Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: 20 to 33 years Location: Dhaka (Mirpur12) Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 20 to 33 years ·        Well-groomed and presentable appearance ·        Polite, friendly, and professional behavior ·        Excellent communication & interpersonal skills ·        Hard-working, responsible, and punctual ·        Basic computer skills (appointments & client records) Responsibilities & Context Golden Bricks is seeking a female Front Desk Executive who is professional, presentable, and passionate about delivering an exceptional client experience. Responsibilities: ·    Welcome and assist clients warmly and professionally ·    Manage appointments, calls, and front desk operations ·     Maintain a calm, welcoming, and luxury environment ·      Coordinate with staff to ensure smooth  workflow Skills & Expertise Font Desk Compensation & Other Benefits asper company policy Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (Mirpur12) Company Information Golden Bricks Follow Address: House 19 ,Block B, Mirpur 12, Pallabi ,Dhaka -1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Feature"
  },
  {
    "url": "https://bdjobs.com/h/details/1458455?ln=1",
    "company_name": "HAZERA EDUCATION CONSULTENCY",
    "job_title": "Senior Student Counselor",
    "location": "Dhaka (Motijheel)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "19 Feb 2026",
    "job_description": "Senior Student Counselor : HAZERA EDUCATION CONSULTENCY Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List HAZERA EDUCATION CONSULTENCY Senior Student Counselor Application Deadline : 19 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 24 to 35 years Location: Dhaka (Motijheel) Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 24 to 35 years Looking for an experienced Senior Student Counselor for multi destinations Country, particularly for the (ESTONIA, LITHUANIA & MALTA). Must be proficient in the English language. Must be polite, patient, honest and loyal to the work. Responsibilities & Context Senior Student Counselor (ESTONIA, LITHUANIA, MALTA) Assist students with university selection, tuition fees, scholarships, and living costs. Looking for an experienced student Counselor for multi destinations, particularly for the (ESTONIA, LITHUANIA, MALTA) Information about appropriate institutions and English Proficiency Course, programs, tuition fees, scholarships and cost of living in different countries. Provide counseling to prospective students and their families face to face as well as through other media such as cell phone, WhatsApp, social media etc. To consult with the students and guardians about admission procedures of foreign universities & countries Skills & Expertise Education Consultant Education Counseling Education Counselor Higher Study Abroad Immegration and education consultancy Immigration Education Consultancy Service study abroad Suggested by Immigration Consultancy Student Counseling Student Visa Processing Compensation & Other Benefits Salary will be increased as per performance. Performance bonus Festival Bonus: 2 (Terms & Conditions apply) Workplace Work at office Employment Status Full Time Job Location Dhaka (Motijheel) Company Information HAZERA EDUCATION CONSULTENCY Follow Address: Shatabdi Center 17N (17th Floor) 292, Inner Circular Road, Fakirapool, Motijheel, Dhaka, Bangladesh. Website: http://www.hazerabd.com/ Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ই"
  },
  {
    "url": "https://bdjobs.com/h/details/1458403?ln=1",
    "company_name": "RSPL HEALTH BANGLADESH",
    "job_title": "Assistant Manager/Deputy Manager- Sales Administration",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Assistant Manager/Deputy Manager- Sales Administration : RSPL HEALTH BANGLADESH Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List RSPL HEALTH BANGLADESH Assistant Manager/Deputy Manager- Sales Administration Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 25 to 38 years Location: Dhaka Salary: Negotiable Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 38 years Responsibilities & Context Scheme Management Design scheme & Promotional QPS with Trade marketing manager and sales head , Ensure Scheme accuracy , Timelines and Eligibility logic. Co-ordinate with sales , Finance and marketing for approval etc. DMS Operation Upload and activate approved scheme in the DMS Accurately Test Scheme functionality before rollout Resolve DMS / SFA related scheme discrepancies and errors. Distributor Master Management Ensure Correctness of 1. DB level Limit exposure 2. Pricing and Scheme mapping Distributor accounting and Reporting Reconcile (a) Claims (b) Credit notes (c) outstanding balance. Skills & Expertise Distribution Mangaement Good in advance execel Microsoft PowerPoint SAP Compensation & Other Benefits Over time allowance,Weekly 2 holidays,Mobile bill,Gratuity,Insurance Salary Review: Yearly Festival Bonus: 2 Earn Leave Long Service Award Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information RSPL HEALTH BANGLADESH Follow Address: House No. 38, Road 4, Nikunja-1, Khilkhet, Dhaka-1229 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy "
  },
  {
    "url": "https://bdjobs.com/h/details/1458354?ln=1",
    "company_name": "Decor Interior Ltd.",
    "job_title": "Business Development Manager (Solar & Renewable Energy)",
    "location": "Anywhere in Bangladesh",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Business Development Manager (Solar & Renewable Energy) : Decor Interior Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Decor Interior Ltd. Business Development Manager (Solar & Renewable Energy) Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: 1 Age: 28 to 35 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 28 to 35 years Must be highly active and field-oriented Willing to travel and meet clients as required Strong professional attitude and commitment to work Responsibilities & Context Decor Energy Solutions Ltd., one of the leading renewable energy companies in Bangladesh, is looking for a highly active, motivated, and experienced Business Development Manager with strong knowledge of solar-related products and projects . The ideal candidate must be energetic, client-focused, and capable of working under pressure to meet business targets and serve clients efficiently. Identify, develop, and manage new business opportunities in the solar and renewable energy sector Maintain strong relationships with existing and potential clients Conduct client meetings, site visits, and technical discussions when required Prepare business proposals, quotations, and B2B communications Coordinate with technical, engineering, and marketing teams Achieve sales targets and support company growth Handle negotiations and close deals professionally Work actively in all situations to meet client requirements Skills & Expertise Suggested by Consumer Durables - Sales & Marketing Sales & Marketing Sales target Customer Service Salesman Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Anywhere in Bangladesh Company Information Decor Interior Ltd. Follow Address: House#09, Road#105, Gulshan-2, Dhaka-1212 Website: https://www.decor-bd.com/ Business: IT Services Provider, Software Company, GPRS programmable meter control using software, Construction Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশ"
  },
  {
    "url": "https://bdjobs.com/h/details/1458301?ln=1",
    "company_name": "Allied Venture's",
    "job_title": "Poultry Farmer",
    "location": "Bogura (Bogura Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Poultry Farmer : Allied Venture's Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Allied Venture's Poultry Farmer Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Location: Bogura (Bogura Sadar) Salary: Tk. 10500 - 12000 (Monthly) Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Responsibilities & Context মুরগির স্বাস্থ্য তদারকি করা। সঠিক সময়ে ভ্যাকসিন ও ঔষধ নিশ্চিত করা। বায়োসিকিউরিটি বা খামারের নিরাপত্তা বজায় রাখা। খামারে পরিবার নিয়ে যারা থাকবেন তাদের অধিকার দেওয়া হবে। Skills & Expertise Poultry Farm Management Poultry Sector Suggested by Poultry Farm Management Poultry Sector poultry disease Compensation & Other Benefits খামারে পরিবার নিয়ে থাকা সুব্যবস্থা রয়েছে। Employment Status Full Time Job Location Bogura (Bogura Sadar) Apply Procedure Walk in Interview বিস্তারিত যোগাযোগ করুন:01601-000515 বিস্তারিত যোগাযোগ করুন:01601-000515 Company Information Allied Venture's Follow More jobs from this company Address: Namajgor vandari mosjid songlogno, bogura sadar Bogura 5800. Website: https://kafi28.wordpress.com/ Business: ???? ?????? ????????????? ???????? ???? ???????? ????? ? ????????? ???????? ? ?????? ?????? ????, ???? ??? ??? ?????? ?????????? ??????? ?????????? ?????? ???? ??????? ?????? ? ?????? ??? ????? ?????????????? ??????, ???????? ????? ? ????? ?????????? ??????? ???? ???????? ??? ??????? ???? Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Vide"
  },
  {
    "url": "https://bdjobs.com/h/details/1458459?ln=1",
    "company_name": "A Reputed Group of Companies",
    "job_title": "EDI Officer, (Knit Garments for Head Office)",
    "location": "Candidates Must have Experience in working with GAP Buyer.",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "EDI Officer, (Knit Garments for Head Office) : A Reputed Group of Companies Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List A Reputed Group of Companies EDI Officer, (Knit Garments for Head Office) Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Location: Dhaka (Gulshan) Salary: Tk. 24000 - 25000 (Monthly) Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Responsibilities & Context Job Location: Jamgora, Ashulia. Candidates Must have Experience in working with GAP Buyer. Should have Strong Knowledge in MS Office such as Word, Excel, and Power Point & Access. Experience in EDI (Electronic Data Interchange) will be given preference. Receiving PO/ DCPO from E-2 Open System. Uploading the packing list to the buyers through the EDI portal. Downloading the Packing list from online portal. Printing the Packing list and carton sticker for shipment. Updating the Packing list in pandora system and sending it to Commercial Dept. Any other responsibilities assign by the management. Skills & Expertise Microsoft Excel Compensation & Other Benefits Mobile bill,Insurance Festival Bonus: 2 As per Company Policy. Workplace Work at office Employment Status Full Time Job Location Dhaka (Gulshan) Company Information A Reputed Group of Companies Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job"
  },
  {
    "url": "https://bdjobs.com/h/details/1458462?ln=1",
    "company_name": "Walkon Footwear",
    "job_title": "Content & Marketing Executive",
    "location": "Dhaka (Shantinagar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "13 Feb 2026",
    "job_description": "Content & Marketing Executive : Walkon Footwear Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Walkon Footwear Content & Marketing Executive Application Deadline : 13 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Age: 18 to 40 years Location: Dhaka (Shantinagar) Salary: Tk. 13000 - 13000 (Monthly) Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 40 years Creativity, storytelling ability, and understanding of digital marketing trends. Ability to work independently and deliver results within deadlines. Proven experience in video recording & editing (using DSLR/phone camera and editing software). Strong skills in editing software such as Adobe Premiere Pro, Final Cut Pro, CapCut, Filmora, or similar tools. Knowledge of social media video formats, transitions, subtitles, and motion graphics. Ability to shoot professional-quality videos with proper lighting, framing, and audio. Basic graphic design skills will be an added advantage. Experience in social media video content creation & marketing Basic understanding of overseas jobs / visa / recruitment industry (preferred) Confident in front of camera (Bangla speaking mandatory, English a plus) Skills in video shooting & editing (mobile or camera-based) Creative mindset with result-oriented attitude Responsibilities & Context HireAxies is a growing overseas recruitment & visa consultancy company based in Bangladesh, working with Europe, Middle East & Asia markets. Team Size: 10+ Position: Visa Consultant – Content Creator & Social Media Video Marketer HireAxies is looking for a creative, energetic, and result-driven professional who can combine visa consultancy knowledge with social media video marketing . This role is focused on creating powerful short-form video content to attract candidates, promote overseas job opportunities, and directly build candidate pipelines for our recruitment & visa services. Key Responsibilities Create engaging short-form video content (Reels, TikTok, YouTube Shorts, Facebook, LinkedIn) for overseas job & visa promotion Present job circulars, visa updates, candidate stories, and HireAxies services through video Plan, script, shoot, and edit videos with clear call-to-action for candidate applications Coordinate with Recruitment & HR team to understand manpower requirements Actively promote overseas jobs, work permits, and visa consultancy services Manage HireAxies’ social media platforms with regular posting and engagement Research video trends to attract quality candidates Track campaign performance (views, leads, applications) and optimize content Maintain HireAxies brand image with professional, clear, and attractive videos Skills & Expertise Beauty influencer Content C"
  },
  {
    "url": "https://bdjobs.com/h/details/1458368?ln=1",
    "company_name": "Marsh Services & Outsourcing",
    "job_title": "Relationship  Executive",
    "location": "Dhaka, Dhaka (Dilkhusha)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Mar 2026",
    "job_description": "Relationship  Executive : Marsh Services & Outsourcing Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Marsh Services & Outsourcing Relationship  Executive Application Deadline : 11 Mar 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 100 Age: 18 to 32 years Location: Dhaka, Dhaka (Dilkhusha) Salary: Tk. 18000 - 24000 (Monthly) Published: 09 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 32 years Result driven and able to work independently to achieve sales target Pleasant and presentable personality Good communication and interpersonal skills Energetic, confident, creative, resourceful and target oriented Physical fitness and willingness to work at field level Geographic mobility and flexibility Responsibilities & Context Position : Relationship  Executive. For a Private Commercial Bank - Conducted by MARSH Ability to achieve individual monthly Business Target of Core Product: Liability/ Personal Loan/ Auto Loan/ Home Loan Responsible for implementing sales and marketing activities in order to grow business and achievement of sales targets; Ensure business targets are met by developing new relationships and leveraging existing ones within the customer base; Responsible for acquiring new customers through multiple channels – campaigns, walk-ins, referrals from existing customers; Analysis of financial status to evaluate the credit worthiness of the client; Collect and complete applications with all required documents on daily basis from potential clients; Coordinate with Team Leader/ Line Manager in preparing daily, weekly and monthly reports; Promote specific products as directed by Line Management; Any other Business Development activities assigned by the Management. Skills & Expertise Auto Loan Deposit Sales Home Loan Loan Sales Personal Loan Sales Sales & Marketing Sales target Customer Service Suggested by Client Service/ Marketing Customer Relationship Management Relationship Marketing Compensation & Other Benefits Weekly 2 holidays Festival Bonus: 2 Minimum Gross Salary of BDT 18,000 (Higher for experienced candidates up to BDT 24,000) Sales Incentive Plan based on performance Career progression opportunity for good performers (i.e. job up gradation & absorption as full time permanent employee of the bank) Other admissible benefits as per company policy Workplace Work at office Employment Status Contractual Job Location Dhaka, Dhaka (Dilkhusha) Company Information Marsh Services & Outsourcing Follow Address: Sheltech Barnali (1st floor, 2A), House 30, Road 20, Block K, Banani, Dhaka 1213 Website: https://marshgroupbd.com Business: MARSH Services & Outsourcing is a talent and business solutions provider specializing in recruitment, managed services, payroll management, IT services and managed staffing. We"
  },
  {
    "url": "https://bdjobs.com/h/details/1458311?ln=1",
    "company_name": "Da Birulia.",
    "job_title": "Assistant Chef",
    "location": "Dhaka (Savar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "Assistant Chef : Da Birulia. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Da Birulia. Assistant Chef Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: At least 22 years Location: Dhaka (Savar) Salary: Tk. 12000 - 18000 (Monthly) Published: 09 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age At least 22 years 1–2 years experience in a restaurant or hotel kitchen preferred Basic knowledge of Bangla & continental food (preferred) Willing to learn and follow instructions Physically fit, disciplined, and punctual Team player with a positive attitude Local candidates from Savar/Birulia area will get preference Responsibilities & Context Da Birulia is looking for a skilled and motivated Assistant Chef to support daily kitchen operations, maintain food quality, and assist the Head Chef in preparation and service. This role is ideal for someone with basic kitchen experience who wants to grow in a professional restaurant environment. Key Responsibilities: * Assist Head Chef in daily food preparation and cooking * Prepare ingredients and basic menu items as instructed * Maintain kitchen cleanliness, hygiene, and food safety standards * Assist in food plating and presentation * Support inventory handling and stock arrangement * Follow kitchen SOPs and work efficiently during busy hours Skills & Expertise Continental Cooking Compensation & Other Benefits Salary:based on experience Free accommodation & food provided Festival bonus as per company policy Performance bonus based on work efficiency and behavior Career growth opportunity Yearly salary review. Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Savar) Company Information Da Birulia. Follow Address: House 996 Road 9/A, Avenue 11 Mirpur DOHS Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Regist"
  }
]