[
  {
    "url": "https://bdjobs.com/h/details/1458885?ln=1",
    "company_name": "Maisha Care Ltd",
    "job_title": "Digital Marketing / SEO Expert",
    "location": "Dhaka (Nadda)",
    "salary": null,
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "21 Feb 2026",
    "job_description": "Digital Marketing / SEO Expert : Maisha Care Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Maisha Care Ltd Digital Marketing / SEO Expert Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: At least 18 years Location: Dhaka (Nadda) Salary: Negotiable Experience: 1 to 2 years Published: 11 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education HSC Bachelor/Honors Diploma Experience 1 to 2 years The applicants should have experience in the following business area(s): Healthcare Startup, Healthcare/Lifestyle product Additional Requirements Age At least 18 years Responsibilities & Context 🔹 Position 1: Digital Marketer (Video Editing, Video Production, Social Media Management & Ads Management) Job Overview We are looking for a creative and performance-driven Digital Marketer who can strengthen our brand’s online presence. The ideal candidate must have hands-on experience in video production, social media management, and paid advertising campaign management. Key Responsibilities Plan, shoot, and edit professional video content (Reels, Shorts, Promotional Videos) Manage and grow social media platforms (Facebook, Instagram, YouTube, TikTok) Create content strategies and maintain a content calendar Set up, manage, and optimize Facebook (Meta) Ads and Google Ads campaigns Generate leads and improve brand engagement Monitor campaign performance and prepare monthly reports Analyze marketing data and optimize strategies accordingly ✅ Requirements Strong proficiency in video editing tools (Adobe Premiere Pro / CapCut / DaVinci Resolve / similar) Solid understanding of social media algorithms and trends Practical experience with Meta Ads Manager and Google Ads Creative mindset with strategic marketing thinking Portfolio of previous work is required Minimum 1–2 years of relevant experience preferred 🔹 Position 2: SEO Expert (On-Page, Off-Page & Technical SEO Specialist) Job Overview We are seeking an experienced SEO Expert to improve organic traffic, search engine rankings, and overall website performance through advanced SEO strategies. Key Responsibilities On-Page SEO : Keyword research and search intent analysis Content optimization and SEO-friendly content structuring Meta tag optimization (Title, Description) Internal linking strategy implementation Off-Page SEO (Priority Focus): High-quality backlink acquisition Guest posting and outreach campaigns Link-building strategy development Technical SEO (Priority Focus): Website audit and technical issue resolution Core Web Vitals optimization Schema markup implementation XML sitemap & Robots.txt management Indexing and crawl issue fixes Conduct competitor analysis and SEO strategy planning Use tools such as Google Search Console, Google Analytics, Ahrefs, SEMrush, Screaming Frog Prepare m"
  },
  {
    "url": "https://bdjobs.com/h/details/1458899?ln=1",
    "company_name": "Advanced Chemical Industries PLC (ACI)",
    "job_title": "Senior/Executive, Corporate Sales (Consumer Brands)",
    "location": "Dhaka",
    "salary": "Negotiable",
    "experience": "At least 1 year",
    "education": null,
    "deadline": "23 Feb 2026",
    "job_description": "Senior/Executive, Corporate Sales (Consumer Brands) : Advanced Chemical Industries PLC (ACI) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Advanced Chemical Industries PLC (ACI) Senior/Executive, Corporate Sales (Consumer Brands) Application Deadline : 23 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Location: Dhaka Salary: Negotiable Experience: At least 1 year Published: 11 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience At least 1 year The applicants should have experience in the following business area(s): Manufacturing (FMCG), Food (Packaged)/Beverage, Toiletries, Real Estate Responsibilities & Context Identify and pursue corporate business opportunities by analyzing industry trends. Build and maintain strong client relationships through regular visits and solution-oriented support. Prepare and review sales reports, forecasts, and performance metrics. Monitor competitors and market trends to suggest product improvements and new opportunities. Ensure partner satisfaction and implement customer management practices to maximize retention. Support management with strategic insights, proposals, and ad-hoc business projects. Skills & Expertise B2B Sales Customer Relationship Management Product Market Analysis Sales Reporting Leadership and Good Communication skill. Workplace Work at office Employment Status Full Time Job Location Dhaka Job Highlights Develop new corporate business Maintain strong client relationships Monitor the market and competitors Prepare sales reports and forecasts Support strategic business growth Collaborate with management on key initiatives Company Information Advanced Chemical Industries PLC (ACI) Follow More jobs from this company Address: ACI Centre, 245 Tejgaon Industrial Area, Dhaka-1208. Business: Pharmaceuticals; Agribusiness; Consumer Brands. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yello"
  },
  {
    "url": "https://bdjobs.com/h/details/1453028?ln=1",
    "company_name": "Gadgetz.com.bd",
    "job_title": "Digital Marketing & Social Media Executive, Customer Service",
    "location": "Dhaka (Banasree, GULSHAN 1)",
    "salary": "Tk. 14000 - 22000 (Monthly)",
    "experience": "At least 1 year",
    "education": null,
    "deadline": "22 Feb 2026",
    "job_description": "Digital Marketing & Social Media Executive, Customer Service : Gadgetz.com.bd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Gadgetz.com.bd Digital Marketing & Social Media Executive, Customer Service Application Deadline : 22 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 4 Age: 22 to 32 years Location: Dhaka (Banasree, GULSHAN ... Dhaka (Banasree, GULSHAN 1) Salary: Tk. 14000 - 22000 (Monthly) Experience: At least 1 year Published: 23 Jan 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Higher Secondary Experience At least 1 year The applicants should have experience in the following business area(s): Electronic Equipment/Home Appliances, Mobile Accessories Freshers are also encouraged to apply. Additional Requirements Age 22 to 32 years ইংরেজি ভাষায় মৌলিক পড়া ও লেখার দক্ষতা Professional ও customer-oriented attitude Social media platforms সম্পর্কে সুস্পষ্ট ধারণা Content creation ও reels/video concept সম্পর্কে বাস্তব অভিজ্ঞতা Basic video editing skill (CapCut, Premiere Pro, InShot বা similar tool) Facebook Ads Manager, Pixel ও Server-Side Tracking সম্পর্কে জ্ঞান Google Ads ও conversion tracking সম্পর্কে ধারণা Canva বা অন্যান্য basic design tool ব্যবহারে অভিজ্ঞতা Responsibilities & Context মূল দায়িত্বসমূহ: ফোন কল, WhatsApp, Facebook Messenger ও Email এর মাধ্যমে গ্রাহক সেবা প্রদান করা গ্রাহকের প্রশ্ন, অভিযোগ ও ফিডব্যাক পেশাদারভাবে সমাধান করা কোম্পানির Social Media Platforms (Facebook, Instagram, TikTok ইত্যাদি) পরিচালনা ও তদারকি করা Social media inbox ও comment timely এবং professional manner-এ respond করা Social media content plan অনুযায়ী নিয়মিত post, caption ও content idea প্রস্তুত করা Reels ও short-form video content এর পরিকল্পনা, shooting coordination ও basic video editing করা Promotional content, reels ও marketing videos তৈরি ও প্রকাশ করা । নিচের ভিডিও গুলো থেকে আইডিয়া নিতে পারবেন । https://www.facebook.com/reel/1322054996248092 https://www.facebook.com/reel/1293684505493226 https://www.facebook.com/reel/700581942997371 https://www.facebook.com/reel/1506137540379986 https://www.facebook.com/reel/1079574734241523 https://www.facebook.com/reel/1094087442306576 Facebook ও Instagram বিজ্ঞাপন (Ads Campaign) পরিকল্পনা, পরিচালনা ও পর্যবেক্ষণ করা Facebook Pixel ও Server-Side Tracking (Conversion API) setup ও monitoring করা Google Ads campaign পরিচালনা ও conversion tracking নিশ্চিত করা Digital marketing campaign এর performance analysis ও report প্রস্তুত করা Social media ও digital campaign থেকে lead সংগ্রহ করে সংশ্লিষ্ট sales/support টিমে হস্তান্তর করা Daily basis-এ customer support ও marketing activity report সংরক্ষণ করা Skills & Expertise Customer Support through Phone Digital Marketing (Social Media Marketing) Facebook Ads Manager Professional Video Editing SEO and Google ads Video content creating video presentation Suggested by "
  },
  {
    "url": "https://bdjobs.com/h/details/1456944?ln=1",
    "company_name": "Nextzen Limited (Bangladesh)",
    "job_title": "Business Development Executive (Corporate Sales)",
    "location": "Dhaka (60 Feet, Agargaon, Mirpur, Mirpur 1, Mirpur 10, Mirpur 2, Mirpur 6, Mirpur 7)",
    "salary": null,
    "experience": "At most 1 year",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Business Development Executive (Corporate Sales) : Nextzen Limited (Bangladesh) Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Nextzen Limited (Bangladesh) Business Development Executive (Corporate Sales) Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Age: 22 to 30 years Location: Dhaka (60 Feet, Agargaon,... Dhaka (60 Feet, Agargaon, Mirpur, Mirpur 1, Mirpur 10, Mirpur 2, Mirpur 6, Mirpur 7) Salary: Tk. 10000 - 15000 (Monthly) Experience: At most 1 year Published: 05 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Experience At most 1 year The applicants should have experience in the following business area(s): Software Company, IT Enabled Service, Business-to-Business (B2B) Software and Services Startup Freshers are also encouraged to apply. Additional Requirements Age 22 to 30 years Strong communication, negotiation, and interpersonal skills. Ability to work under pressure and meet deadlines. Self-motivated, result-oriented, and proactive mindset. Good knowledge of corporate sales strategies and client relationship management. Proficiency in MS Office applications (Word, Excel, PowerPoint) and CRM software will be an advantage. Basic computer operating skills including email communication, online reporting, and presentation preparation. Must have the capability and willingness to travel outside Dhaka as required for corporate client visits. Willingness to travel anywhere within Bangladesh and internationally if required for business development purposes. Ability to travel via bus, train, or air as per business requirements. Strong presentation and corporate meeting handling capability. Smart, well-groomed, and professional personality preferred. Ability to work independently as well as in a team environment. Responsibilities & Context Nextzen Limited is looking for a dynamic and target-driven Business Development Executive (Corporate Sales) to expand corporate client relationships, generate new business opportunities, and strengthen market presence. The candidate will play a key role in identifying potential corporate clients, maintaining long-term relationships, and promoting the company’s products and services. Responsibilities: Identify and develop new corporate business opportunities to achieve sales targets. Build and maintain strong relationships with corporate clients and key decision-makers. Conduct market research to identify new sales opportunities and customer needs. Prepare and deliver professional presentations, proposals, and product demonstrations to corporate clients. Negotiate contracts, pricing, and agreements with clients to ensure mutual satisfaction. Coordinate with internal teams to ensure smooth service delivery and customer satisfaction. Maintain proper"
  },
  {
    "url": "https://bdjobs.com/h/details/1450071?ln=1",
    "company_name": "Mutual Trust Bank PLC",
    "job_title": "Relationship Officer - Relationship Manager (Retails Sales- Liability)",
    "location": "Dhaka",
    "salary": "",
    "experience": "At least 2 years",
    "education": null,
    "deadline": "13 Feb 2026",
    "job_description": "Relationship Officer - Relationship Manager (Retails Sales- Liability) : Mutual Trust Bank PLC Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Mutual Trust Bank PLC Relationship Officer - Relationship Manager (Retails Sales- Liability) Application Deadline : 13 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Dhaka Experience: At least 2 years Published: 15 Jan 2026 To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Candidate must be from UGC approved university. No 3rd division is allowed. Experience At least 2 years The applicants should have experience in the following business area(s): Banks Additional Requirements Good communication, interpersonal and organization skills. Effective presentation skills. Excellent negotiation skills. Able to timely manage multiple tasks. Proficiency at both spoken and written English and Bangla. Proficient in Microsoft Office. Strong analytical ability and organizational skills Responsibilities & Context New customer acquisition and generate deposit growth from potential Retail, SME and Corporate deposit customers. Maintain and improve TD & CASA deposit ratio. Cross-sell company products with focus on Bancassurance to increase revenue. Conduct due diligence on clients` identities and funding sources when establishing relationships. Retain existing liability customers by providing quality service. Report weekly/monthly business performance to the line manager. Submitting daily sales call report to the supervisor. Uphold discipline, ethical standards, and compliance in all transactions. Ensure to deliver consistently high level of customer service and effectively deal with the customer service in order to maintain high degree of customer satisfaction. Skills & Expertise Suggested by Customer Acquisition Reporting Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information Mutual Trust Bank PLC Follow More jobs from this company Address: MTB Centre, 26 Gulshan Avenue, Plot 5, Block SE (D), Gulshan 1, Dhaka 1212 Business: Private Commercial Bank Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Cours"
  }
]