[
  {
    "url": "https://www.linkedin.com/jobs/view/4240504347/",
    "job_id": "4240504347",
    "source": "linkedin",
    "company_name": "Somewhere",
    "job_title": "Full Stack Web Developer",
    "location": "South Asia",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Position : Full Stack Web Developer Work Hours : Monday to Friday - 7:30 am to 4:30 pm PST Salary Range : $2,000-$2,500 per month (depending on expertise)"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4047112668/",
    "job_id": "4047112668",
    "source": "linkedin",
    "company_name": "Braintrust",
    "job_title": "Coders - AI Training [Remote]",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Requirements. Swift, Python, Java, Go, Verilog, Javascript, C++, or C# coding experience required. This is a great opportunity to supplement your income"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4206222145/",
    "job_id": "4206222145",
    "source": "linkedin",
    "company_name": "Rotate Digital",
    "job_title": "Junior Website Developer",
    "location": "South Asia",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "At Rotate Digital, a Website Developer will be responsible for designing, building, and optimizing websites to maximize their visibility and ranking on search"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4202541542/",
    "job_id": "4202541542",
    "source": "linkedin",
    "company_name": "atB Jobs Bangladesh",
    "job_title": "Senior Backend Engineer (Java)",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Position: Sr. Backend Engineer (Java) Vacancies: 30 Location: Banani, Dhaka Employment Status: Full-Time Minimum Salary: Negotiable Experience: At least 3 years About Adventure Dhaka Limited Adventure Dhaka Limited, a subsidiary of Adventure Inc. (one of the leading publicly listed OTAs in Japan), is looking for a technically sound Tech Lead/Senior Backend Engineer based in Dhaka, Bangladesh. This role involves developing projects related to the company’s web services. The official language of Adventure Dhaka Limited is English . Responsibilities & Context Develop back-end programming and logic in Java . Understand and work within the Software Development Life Cycle (SDLC) . Perform Requirement Analysis, System Design (HLD/LLD), Coding, Unit Testing, Integration Testing, Bug Fixing, and Issue Resolution . Review source code and system design (HLD/LLD) . Properly and strictly manage tasks and schedules (milestones) . Ensure responsibility for QCD (Quality, Cost, and Delivery) . Guarantee that systems function properly and contribute to smooth business operations. Requirements Education: Bachelor of Science (BSc) in Computer Science & Engineering. Master of Science (MSc) in Computer Science & Engineering. Experience: At least 3 years of backend development experience in Java. Senior Level Applicants: Minimum 4+ years of backend development experience. Tech Lead Applicants: Minimum 5+ years of backend development experience and capability to lead 2-4 members . Additional Requirements: Age at least 24 years . Strong knowledge of Java Spring Boot, Java Spring Framework . Ability to build and maintain positive relationships with colleagues. Knowledge of travel, tourism, and software development . Hardworking, passionate, punctual, and excellent time management . Strong analytical and advanced arithmetic skills . A quality-minded approach throughout the SDLC . Ability to work systematically and in a structured manner . Commitment to meeting deadlines and maintaining quality standards . Skills & Expertise Java Java Spring Boot Java Spring Framework Java SpringBoot SPRING boot Spring Framework Compensation & Benefits Weekly 2 holidays . Full subsidized lunch facilities. Insurance and gratuity . Yearly salary review . Two festival bonuses . Free lunch, tea, coffee, and snacks for refreshment. A contemporary office environment in an excellent building and accessible location. Company trip and opportunities to work in Japan . 📍 Workplace: Work at the office (Banani, Dhaka) Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering Industries Information Services, IT Services and IT Consulting, and IT System Testing and Evaluation"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3086032568/",
    "job_id": "3086032568",
    "source": "linkedin",
    "company_name": "GoZayaan",
    "job_title": "Sr. Software Engineer, Backend",
    "location": "Gulshan, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from GoZayaan Fatema Samia Fatema Samia Business Affairs | GoZayaan Looking for a thriving culture and a workplace to take your career to the next level? GoZayaan is looking for an awesome Sr. Software Engineer (Backend) like you to join its ever-increasing talent pool. To be a part of the super talented tech team, we got the following works for you: - Be the technical expert in the team, and guide the team on best practices - Design and implementation of low-latency and performant applications - Writing reusable, scalable and efficient code. Write test case for the system using test automation tools - Ensuring quality with the review, user acceptance tests and automated tests - Coordinating with front-end developers - Reprogramming existing databases to improve functionality - Developing and managing scalable, fault-tolerant, highly available AWS- based services Additional skill sets that will get you shortlisted: - Proven work experience as a python expert - Minimum 4/5 years of experience in python and relevant fields - Experience in Cloud services i.e. AWS, GCP etc. along with dockerization - Expertise in SQL/NoSQL & Integration of data storage solutions. Able to integrate multiple data sources and databases into one system - Knowledge of user authentication and authorization between multiple systems, servers, and environments - Understanding of security compliance and data access - A deep understanding and multi-process architecture and the threading limitations of Python - Knowledge on 3rd party APIs like Flight APIs, Hotel APIs is a plus - Proficiency with a deep learning framework such as TensorFlow - Experience with Test Driven Development using tools e.g. Jest, Rspec, PyTest, and Unittest is a plus - Familiarity with event-driven programming in python - Proficient understanding of code versioning tools such as Git, Mercurial - Excellent communication skills in English -Payscale: 120,000-150,000 BDT If this job role and benefits get you excited, send your resume to talent@gozayaan.com with the subject 'Sr. Software Engineer, Backend'. Looking forward to having a discussion with you. Good luck! Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Travel Arrangements"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3292545686/",
    "job_id": "3292545686",
    "source": "linkedin",
    "company_name": "Bongo",
    "job_title": "Principal Mobile Engineer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Principal Mobile Engineer · Seniority level. Not Applicable · Employment type. Full-time · Job function. Engineering and Information Technology · Industries. Online"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4143170689/",
    "job_id": "4143170689",
    "source": "linkedin",
    "company_name": "ZAAG SYSTEMS",
    "job_title": "Flutter Developer",
    "location": "Dhaka ...",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Seniority level. Entry level · Employment type. Full-time · Job function. Engineering and Information Technology · Industries. IT Services and IT Consulting."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3083636936/",
    "job_id": "3083636936",
    "source": "linkedin",
    "company_name": "Hogarth Dhaka",
    "job_title": "Frontend Developer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Hogarth Dhaka Habiba Akther Habiba Akther Connected tech talents with a global platform | Tech Recruiter| Ex-WPP Network At Wunderman Thompson, we exist to inspire growth for ambitious brands. Part creative agency, part consultancy, and part technology company, our experts provide end-to-end capabilities at a global scale to deliver inspiration across the entire brand and customer experience. What you’ll do: Experience in graphic rendering using the HTML5 : Comprehensive knowledge of tags, HTML API (Geo, Storage, More APIs), Basic META Tags, CANVAS Extensive knowledge on CSS3: Selectors & Hierarchy, Layouts, Responsive Designs, Build Tools, LESS, SASS, Knowledge of Flexbox, CSS Object Model Develop and maintain responsive web applications, website pages and CMS systems for our clients. Experience in using Object-Oriented programming principles that apply to JavaScript: DOM Selectors, Event Handlers, Jquery - Functions, Callbacks, Promises, Debugging tools & approach Understanding of JavaScript design patterns, including the Model-View-Controller and Observer patterns Experience in React JS is mandatory Good to have experience React Native & Expo, Formik , Redux, Saga , Story Book Diagnose and solve technical problems related to Web applications and Website pages. Operate in an iterative/Agile methodology as needed or requested. Provide accurate estimates for work to be completed. Evaluate system specifications against business requirements. Produce quality code that is readable and maintainable by the team. Plan and execute testing across multiple platforms and solutions. What you’ll need: 3+ years’ industry experience. Analytic and positive mindset with a personable and professional approach. Sharp attention to detail and a passion for new technology. Professional written and verbal communication. We are 20,000 strong in 90 markets around the world, where our people bring together creative storytelling, diverse perspectives, inclusive thinking, and highly specialized vertical capabilities, to drive growth for our clients. We offer deep expertise across the entire customer journey, including communications, commerce, consultancy, CRM, CX, data, production, and technology. Wunderman Thompson is a WPP agency (NYSE: WPP). For more information, please visit us at www.wundermanthompson.com and follow Wunderman Thompson on our social channels via Twitter, Facebook, LinkedIn, and Instagram. Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Advertising Services and IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2406633813/",
    "job_id": "2406633813",
    "source": "linkedin",
    "company_name": "brainekt",
    "job_title": "Full-Stack Developer (MERN Stack)",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "We are looking for a Full Stack Developer to produce scalable software solutions. You’ll be part of a cross-functional team that’s responsible for the full software development life cycle, from conception to deployment. As a Full Stack Developer, you should be comfortable around both front-end and back-end coding languages, development frameworks, and third-party libraries. You should also be a self-motivated team player with a knack for visual design and utility. You should be somewhat familiar with agile methodologies. If you have participated in coding contests, ACM competitions, online competitive programming contests mention it in the resume/cover letter. Location : Fully remote How to apply? Send your resume to zabir@brainekt.com with your details (Github profile, StackOverflow profile, coding sample of your projects, portfolio, etc.) with your expected salary . Responsibilities Design client-side and server-side architecture Build the front-end of applications through appealing visual design Develop and manage well-functioning databases and applications Write effective APIs Test software to ensure responsiveness and efficiency Troubleshoot, debug and upgrade software Create security and data protection settings Build features and applications with a mobile responsive design Write technical documentation Work with data scientists and analysts to improve software Requirements Proven experience as a Full Stack Developer or similar role (6 months+) Freshers are welcome to apply if you have completed few projects and have a good portfolio Familiarity with common stacks (Django, MERN) Knowledge of multiple front-end languages and libraries (e.g. HTML/ CSS, JavaScript, XML, jQuery, bootstrap) Knowledge of back-end languages (Javascript, Python [Django]) and JavaScript frameworks (e.g. React, Node.js) Familiarity with databases (e.g. MySQL, MongoDB), web servers (e.g. Apache) and UI/UX design Git Finally, you can be from any educational background or a dropout, but you must be self-motivated and someone who can learn new tech. quickly and fix the errors and bugs on his/her own without any supervision. Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Software Development"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4334530277/",
    "job_id": "4334530277",
    "source": "linkedin",
    "company_name": "Somewhere",
    "job_title": "Frontend Developer",
    "location": "South Asia",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Frontend Developer ; Seniority level. Entry level ; Employment type. Full-time ; Job function. Engineering and Information Technology ; Industries."
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4059065235/",
    "job_id": "4059065235",
    "source": "linkedin",
    "company_name": "Gate",
    "job_title": "Front-end Developer",
    "location": "APAC",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Responsibilities岗位职责: Collaborate with product managers to complete product functionality development and optimization. Work with interaction designers"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4347647711/",
    "job_id": "4347647711",
    "source": "linkedin",
    "company_name": "Ailytics",
    "job_title": "Lead Frontend Developer",
    "location": "APAC",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Here at Ailytics, we’re building AI solutions to envision a safer world. By combining computer vision and predictive analytics, we enable organizations to proactively identify risks, optimize processes, and ultimately save lives. Our platforms are currently deployed all over the world, covering more than 300 million square meters! We’re looking for a seasoned leader to help lead our Frontend Development efforts. You’ll be working in a growing team to turn complex customer needs into user-friendly, visually appealing interfaces. This role will be a foundational piece of our design journey, and will help set the tone for our future. We are open to considering all candidates within a 2.5 hour timeframe to Singapore. You will have to adapt to the working schedule of 9:00am to 6:00pm SGT. We are also specifically looking for someone with expertise in Typescript, and prior experience in leading a Frontend team/project. Fluency in English (Minimally C1 or equivalent) will also be required. What You Will Be Doing Assist with the full lifecycle of frontend projects, from concept through execution, to ensure timely delivery of robust and scalable solutions. Develop responsive and accessible web interfaces while ensuring compatibility across various devices and adherence to web accessibility standards. Review our current UI/UX design system and recommend improvement plans to our leadership team. Work closely with the CTO, Backend Developers, and other cross functional teams to integrate design with overall product strategy. Utilize Git for code versioning and maintain best practices in both design and development processes. Our Ideal Requirements Minimally 6+ years of experience with frontend development, particularly with React.js, Typescript, CSS, and Tailwind. Bare minimum 4 years of experience with Typescript. Prior experience with leading/managing a development team. A basic understanding of Python would be preferred. Prior professional experience with Figma and ideally a portfolio demonstrating past frontend/design projects Excellent communication skills and the ability to lead projects from ideation to execution. Past experience in a startup environment would be a big plus. Why Work At Ailytics? This is an opportunity to create lasting impact and explore the intersection of AI and safety. We’re a start-up that’s still in its early stages. If you’re looking for an environment where you can really make an impact, this is it. We value strong standards, high transparency, and low egos. Let us know if this sounds like you. Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Information Technology Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4239842763/",
    "job_id": "4239842763",
    "source": "linkedin",
    "company_name": "Flipster",
    "job_title": "Mobile Software Engineer (iOS)",
    "location": "APAC",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Flipster APAC. 8 months ago Be among the first 25 applicants. See who Flipster has hired for this role. No longer accepting applications · Technical ability to"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2779188681/",
    "job_id": "2779188681",
    "source": "linkedin",
    "company_name": "ICTcave",
    "job_title": "Software Developer (Django)",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Senior Python Developer | AI/ML |… ... Candidate must have previously worked on projects with the above mentioned skill set. Show more. Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3507698900/",
    "job_id": "3507698900",
    "source": "linkedin",
    "company_name": "ACCA Careers নিয়োগ",
    "job_title": "Senior Accountant",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4298779839/",
    "job_id": "4298779839",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Commure নিয়োগ",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4349854996/",
    "job_id": "4349854996",
    "source": "linkedin",
    "company_name": "For A Reputed Company",
    "job_title": "Jr. Accountant / Asst. Accountant",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4111817571/",
    "job_id": "4111817571",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Flyhub Travel Bangladesh LTD নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3279723422/",
    "job_id": "3279723422",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "banglalink hiring Corporate Account Manager in Dhaka ...",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2552419652/",
    "job_id": "2552419652",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Client Service/ Key Account Executive",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3968270460/",
    "job_id": "3968270460",
    "source": "linkedin",
    "company_name": "(For Hatim Group)",
    "job_title": "Executive (Cost Accountant)",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4232864094/",
    "job_id": "4232864094",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Cost Accountant (For Green Delta Insurance Company ...",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/5/",
    "job_id": "5",
    "source": "linkedin",
    "company_name": "Dhaka",
    "job_title": "5) agm-accounts, tax & vat",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4057745340/",
    "job_id": "4057745340",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "American & Efird (Bangladesh) Ltd নিয়োগ",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2699718386/",
    "job_id": "2699718386",
    "source": "linkedin",
    "company_name": "Hogarth Dhaka",
    "job_title": "Frontend Magento Developer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Hogarth Dhaka Habiba Akther Habiba Akther Connected tech talents with a global platform | Tech Recruiter| Ex-WPP Network At Wunderman Thompson we exist to inspire growth for ambitious brands. Part creative agency, part consultancy and part technology company, our experts provide end-to-end capabilities at a global scale to deliver inspiration across the entire brand and customer experience. The developer will be talented, enthusiastic, focused, eye for detail, professional. Keen to learn and to challenge for smarter ways of doing things; a team player proud of their work who wants to share it. You like working in a fast-paced environment and are ready to inspire outstanding online shopper experiences for consumers and brands, no matter what product, service, sector, device or channel! What you’ll do Create prototypes and production-ready XHTML/CSS /JS for a greenfield Magento 2 eCommerce website Working within an agile team, contributing to daily stand-ups, sprint planning and estimations Contributing to the team’s focus to maintain Front End Quality through participating in coding reviews and adhering to Wunderman Thompson Commerce coding standards including those of Accessibility Stay current with evolving standards and technologies, learning new skills as needed What you’ll need Min 3 years of Experience creating site architecture diagrams, UX wireframes, process flows. Min 3 years of Experience designing for dynamic and template-driven sites. Experience of industry standard vector & bitmap graphics packages. Creative, yet meticulous. Commercial experience of SPA and/or PWA applications Working with Pattern Libraries & CSS frameworks Mastery of hand-coded XHTML and CSS, adhering to W3C coding standards. Table-free layouts; semantic mark-up; standards enthusiast. Advanced knowledge of JavaScript (native) and JavaScript Libraries including jQuery Magento 2 experience is essential PHP experience is essential for this role Experience using Magento’s Page builder Commercial knowledge of JS Frameworks such as React and/or Angular, advantageous Bootstrap Responsive Design experience is essential SASS and/or LESS is essential GIT Version Control Experience of working within an Agile working environment Great attitude, strong work ethic, excellent communication skills Excellent problem-solving ability Good understanding/awareness of Usability, Accessibility Proficient understanding of cross-browser compatibility issues and ways to work around them Solid information, interaction, and visual design skills Willingness to contribute to both large, complex projects and smaller tasks as directed. Ability to work quickly and manage multiple projects and timelines. We are 20,000 strong in 90 markets around the world, where our people bring together creative storytelling, diverse perspectives, inclusive thinking, and highly specialized vertical capabilities, to drive growth for our clients. We offer deep expertise across the entire customer journey, including communications, commerce, consultancy, CRM, CX, data, production and technology. Wunderman Thompson is a WPP agency (NYSE: WPP). For more information, please visit us at www.wundermanthompson.com and follow Wunderman Thompson on our social channels via Twitter, Facebook, LinkedIn, and Instagram. Show more Show less Seniority level Not Applicable Employment type Full-time Job function Information Technology, Engineering, and Advertising Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4145511886/",
    "job_id": "4145511886",
    "source": "linkedin",
    "company_name": "micro1",
    "job_title": "Frontend Developer",
    "location": "APAC",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Job Title: Frontend Developer Job Type: Full-time or Part-Time Location: Remote About Us: Our mission at micro1 is to match the most talented people in the world with their dream jobs. If you are looking to be at the forefront of AI innovation and work with some of the fastest growing companies in Silicon Valley, we invite you to apply for a role. By joining the micro1 community, your resume will become visible to top industry leaders, unlocking access to the best career opportunities on the market. Job Summary: Join our dynamic team at micro1 as a Frontend Developer where you will be instrumental in creating engaging and dynamic user experiences for web applications. At micro1, we provide opportunities to work with leading companies in Silicon Valley, ensuring a stable and competitive income in a flexible remote setting. Embrace the opportunity to grow your career, access top industry opportunities, and enjoy a range of great benefits. Key Responsibilities: Develop high-quality frontend components for web applications. Optimize user interfaces to enhance user experiences. Collaborate with cross-functional teams to define and design new features. Ensure cross-browser compatibility and implement responsive designs. Maintain code quality and ensure responsiveness of applications. Utilize industry best practices and design patterns. Participate in code reviews to maintain high code quality standards. Required Skills and Qualifications: Proficiency in HTML, CSS, and JavaScript. Strong experience with React and Angular frameworks. Excellent written and verbal communication skills. Ability to work effectively in a remote setting. Demonstrated ability to develop and optimize user interfaces. Experience with ensuring cross-browser compatibility of applications. Strong problem-solving skills and attention to detail. Preferred Qualifications: Experience with responsive design and mobile-first development. Familiarity with version control systems, such as Git. Understanding of Agile methodologies. It's okay if you don't. Having a Native to C2/C1 level in another language such as German, French, or Spanish is nice to have. Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering and Information Technology Industries Software Development, IT Services and IT Consulting, and Technology, Information and Media"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2681639140/",
    "job_id": "2681639140",
    "source": "linkedin",
    "company_name": "Shohoz",
    "job_title": "Senior Software Engineer (Front-End)",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Shohoz Ashik Imtiaz Ashik Imtiaz HR Professional with 14 years of experience in the HR Field, Bangladesh Shohoj Limited, is a premium online and on-demand service provider committed to make the life of Bangladeshi people convenient, easier and smarter by giving a wide range of products and tech driven solutions through Shohoz Super App like-ride sharing, food delivery, online bus ticketing, truck rentals and many more upcoming exciting new projects. Job Title : Senior Software Engineer (Front-End) Job Description: Develop new user-facing features Design and implement clean, efficient, highly modular, scalable client-side code Build reusable code, component and libraries for future use Ensure the technical feasibility of UI/UX designs and ensure Web Accessibility Optimize application for maximum speed and scalability Collaborate with other team members and stakeholders as well as other teams Other Requirements: Proficiency in JavaScript including modern APIs and syntax (ES6+), TypeScript, SASS, LESS, HTML5/CSS3 Strong understanding and hands-on experience with JavaScript framework Angular Experience of React will consider as a great plus Hands on experience on Progressive Web App (PWA) development using (React/Angular) and build for Android/iOS platform would be great advantage Understanding of state management technologies like NgRx, Redux is important Popular UI frameworks like Angular Material, MaterialUI, Bootstrap, Foundation expertise is needed Experience with JavaScript libraries like RxJS, Lodash, Jquery would be preferable Practical knowledge of Service Worker, Server-side Rendering, Cookie management Experience with front-end build and package management tools such as npm, Webpack, Gulp, Grunt, Bower Convert design documents into a modern responsive user interface with no loss in fidelity, pixel-perfect and have mobile-first thinking Experience working with RESTful Web Services integration Experience using and writing automated tests with a test runner (Jasmine, Mocha, QUnit or similar) Experience using git-based workflow tools and concepts (GitHub, Branching, Pull Requests or similar) Experience in PHP, C#, Go will be considered an added advantage Knowledge of GraphQL, Mongo DB will be considered an added advantage Employment Status: Full-time Educational Requirements: Bachelor of Science (BSc) in CSE Experience Requirement: 8 to 9 year(s) Job Location: Shohoz HQ, House#55B, Road#21, Block# B, Banani, Dhaka, 1213 Salary: Negotiable Compensation & Other Benefits: Weekly 2 holidays Salary Review: Yearly Festival Bonus: 2 Flexible, friendly and good work environment Interested candidates are requested to send their updated resume to career@shohoz.com mentioning the position the subject line by August 25, 2021 Show more Show less Seniority level Not Applicable Employment type Full-time Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2473915091/",
    "job_id": "2473915091",
    "source": "linkedin",
    "company_name": "Mediusware",
    "job_title": "Laravel Developer",
    "location": "Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Mediusware Ltd (Software Development Company) is looking for some Laravel Developers who has skills and professional"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4249001718/",
    "job_id": "4249001718",
    "source": "linkedin",
    "company_name": "Bitget Wallet",
    "job_title": "Frontend Developer",
    "location": "APAC",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Posted 9:58:47 AM. About us Bitget Wallet is the non-custodial crypto wallet designed to make crypto simple and secure…See this and similar jobs on"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2696312875/",
    "job_id": "2696312875",
    "source": "linkedin",
    "company_name": "ShopUp",
    "job_title": "Devops Support Engineer",
    "location": "Dhaka ...",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "ShopUp Dhaka, Bangladesh. 4 years ago Be among the first 25 applicants. See who ShopUp has hired for this role. No longer accepting applications · A purpose"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4154050314/",
    "job_id": "4154050314",
    "source": "linkedin",
    "company_name": "Makro PRO",
    "job_title": "Senior DevOps Engineer (Golang) - Fully REMOTE",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Mid-Senior level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "MakroPRO is an exciting new digital venture by the iconic Makro . Our proud purpose is to build a technology platform that will help make business possible for restaurant owners, hotels, and independent retailers, and open the door for sellers. MakroPRO brings together the best talent across multi-nationals to transform the B2B marketplace ecosystem. We welcome bold, energetic, and thoughtful people who share our belief in collaboration, diversity, excellence, and putting customers at the heart of our work Take your career to new heights in the future of B2B e-commerce . Join our team and help us build Southeast Asia's next unicorn . Your Challenge The DevOps Engineer helps increase speed of delivery, improve quality/security of code, and optimize processes for development team. The DevOps Engineer is responsible for identifying the bottlenecks of various development and delivery processes, working with team members to improve them, and improving the overall experience of developers. They are responsible for infrastructure-as-code deployment tooling and supporting services on multiple cloud provides along with metrics and login Works closely with Tech Leads and developers of various teams to develop automation pipelines and CI/CD Develops self-serve tools/artefacts to development teams to support the SDLC (e.g. containerized dev env, testing env etc.) Configures the infrastructure using IaaS/PaaS products and own developed tools Actively participates in deploying application artifacts to appropriate target environments using the supported technologies and infrastructure Participates in planning delivery time, code quality, and process efficiency improvement projects Performs maintenance tasks as infrastructure health checks and monitoring Identifies bottlenecks in development and deployment processes and designs automation solutions to mitigate Maintains and grows knowledge of platform configuration management, monitoring, and troubleshooting Collaborates with the rest of DevOps team to deliver consistent and holistic solutions to the organization Requirements Strong proficiency in Golang and experience with writing production-grade software using Golang Hands-on experience with developing Kubernetes controllers and custom resource definitions (CRDs) in Golang. Hands-on experience with managing Kubernetes clusters (e.g., kubeadm, EKS, GKE, AKS). Experience with AWS networking services like VPC Peering, Transit Gateway, and PrivateLink. Familiarity with load balancing (ALB, NLB, ELB) in AWS. Experience in building self-service developer platforms. Exposure to GitOps workflows (ArgoCD, FluxCD). Benefits Renewable contract (1 year) Fully remote job Clear focus Diverse Workplace (Our members are from around the world!) Non-hierarchical and agile environment Growth opportunity and career path Show more Show less Seniority level Mid-Senior level Employment type Full-time Job function Engineering Industries Retail"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4086130053/",
    "job_id": "4086130053",
    "source": "linkedin",
    "company_name": "micro1",
    "job_title": "DevOps Engineer",
    "location": "South Asia",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "What We Offer: Work from anywhere; Healthcare reimbursement; Wi-Fi Reimbursement; Unlimited Learning: Access to Udemy courses, books, and everything you need to"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4280092718/",
    "job_id": "4280092718",
    "source": "linkedin",
    "company_name": "Trust Wallet",
    "job_title": "Senior Mobile DevOps Engineer",
    "location": "APAC",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Senior Mobile DevOps Engineer · Seniority level. Mid-Senior level · Employment type. Full-time · Job function. Engineering · Industries. Technology, Information and"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4264323208/",
    "job_id": "4264323208",
    "source": "linkedin",
    "company_name": "Geekify",
    "job_title": "Mobile Application Developer",
    "location": "Motijheel Thana, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Entry level",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from Geekify Oshinne Jimena Oshinne Jimena Head of Operations at Geekify Responsibilities: ● Developing a highly functional mobile application through the creation of clean, concise, and effective code. ● Managing mobile application deployment in both apple app store and google play store. ● Providing support throughout the entire application lifecycle, including conception, design, testing, release, and ongoing maintenance. ● Collaborate with cross-functional teams (including backend developers, designers) to deliver high-quality projects on time. ● Continuously exploring, assessing, and integrating new technologies to enhance development efficiency and user experience. Qualifications: ● At least 2+ years of experience building iOS/Android mobile applications in Flutter . ● Experience in native (Java/Kotlin/Swift/Objective-C) application development is a plus. ● Strong understanding of object-oriented programming, and design patterns including MVP/MVVM patterns. ● Experience with Bloc or Getx for state management, outside data sources, RESTful APIs to connect with back-end services, Cloud messaging, third party mobile payment system and push notifications. ● Strong knowledge of UI/UX design principles and making responsive UI. ● Proficiency in building and maintaining complex software systems. ● Proficient understanding of code versioning tools, such as Git/Bitbucket. ● Familiarity with Agile development methodologies., ● Ability to work independently and collaboratively in a team environment. ● Good communication skills and attention to detail. Educational Requirements: ● Bachelor of Science (BSc) in CSE/CS/SE, or any other discipline. ● If you are skilled, educational qualifications can be relaxed. Employment Status: ● Full-time ● Both males and females are allowed to apply. Office Location Motijheel, Dhaka Office Hours: ● 09.30 AM to 6.00 PM ● Sunday to Thursday Salary: ● Negotiable. ● Depends on Experience and Qualification. We offer a friendly work environment that promotes collaboration, creativity, and personal growth. We are valuing the contribution of our employees over the number of hours worked. How to Apply: If you are interested in this opportunity, please send your resume with the email subject: Applying for Mobile Application Developer at roy@krazyit.com Your resume must describe your experience in the required technologies in detail. We look forward to hearing from you. Show more Show less Seniority level Entry level Employment type Full-time Job function Engineering and Information Technology Industries IT Services and IT Consulting"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3473919577/",
    "job_id": "3473919577",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Mobile Engineer",
    "location": "Bangladesh",
    "salary": "",
    "employment_type": "",
    "experience": "",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Mobile Engineer ; Seniority level. Not Applicable ; Employment type. Full-time ; Job function. Engineering and Information Technology ; Industries. Software"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2329045811/",
    "job_id": "2329045811",
    "source": "linkedin",
    "company_name": "REVE Systems",
    "job_title": "Android Developer",
    "location": "Dhaka, Dhaka, Bangladesh",
    "salary": "",
    "employment_type": "Full-time",
    "experience": "Not Applicable",
    "education": "",
    "deadline": "",
    "date_posted": "",
    "job_description": "Direct message the job poster from REVE Systems Mohammed Ziaul Mohammed Ziaul Recruiter I SaaS | Healthcare | IT | Sales | Telco | Construction | 3000+ Successful Hires Research and develop new features, explore different new mobile technologies and implement those Good problem solving skills. Good knowledge of OOP. Strong knowledge of Android SDK, different versions of Android, and how to deal with different screen sizes Maintain design pattern, best practices, UI pixel perfection and quality code Strong knowledge of Android Material UI design principles, patterns, and best practices Experience with offline storage, threading, and performance tuning Understand business requirements and translate them into technical requirements Maintain a version controlling system and project management tool Familiarity with Java & Kotlin Firebase & other 3rd party service integration Familiarity with RESTful APIs to connect Android applications to back-end services Strong knowledge of Android UI design principles, patterns, and best practices Experience with offline storage, threading, and performance tuning Understanding of Google's Android design principles and interface guidelines Familiarity with Room Database. Educational Requirements: Bachelor of Science (BSc) in CSE Experience Requirements: 3 to 5 Years The applicants should have experience in the following area(s): Android, Android application development, Android Studio, Flutter, Java (Android), Kotlin Show more Show less Seniority level Not Applicable Employment type Full-time Job function Engineering and Information Technology Industries Telecommunications"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352230138/",
    "job_id": "4352230138",
    "source": "linkedin",
    "company_name": "CEVA Logistics",
    "job_title": "Customs Brokerage Team Leader",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3401914357/",
    "job_id": "3401914357",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Optimizely hiring Accountant in Dhaka, Dhaka, Bangladesh",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3223976410/",
    "job_id": "3223976410",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "ADA hiring Account Executive in Dhaka, Dhaka, Bangladesh",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2797828885/",
    "job_id": "2797828885",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Infobip hiring Senior Account Manager in Dhaka ...",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3938638545/",
    "job_id": "3938638545",
    "source": "linkedin",
    "company_name": "Business Globalizer",
    "job_title": "Tax Accountant Specialist",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  }
]