[
  {
    "url": "https://www.linkedin.com/jobs/view/4366373885/",
    "job_id": "4366373885",
    "source": "linkedin",
    "company_name": "ADNOC Group",
    "job_title": "Analyst, Financial Systems",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369532770/",
    "job_id": "4369532770",
    "source": "linkedin",
    "company_name": "Full Battery Media",
    "job_title": "Bookkeeper / Accountant",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352356922/",
    "job_id": "4352356922",
    "source": "linkedin",
    "company_name": "Deloitte",
    "job_title": "VN - A&A - Amplify Program",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369030954/",
    "job_id": "4369030954",
    "source": "linkedin",
    "company_name": "Paradox Events & Marketing & Production KSA | QA | UAE",
    "job_title": "Accountant- KSA and QA",
    "location": "Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363375442/",
    "job_id": "4363375442",
    "source": "linkedin",
    "company_name": "Options Consulting Solutions",
    "job_title": "Senior Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4353941887/",
    "job_id": "4353941887",
    "source": "linkedin",
    "company_name": "Amref Health Africa",
    "job_title": "Senior Programme Finance Manager",
    "location": "Nairobi, Nairobi County, Kenya",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355292792/",
    "job_id": "4355292792",
    "source": "linkedin",
    "company_name": "COA Holding Company",
    "job_title": "Accounting Manager",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356972112/",
    "job_id": "4356972112",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Accountant- For Marco Elite Ltd- Job ID: 1455148",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358048301/",
    "job_id": "4358048301",
    "source": "linkedin",
    "company_name": "Suss Ads || Suss Digital",
    "job_title": "Account Manager (Performance & Platform-Led Advertising)",
    "location": "Nairobi County, Kenya",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company: Suss Ads (Suss Digital Africa Ltd) Location: Nairobi (Hybrid) Experience Level: Mid–Senior (3–6+ years) ABOUT SUSS ADS Suss Ads is an Africa-first AdTech company building scalable advertising infrastructure across programmatic, pDOOH, social, video, and data-powered performance channels. We help brands and agencies activate efficient, transparent, and automated media buying across Africa’s rapidly evolving digital landscape. ROLE OVERVIEW The Account Manager is the primary owner of client success post-sale. You will ensure campaigns are launched quickly, optimized for performance, reported with precision, billed accurately, and renewed consistently. This role blends client service, performance media expertise, operational excellence, and platform enablement. You are the bridge between clients, internal teams, and our platform - ensuring every engagement delivers measurable value. KEY RESPONSIBILITIES 1. Client Relationship & Success Management Lead onboarding sessions and platform walk-throughs Serve as the day-to-day client contact, ensuring world-class turnaround times Manage expectations, address concerns proactively, and maintain strong retention metrics Drive platform adoption and usage across client teams 2. Campaign Execution & Quality Assurance Coordinate campaign setup with AdOps and Product teams Execute detailed pre-launch QA (tracking, targeting, creatives, pacing, compliance) Manage daily optimizations across programmatic, social, video, and pDOOH channels Troubleshoot performance issues, delivery gaps, and tech-related challenges 3. Reporting, Insights & Performance Strategy Deliver weekly, monthly, and end-of-campaign reports with actionable insights Translate data into strategic recommendations for optimization and upsell Identify new growth areas based on performance trends and vertical benchmarks 4. Revenue, Upsell & Renewals Own account growth KPIs including renewals, upsells, and cross-channel expansion Identify opportunities for added services, data solutions, or platform features Maintain strong pipeline visibility in CRM 5. Operational & Process Excellence Oversee billing accuracy, invoice reconciliation, and finance alignment Maintain strict CRM (HubSpot) hygiene Own operational SLAs and continuous improvement of client delivery workflows Collaborate with Product, Engineering, and Ops for bug reporting and feature feedback 6. Internal Collaboration & Thought Leadership Work closely with Sales to transition accounts post-sale Partner with Marketing to develop case studies and success stories Contribute to training materials, client documentation, and playbooks Represent Suss Ads in client workshops, webinars, and industry events REQUIREMENTS 3–6+ years in digital advertising, media buying, AdTech, or programmatic platforms Strong understanding of performance media, data interpretation, and optimization levers Experience using DSPs, ad servers, analytics tools, and attribution systems CRM experience (HubSpot preferred) Excellent communication skills and attention to detail Analytical mindset with the ability to simplify complex data for clients Strong project management and multitasking abilities BONUS SKILLS (Nice to Have) Experience with Programmatic (DV360, TT, The Trade Desk, Amazon, etc.) Hands-on digital media buying background Familiarity with pDOOH or retail media platforms SQL, Looker Studio, or advanced analytics skills Experience in multicultural or multi-market campaign execution WHY JOIN SUSS ADS Work in a platform-led, automation-first environment High-touch exposure to brands, agencies, and enterprise clients across markets Opportunity to grow into Senior AM, Client Lead, or Platform Success Lead roles Influence the future of Africa’s AdTech ecosystem Collaborative, fast-paced, innovation-driven culture To apply, please send your resume and portfolio to hr@suss.co.ke Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368947291/",
    "job_id": "4368947291",
    "source": "linkedin",
    "company_name": "Vortech Service Company Limited",
    "job_title": "General Accountant",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356609998/",
    "job_id": "4356609998",
    "source": "linkedin",
    "company_name": "foundit",
    "job_title": "Senior Accountant",
    "location": "Metro Manila",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352183053/",
    "job_id": "4352183053",
    "source": "linkedin",
    "company_name": "EDGE",
    "job_title": "Manager, Treasury",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357380456/",
    "job_id": "4357380456",
    "source": "linkedin",
    "company_name": "Robert Walters",
    "job_title": "Treasury Manager (Leading Global MNC in HCMC)",
    "location": "Ho Chi Minh City, Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356504893/",
    "job_id": "4356504893",
    "source": "linkedin",
    "company_name": "KIDZONET",
    "job_title": "Finance Manager",
    "location": "Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368333120/",
    "job_id": "4368333120",
    "source": "linkedin",
    "company_name": "Mogi I/O : OTT/Podcast/Short Video Apps for you",
    "job_title": "Finance Operations Manager – Payments",
    "location": "Metro Manila",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Location: Manila, PhilippinesWork Type: Full-Time, Onsite (5 Days Work from Office)Compensation: PHP 600000 - 720000Eligibility: Philippines Citizens OnlyNotice Period: Immediate to 30 DaysJob Stability Required: Minimum 2 Years in each organizationJob OverviewWe are seeking a highly motivated and detail-oriented Associate Manager (IA Payments) to lead daily international and general payment operations within the Finance team. This role involves managing end-to-end global payment processes, supervising payment-related tasks, ensuring compliance with accounting standards, and driving operational efficiency.The Associate Manager will work closely with internal stakeholders, external partners, auditors, and banking teams to ensure accurate, timely, and compliant financial transactions.Key ResponsibilitiesManage and execute daily international and general payment activities with high accuracy Oversee the full payment lifecycle including invoices, expense reimbursements, and financial transactions Supervise payment-related tasks and allocate workload across team members Ensure strict compliance with internal controls and accounting standards Act as the main point of contact for payment queries and issue resolution Prepare payment schedules, reconciliation documentation, and audit support reports Ensure payments meet turnaround time (TAT) and compliance requirements Support and supervise IA fee payments reporting Analyze operations and recommend process improvements for efficiency and accuracy Perform additional finance-related tasks as assigned by managementMust-Have Qualifications Bachelor’s or Master’s degree (any discipline) Minimum 5+ years of experience in:Finance or business operations Accounts Payable / Accounts Receivable Closing activities Extensive experience handling international/global payments Strong English communication skills (written and verbal) Strong job stability (minimum 2 years per organization) Nice-to-Have QualificationsProcess improvement initiatives Financial reporting and reconciliation Team leadership and supervision Advanced skills in Google Suite (pivot tables, data analysis, presentations) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368867838/",
    "job_id": "4368867838",
    "source": "linkedin",
    "company_name": "2iSolutions Inc.",
    "job_title": "SAP HCM Analyst",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354253829/",
    "job_id": "4354253829",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Digital Channel Sales SEO/Asstt. Manager (Fintech & Aggregator Channels) - For Life Insurance - Job ID: 1452449",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4281788885/",
    "job_id": "4281788885",
    "source": "linkedin",
    "company_name": "blnk",
    "job_title": "محصل ميداني",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359838359/",
    "job_id": "4359838359",
    "source": "linkedin",
    "company_name": "Confidential",
    "job_title": "Agency Support Specialist",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369155866/",
    "job_id": "4369155866",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Coordinator-Admin",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369167178/",
    "job_id": "4369167178",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Coordinator-Admin",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369166482/",
    "job_id": "4369166482",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Coordinator-Admin",
    "location": "Doha, Doha, Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4283714235/",
    "job_id": "4283714235",
    "source": "linkedin",
    "company_name": "Reliance Health",
    "job_title": "Administrative Officer (RFC Ogba)",
    "location": "Lagos, Lagos State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Reliance Health's mission is to make quality healthcare delightful, affordable, and accessible in emerging markets. From Nigeria, Egypt, Senegal and beyond, we offer comprehensive health plans tailored to both employers' and employees' needs through an integrated approach that includes telemedicine, affordable health insurance, and a combination of partner and proprietary healthcare facilities.By leveraging advanced technology, we are transforming the healthcare landscape, making it more efficient and accessible for everyone.The administrative assistant will serve as a friendly face for a clinic that strives to treat every patient as a VIP. The successful candidate will be friendly, engaging, and helpful with strong communication skills.Schedule clients and patients for appointments, health education sessions and on-site events while demonstrating politeness, courtesy, and professionalism. Triage patients in need of medical assistance and alert medical staff Organize transportation as needed by the medical and non-medical team. Use computer systems to accurately, document, locate, modify, and retrieve data which includes patient data, claims, invoices and stock keeping etc Receive and respond to routine and urgent requests for assistance from and for patients, families, staff, and others via tickets, phone, SMS, social media, and emails Maintain key organizational documents in soft and hard copies immaculately in adherence with filing systems Demonstrate effective telephone and email communication techniques/etiquette Document and invoice customers as applicable and follow up on payments and manage petty cash records transparently Securely and confidentially collect, retrieve and share patient records and enter data for medical or administrative reporting RequirementsMinimum of BSc/HND in a related field Similar experience in a role related to front desk work, customer service and administrative skills particularly in a healthcare field is a plus Computer skills and ability to navigate Microsoft Office tools including Word, Excel and Outlook Excellent problem solving, conflict resolution, and customer service skills Excellent verbal and written communication skills Highly organized, detail-oriented, self-directed, and goal-driven Experience with bookkeeping and basic accounting processes is a plus. Comfortable working 8am-8pm shift on week days and on weekends when on shiftBenefitsAt Reliance Health, we prioritize our people and their well-being. Our benefits package is designed to support your success, growth, and happiness. Here's what you'll enjoy: Competitive Salary and Benefits We offer a salary that's benchmarked against the best in the industry, ensuring your expertise and impact are fully rewarded Premium Health Insurance Comprehensive health coverage for you and your family, because your well-being comes first Unlimited Leave Take the time you need when you need it—no limits, no questions Meaningful Impact Play a key role in transforming customer experiences and shaping healthcare innovation Collaborative Work Culture Join a supportive, inclusive, and team-focused environment that celebrates diversity. Growth Opportunities Access tools, mentorship, and resources to elevate your skills and career Learning & Development Allowance We provide an allowance to support your ongoing professional growth and skill enhancement. This is more than a job—it's a chance to grow, thrive, and make a real difference. At Reliance Health, your journey matters Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4332998120/",
    "job_id": "4332998120",
    "source": "linkedin",
    "company_name": "Tetra Maritime",
    "job_title": "Admin Associate",
    "location": "Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368392632/",
    "job_id": "4368392632",
    "source": "linkedin",
    "company_name": "Marriott International",
    "job_title": "Coordinator-Admin",
    "location": "Cairo, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361773139/",
    "job_id": "4361773139",
    "source": "linkedin",
    "company_name": "Golden Developer Technology Systems",
    "job_title": "Administrative Assistant",
    "location": "El Sherouk, Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362732134/",
    "job_id": "4362732134",
    "source": "linkedin",
    "company_name": "ADIB - Abu Dhabi Islamic Bank",
    "job_title": "Manager - Operational Control & Governance",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Role: Manager – Operational Control & Governance Location: Abu Dhabi Role Purpose: The Manager – Operational Control & Governance plays a key role within the Internal Control function of Group Operations. This position is responsible for implementing and maintaining a robust control review framework to ensure operational processes comply with regulatory requirements, industry standards, and internal policies. The role supports risk mitigation, process improvement, and promotes a culture of compliance and governance across the organization. Key Accountabilities of the role: Control Reviews Conduct comprehensive reviews of policies and procedures (P&Ps) to ensure alignment with regulatory, industry, and internal standards. Compliance Assessments Evaluate operational compliance with applicable laws, regulations, and internal governance frameworks. Risk Assessments Assess the effectiveness of existing controls, identify operational risks and vulnerabilities, and recommend mitigation strategies. Process Improvements Collaborate with stakeholders to identify opportunities for control enhancements and provide actionable recommendations for process optimization. Stakeholder Engagement Work closely with cross-functional teams to ensure consistency in control practices and promote adoption of best practices. Training & Awareness Deliver guidance and training sessions on control and compliance topics to strengthen organizational understanding and adherence to established policies. Reporting Prepare and present detailed reports on control review outcomes, compliance status, and progress updates to operational leadership and key stakeholders. Data Analytics Utilize data analysis tools and techniques to identify trends, anomalies, and areas of concern within operational processes. Specialist Skills / Technical Knowledge Required for this role: Advanced MS Excel & PowerPoint Skills Ability to build dashboards, perform data analysis, and create impactful presentations for senior stakeholders. Interpersonal & Stakeholder Management Skills Strong communication and relationship-building capabilities to engage effectively with Division Heads, senior management, and cross-functional teams. Team Leadership & Management Experience in leading teams, managing performance, and fostering a collaborative and high-performing work environment. Presentation & Reporting Skills Proficiency in preparing and delivering structured reports and presentations to executive committees and governance forums. Problem Solving & Analytical Thinking Ability to apply sound judgment and structured thinking to resolve complex control and risk-related issues. Audit & Compliance Knowledge Familiarity with audit processes, regulatory requirements, and compliance frameworks relevant to banking operations. Operational Risk Management Tools & Frameworks Understanding of ORM methodologies including RCSA, issue tracking, and risk heat mapping. Governance, Risk & Compliance (GRC) Systems Experience in using GRC platforms for tracking actions, managing risks, and reporting. Policy & Procedure Review Expertise Ability to assess and enhance control elements embedded within operational policies and procedures. Project & Initiative Support Capability to contribute to high-profile projects and strategic initiatives, ensuring control and risk considerations are embedded. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368919752/",
    "job_id": "4368919752",
    "source": "linkedin",
    "company_name": "Newtimes Group of Companies",
    "job_title": "Compliance Specialist",
    "location": "Ho Chi Minh City Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368974832/",
    "job_id": "4368974832",
    "source": "linkedin",
    "company_name": "Manpower Vietnam",
    "job_title": "Manager of Risk Management & Legal Affairs",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4239030248/",
    "job_id": "4239030248",
    "source": "linkedin",
    "company_name": "For Printer Manufacturer (Job ID:1372789)",
    "job_title": "Cost Accountant",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369162742/",
    "job_id": "4369162742",
    "source": "linkedin",
    "company_name": "Persian Horizon",
    "job_title": "Chief Financial Officer (CFO / Head of Finance)",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368589675/",
    "job_id": "4368589675",
    "source": "linkedin",
    "company_name": "TASC Outsourcing",
    "job_title": "Finance Manager - FMCG industry",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369391367/",
    "job_id": "4369391367",
    "source": "linkedin",
    "company_name": "Mutiara Etnik Sdn Bhd",
    "job_title": "Finance Manager",
    "location": "Petaling Jaya, Selangor, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360573315/",
    "job_id": "4360573315",
    "source": "linkedin",
    "company_name": "Motlanalo Chartered Accountants & Auditors Inc.",
    "job_title": "SAICA Trainee Accountant",
    "location": "Sandton, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368707320/",
    "job_id": "4368707320",
    "source": "linkedin",
    "company_name": "Reeracoen Career",
    "job_title": "Accounting & Finance Assistant Manager (Lieu Giai, Hanoi) (27584)",
    "location": "Hanoi Capital Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359482696/",
    "job_id": "4359482696",
    "source": "linkedin",
    "company_name": "MEMA Consultancy",
    "job_title": "Senior Accountant",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are looking for a Senior Accounting Specialist for our client in the informationtechnology (IT) sector.Job DescriptionManage daily accounting operations and statutory compliancePerform bank and current account checks and reconciliationsProcess progress invoices; issue dispatch notes and sales invoicesSupport E-Ledger, BA/BS, tax, and audit processesContribute to monthly financial closing and accurate reportingPrepare project cost reports and conduct quarterly reconciliationsHandle daily financial operations and bank relationsPrepare regular financial reports (daily/weekly/monthly)QualificationsBachelor’s degree in Economics, Finance, Business, or related fields7+ years of accounting experienceExperience with BA/BS reconciliations and E-Invoice/E-Archive/E-LedgerStrong knowledge of accounting principles and reportingProficiency in MS Office and LOGO TigerKnowledge of Teknopark legislation (Law 4691)Good command of EnglishStrong analytical and organizational skills; team-oriented and adaptable Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366447049/",
    "job_id": "4366447049",
    "source": "linkedin",
    "company_name": "Agensi Pekerjaan Eco Asia",
    "job_title": "Finance Manager",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357402474/",
    "job_id": "4357402474",
    "source": "linkedin",
    "company_name": "NTT DATA, Inc.",
    "job_title": "Manager, Financial Accounting",
    "location": "Johannesburg, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Make an impact with NTT DATAJoin a company that is pushing the boundaries of what is possible. We are renowned for our technical excellence and leading innovations, and for making a difference to our clients and society. Our workplace embraces diversity and inclusion – it’s a place where you can grow, belong and thrive.Your day at NTT DATARole PurposeThis is a pivotal role that combines technical excellence with business transformation. The Manager, Financial Accounting is responsible for ensuring financial integrity, compliance, and statutory reporting. Simultaneously, this role will lead key elements of NTT Data’s strategic transformation agenda, including the ERP migration to SAP Rise and a finance function fit for the future.This role is ideal for a technically strong, detail-oriented finance leader who thrives on operational excellence, enjoys driving change, and is passionate about building high-performing, future-fit teams.Key ResponsibilitiesFinancial Reporting & ComplianceOwn and deliver accurate and timely month-end, quarter-end and year-end close processes.Prepare and review financial statements in accordance with IFRS and group policies.Ensure compliance with all statutory, regulatory and tax requirements across relevant jurisdictions.Manage the external audit process and act as key point of contact for auditors.Operational Finance LeadershipOversee general ledger, accounts payable, and cash management functions.Ensure the effective operation of financial systems and optimal use of automation tools.Act as the Finance Business Lead for the One ERP strategic migration from Oracle to SAP Rise.Lead the monthly forecasting process and ensure accurate, timely submissions aligned with business performance and strategic goals.Coordinate the annual budgeting process, working closely with stakeholders to develop a robust, data-driven financial plan.Financial Governance, Transformation & Continuous ImprovementDrive improvements in financial processes, controls, and reporting efficiency.Champion finance transformation aligned with ERP modernisation and global standardisation.Lead the Finance Cost-to-Serve review, identifying opportunities to reshape the finance structure, capabilities and service model.Assess and implement structural changes that align with best-practice finance operating models—lean, tech-enabled, and business-integrated.Business Partnering & InsightsCollaborate with FP&A, Commercial Finance, Procurement and other functions to align financial outcomes with business operations.Provide financial input to operational decision-making and strategic planning.Support business stakeholders with ad hoc financial analysis and scenario modelling.Leadership & Team DevelopmentLead and develop a high-performing finance team, fostering a culture of accountability, collaboration and continuous development.Assign and monitor work effectively, coach team members for career progression.Reshape the team to be financially fit for purpose—right-sized, right-skilled and aligned to the needs of a digitising business.Champion a mindset of agility, curiosity, and value creation across the team.Candidate ProfileTechnical & Functional ExpertiseSound understanding of IFRS, financial controls, and corporate accounting.Proven experience with integrated ERP systems (e.g., SAP, Oracle).Hands-on involvement in ERP implementations or migrations, ideally from Oracle to SAP.Strong Excel and data analysis skills; ability to work with large datasets.Leadership & Soft SkillsStrategic thinking and strong judgement under pressure.Excellent stakeholder engagement and influencing skills.Ability to manage deadlines, ambiguity and change.Passion for developing people and building team capability.QualificationsCA(SA), CIMA or equivalent essential.Postgraduate degree in Accounting, Finance or related field highly advantageous.Experience RequiredMinimum of 5+ years in a Financial Accounting leadership role.Proven track record managing teams in a complex, fast-paced corporate environment.Experience managing external audits, statutory filings and regulatory compliance.Direct experience leading or supporting ERP migrations.Exposure to finance transformation or organisational redesign initiatives preferred.NTT DATA is committed to building a finance function that is strategically aligned, digitally enabled, and business integrated. This role is critical to delivering that ambition.Workplace type: Hybrid WorkingAbout NTT DATANTT DATA is a $30+ billion business and technology services leader, serving 75% of the Fortune Global 100. We are committed to accelerating client success and positively impacting society through responsible innovation. We are one of the world’s leading AI and digital infrastructure providers, with unmatched capabilities in enterprise-scale AI, cloud, security, connectivity, data centers and application services. Our consulting and industry solutions help organizations and society move confidently and sustainably into the",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364323316/",
    "job_id": "4364323316",
    "source": "linkedin",
    "company_name": "WatersEdge Solutions",
    "job_title": "Financial Analyst",
    "location": "Johannesburg Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358011195/",
    "job_id": "4358011195",
    "source": "linkedin",
    "company_name": "Adecco",
    "job_title": "Financial Analyst",
    "location": "Üsküdar, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356489889/",
    "job_id": "4356489889",
    "source": "linkedin",
    "company_name": "Versatile International Consultants",
    "job_title": "Accountant",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Versatile Group is a leading privately owned property company specialising in integrated, end-to-end project delivery. With heritage tracing back to 1974, Versatile is a vertically integrated group of specialist property companies comprising Versatile Construction (construction), PERIFA (development), Absolute (specialist trades) Versatile International (specialist project management advisory) and Versatile Capital (finance). We are looking for an Accountant to join our growing Finance team located in Business Bay, Dubai.Key Responsibilities include: General Accounting & Reporting· Prepare and review financial statements (P&L, balance sheet, cash flow), ensuring accuracy, compliance with Accounting Standards, and alignment with internal controls.· Lead month-end and year-end close processes, including complex journal entries, accruals, and reconciliations.· Conduct in-depth financial analysis to identify trends, risks, and opportunities, and present findings to senior stakeholders.· Prepare and review compliance with tax regulations and statutory reporting requirements.· Collaborate with project managers and department heads to develop and present annual budgets and rolling 24-month forecasts.· Analyse variances between actuals and budgets, providing actionable insights to improve financial performance.· Maintain and oversee general ledger integrity, working closely with accounts payable/receivable, and reviewing the fixed asset registers.· Manage end-of-month journals and reconciliations with a focus on accuracy and timeliness.Treasury· Support daily cash flow forecasting and liquidity planning.· Preparation of 12 month rolling forecastsCompliance & Regulatory· Prepare monthly and yearly tax submissions.· Work closely with external auditors during the annual audit process and ensure timely delivery of requested documents.· Support regulatory filings and liaise with external auditors and government bodies.Systems & Support· Support finance transformation initiatives and system upgrades.· Champion process improvements to boost efficiency and reporting accuracy.· Foster strong stakeholder relationships and uphold confidentiality.Team· Mentor junior staff, providing support, training, and development opportunities.Qualifications· Bachelor’s degree in Accounting, Finance, or a related discipline.· Minimum 4 years’ experience in an accounting role, preferably within construction, project-based, or multi-entity environments.Essential Criteria· Practical experience with month-end and year-end close processes, including journals, accruals, and reconciliations.· Experience preparing or assisting with financial statements, management reports, and variance analysis.· Ability to analyse financial data, identify issues, and communicate findings clearly to stakeholders.· Strong attention to detail with the ability to meet deadlines in a fast-paced environment.· Intermediate to advanced Excel skills (pivot tables, formulas, reconciliations).· Strong written and verbal communication skills.· Ability to work both independently and as part of a collaborative finance team. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364620529/",
    "job_id": "4364620529",
    "source": "linkedin",
    "company_name": "Merzigo",
    "job_title": "Budget and Reporting Executive",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368032684/",
    "job_id": "4368032684",
    "source": "linkedin",
    "company_name": "GreenHat Assurance",
    "job_title": "Information Technology Auditor",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4354143748/",
    "job_id": "4354143748",
    "source": "linkedin",
    "company_name": "Beşiktaş JK",
    "job_title": "İç Denetim Uzmanı (Operasyonel Denetim)",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357578714/",
    "job_id": "4357578714",
    "source": "linkedin",
    "company_name": "Mercury Global Dubai",
    "job_title": "Senior Accountant",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About UsEstablished automobile trading company in Dubai specializing in import/export and wholesale distribution. We’re seeking a detail-oriented Accountant to join our finance team and support accurate financial reporting, compliance, and day-to-day accounting operations.Role DescriptionThis is a full-time, on-site role for a Senior Accountant, located in Dubai. The responsibilities include managing financial records, preparing and analyzing financial reports, ensuring compliance with accounting standards, and overseeing budgeting and forecasting processes. The Senior Accountant will also handle tax filings, review financial transactions, and collaborate with internal teams and external auditors to maintain financial accuracy and transparency. Additionally, they will provide strategic financial insights and recommendations to senior management.QualificationsStrong knowledge of financial reporting, budgeting and UAE VAT and local compliance requirements5–10 years accounting experience, preferably in trading/import-export or automotive.Experience with accounting standards, tax compliance, and financial auditsProficiency in financial software (Zoho and Tally), data analysis, and ExcelAttention to detail, problem-solving abilities, and organizational skillsStrong English communication and teamwork skillsBachelor's degree in Accounting, Finance, or related fieldAbility to work effectively in a fast-paced, on-site environment Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352222184/",
    "job_id": "4352222184",
    "source": "linkedin",
    "company_name": "Koç University",
    "job_title": "İç Denetim, Risk Yönetimi ve Uyum Uzman Yardımcısı/Uzmanı",
    "location": "Sarıyer, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4331524497/",
    "job_id": "4331524497",
    "source": "linkedin",
    "company_name": "TestHiring",
    "job_title": "Require an Audit Manager in Dubai",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Overall planning, execution, and completion of multiple audit engagementsReview of audit working papers, financial statements, and audit reportsSupervision, mentoring, and review of work performed by audit teamsClient relationship management and resolution of complex audit issuesEnsuring compliance with IFRS, ISA, and firm audit methodologiesReview of management letters and significant audit judgmentsExposure to and oversight of UAE Corporate Tax and VAT mattersCoordination with Partners on engagement risk, timelines, and qualityRequirementsChartered Accountant (ICAI CA preferred)6 to 10 years of post-qualification experience in a professional audit firmStrong technical knowledge of IFRS and International Standards on AuditingProven experience in managing audit teams and client portfoliosExcellent communication, leadership, and review skillsPrior UAE / GCC audit experience will be a strong advantage Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321534287/",
    "job_id": "4321534287",
    "source": "linkedin",
    "company_name": "BTI Executive Search",
    "job_title": "Senior Manager, Audit",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352189461/",
    "job_id": "4352189461",
    "source": "linkedin",
    "company_name": "Karadeniz Holding",
    "job_title": "Environmental Standardization and Audit Manager",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are looking for an Environmental Standardization & Audit Manager to be assigned to our Environmental Department within Occupational Safety, Environment & Operational Excellence, located in İstanbul HQ.WHAT DO WE EXPECT?BSc degree in Environmental Engineering,Minimum 8 years of experience in Environmental management, including at least 3 years in a managerial position, preferably with exposure to multi-site or multi-country operations,Master’s degree or equivalent in a relevant field (e.g., environmental sciences, sustainability, circular economy, climate change, etc.) is preferable,Knowledge of environmental legislation and practices, particularly in the Energy sector,Familiarity with environmental licensing processes and related permitting procedures,Strong understanding of International Finance Corporation (IFC) Performance Standards, Equator Principles, and European Bank for Reconstruction and Development (EBRD) Performance Requirements, as well as the environmental and social appraisal requirements of various International Financial Institutions and Environmental Protection Agencies,Knowledge of Environmental and Social Impact Assessment (ESIA), Environmental and Social Action Plan (ESAP), Environmental and Social Risk Assessment (ESRA), and Stakeholder Engagement processes, with the ability to support their development and implementation,Excellent command of English, both written and spoken. Knowledge of French, Spanish, or Portuguese is an asset.WHAT AWAITS YOU?This role is positioned within the execution arm of the Environment Department and focuses on hands-on implementation across operational sites and projects.Supporting the implementation of Environmental and Social (E&S) policies and procedures in line with legal regulations, international standards, global sustainability index and company requirements,Contributing to the development and continuous improvement of the Environmental and Social Management System, including procedures and site-specific plans,Monitoring environmental and social performance indicators in accordance with national and international standards, and preparing related reports and action plans,Ensuring compliance with environmental legal requirements across Business Units and supporting necessary corrective actions,Assisting in identifying and managing environmental and social risks affecting employees, suppliers, and local communities,Promoting awareness by supporting E&S trainings and capacity-building efforts,Supporting the preparation and reporting of Environmental and Social Impact Assessments (ESIA) for both onshore and offshore projects,Following global environmental policies, conducting risk assessments, and providing recommendations for improvement,Assisting in reporting environmental incidents and community grievances,Supporting internal and external (Lenders) E&S audits, conducting site visits to gather data, monitor compliance, and recommend improvements,Following up environmental monitoring results and ensuring corrective actions are taken when needed to improve performance.WHAT DO WE OFFER?• Hybrid working opportunity,• One day off on your birthday,• Comprehensive Private Health Insurance,• Professional and personal training & development opportunities,• Exclusive discounts and campaigns for employees.In line with our \"One World\" philosophy, we are adding success to our achievements with our colleagues, candidates, and all stakeholders. We are committed to providing equal opportunities for all applicants, regardless of race, religion, language or gender and we crown our success with our diversity.In accordance with the Law No. 6698 on the Protection of Personal Data, please review the Personal Data Protection Notice for detailed information regarding the processing of your personal data. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4327906145/",
    "job_id": "4327906145",
    "source": "linkedin",
    "company_name": "Amphenol",
    "job_title": "Manager, Forensics and Compliance",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369605717/",
    "job_id": "4369605717",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369623286/",
    "job_id": "4369623286",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369614585/",
    "job_id": "4369614585",
    "source": "linkedin",
    "company_name": "Turing",
    "job_title": "Remote Business Analyst - 57510",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About Turing:Based in San Francisco, California, Turing is the world’s leading research accelerator for frontier AI labs and a trusted partner for global enterprises deploying advanced AI systems.Turing supports customers in two ways: first, by accelerating frontier research with high-quality data, advanced training pipelines, plus top AI researchers who specialize in coding, reasoning, STEM, multilinguality, multimodality, and agents; and second, by applying that expertise to help enterprises transform AI from proof of concept into proprietary intelligence with systems that perform reliably, deliver measurable impact, and drive lasting results on the P&LAbout the Role:We are looking for a detail-oriented Business Analyst to support evaluation and annotation workflows focused on quality, accuracy, and structured reasoning. This role is ideal for someone who is comfortable working with digital tools, performing side-by-side evaluations, and providing clear, well-supported justifications based on fact-checking.Responsibilities:Perform side-by-side (SxS) evaluations on GHD, comparing outputs and assessing quality, accuracy, and relevance.Conduct fact-checking to validate information and identify inconsistencies or inaccuracies.Provide detailed, well-structured justifications to support evaluation decisions.Follow established evaluation guidelines and quality standards consistently.Use browser-based tools and extensions to support analysis and review tasks.Execute simple command-line instructions when required to support evaluation workflows.Document findings clearly and communicate insights to stakeholders when needed.Requirements:Solid comfort using a computer in a professional setting.Experience working with browser extensions and online tools.Ability to run basic command-line commands (no advanced programming required).Strong analytical and critical thinking skills.High attention to detail and ability to justify decisions clearly and objectively.Comfortable working with evaluation frameworks, comparisons, and structured analysis.Good written communication skills in English.Nice to Have:Previous experience with evaluation, annotation, QA, or audit-type work.Familiarity with data quality, content evaluation, or model/output assessments.Background in business analysis, operations, or process improvement.Perks of Freelancing With Turing:Competitive compensation based on experience and expertise.Flexible working hours and a fully remote environment.Opportunity to contribute to impactful research initiatives.Potential for contract extension based on performance and project needs.Offer Details:Commitment Required: 30 hours per week minimum.Engagement Type: Contractor/Freelancer (no medical or paid leave).Time Overlap: Some overlap with UTC-8:00 (2–5 hrs/day) America/Los_Angeles.Application Process:Shortlisted candidates will be invited to complete an analytical challenge.Once the assessment is cleared, you’re ready to start contributing!After applying, you will receive an email with a login link. Please use that link to access the portal and complete your profile.Know amazing talent? Refer them at turing.com/referrals, and earn money from your network. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357703108/",
    "job_id": "4357703108",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Field Support Executive (Technical Department) - (For Chittagong Online Limited) - Job ID - 1456282",
    "location": "Chattogram, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Chittagong Online Limited is looking for Field Support Executive (Technical Department)Job Description / ResponsibilityWe are looking for talented and mentally and physically fit fresh graduate engineers for our Field Support Operations (Technical) in Chattogram and Cox`s Bazar offices on yearly contract.Responsibilities including but not limited to the following:Providing technical support on-site and over-phone to customers regarding Operating Systems (Windows), Network and Internet links, Service Usage and related issues.Maintain documentation of Network links, New Users, task details, equipment/ accessory details etc.Educational RequirementsBachelor in Engineering (BEngg)Bachelor of Computer Application (BCA)Bachelor of Science (BSc) in Computer Science & EngineeringDiploma in Computer in Computing & Information SystemSkills Required: IT Troubleshooting, Internet Browsing, Computer Networks, Live Chat, Fast typing skill, IT Support Service and Network engineering., Customer Support through PhoneEmail, Configuring WiFi router, working in night shift, WIFI connectivityExperience RequirementsAt most 2 year(s)The applicants should have experience in the following business area(s): ISP,Computer Hardware/Network CompaniesFreshers are also encouraged to apply.Job LocationChattogram, Cox`s BazarSalaryTk. 12000 - 12500 (Monthly) Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369345084/",
    "job_id": "4369345084",
    "source": "linkedin",
    "company_name": "GL events",
    "job_title": "Business Analyst",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367882647/",
    "job_id": "4367882647",
    "source": "linkedin",
    "company_name": "Persian Horizon",
    "job_title": "Business Analyst",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Persian Horizon is hiring a Business Analyst to support our business acquisition and investment platform.This role focuses on financial analysis, risk assessment, and commercial logic. Your work determines whether a business opportunity is approved for investor presentation or declined.This is not a sales or client-facing role. It is a decision-making role based on data and structured analysis.Role OverviewYou sit at a critical point in the deal pipeline, reviewing qualified business opportunities and evaluating their financial strength, risk profile, and investment logic.Your analysis directly influences which businesses move forward to investors.Key ResponsibilitiesAnalyze SME businesses across multiple sectors, focusing on:Revenue, profit, and margin structureCost and cash-flow logicROI and payback expectationsConduct structured risk assessments, including:Business model sustainabilityOperational and owner dependencyFinancial transparency and data qualityReview market positioning and competitive contextPerform pricing and valuation sanity checksApprove or reject businesses based on defined investment criteriaPrepare clear, structured analysis summaries for internal teamsRequirementsBackground in finance, consulting, business analysis, or investment analysisStrong proficiency in Excel / Google SheetsExperience working with SMEs, acquisitions, or investment evaluationsAnalytical mindset with strong attention to detailAbility to work with imperfect data and still form logical conclusionsFluent English (Arabic is a plus)Why Join Persian HorizonExposure to real acquisition and investment opportunitiesClear mandate and decision authority within the deal pipelineStructured environment with defined evaluation standardsGrowth potential within an expanding investment platform Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365926360/",
    "job_id": "4365926360",
    "source": "linkedin",
    "company_name": "Viettel Software Career",
    "job_title": "Kỹ sư giải pháp nghiệp vụ (Business Analyst - Từ 02 năm kinh nghiệm)",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4332546199/",
    "job_id": "4332546199",
    "source": "linkedin",
    "company_name": "TOM",
    "job_title": "Platform Asistanı",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357431092/",
    "job_id": "4357431092",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Branch Lead (For Akij Resources) - Job ID - 1455281",
    "location": "Mirpur, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358061310/",
    "job_id": "4358061310",
    "source": "linkedin",
    "company_name": "4FRONT",
    "job_title": "Senior Accountant",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369324768/",
    "job_id": "4369324768",
    "source": "linkedin",
    "company_name": "Adecco",
    "job_title": "Senior Accountant",
    "location": "WP. Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4062260313/",
    "job_id": "4062260313",
    "source": "linkedin",
    "company_name": "Finance & Grants Officer",
    "job_title": "RTI International",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4020326626/",
    "job_id": "4020326626",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Finance & Operations Manager (Bangladesh)",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4249585324/",
    "job_id": "4249585324",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "HSBC hiring Transaction Services Analyst, Global Trade ...",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4277368015/",
    "job_id": "4277368015",
    "source": "linkedin",
    "company_name": "For RDRS Bangladesh (Job ...",
    "job_title": "Senior Officer (Internal Audit)",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4312261176/",
    "job_id": "4312261176",
    "source": "linkedin",
    "company_name": "Internal Audit (For RFL Group)",
    "job_title": "Trainee Executive",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357422816/",
    "job_id": "4357422816",
    "source": "linkedin",
    "company_name": "ITDS",
    "job_title": "Payroll Specialist",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/239107/",
    "job_id": "239107",
    "source": "linkedin",
    "company_name": "NHS Scotland",
    "job_title": "239107 Project Assistant",
    "location": "Colombo District, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4356042438/",
    "job_id": "4356042438",
    "source": "linkedin",
    "company_name": "Leaf Global Environmental Services",
    "job_title": "Administrative Assistant",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369778001/",
    "job_id": "4369778001",
    "source": "linkedin",
    "company_name": "Evolute - Executive Search",
    "job_title": "Global Payroll Specialist",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370382019/",
    "job_id": "4370382019",
    "source": "linkedin",
    "company_name": "INVEL educación por tu futuro",
    "job_title": "People & Culture Assistant",
    "location": "Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "🗂 We’re Hiring: People & Culture Assistant🕒 Employment Type: Full-Time 💼 Level: Entry-Level / Mid-LevelWe’re looking for an organized, compassionate, and proactive People & Culture Assistant to join our growing team. In this role, you will play a crucial part in supporting the daily operations of our HR and People & Culture functions. You will help with recruitment, employee engagement, training initiatives, and ensure a positive workplace culture. If you have a passion for people, organization, and fostering a great work environment, we’d love to meet you!🎯 Key Responsibilities:Assist with recruitment and onboarding processes, including posting job ads, screening resumes, and scheduling interviews.Support the coordination of employee training and development programs.Help manage employee records and maintain HR databases.Assist in organizing company events, team-building activities, and wellness programs.Help implement employee engagement initiatives and collect feedback to improve company culture.Provide administrative support to the People & Culture team, including managing calendars and preparing reports.Assist with payroll, benefits administration, and employee queries.Coordinate and communicate with internal teams to ensure smooth operations across the company.Help maintain a positive and inclusive work environment, advocating for employee well-being.✅ Requirements:Strong interest in Human Resources, People & Culture, and organizational development.Excellent communication and interpersonal skills.Ability to handle sensitive information with confidentiality and professionalism.Detail-oriented with strong organizational skills and the ability to manage multiple tasks simultaneously.A proactive and adaptable mindset, with the ability to work independently and as part of a team.Experience in administrative roles or HR-related fields is a plus but not required.A degree or certification in Human Resources, Business Administration, or a related field is a plus.Proficiency in MS Office (Word, Excel, PowerPoint), and knowledge of HR software is a plus.🌟 What We Offer:A collaborative and dynamic work environment.Opportunities for career growth and professional development within HR and People & Culture.Hands-on experience in a wide variety of HR functions.A supportive team culture that values creativity, inclusivity, and innovation.Competitive compensation and benefits package.Training and mentorship to help you grow in your HR career. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366743111/",
    "job_id": "4366743111",
    "source": "linkedin",
    "company_name": "Orifarm",
    "job_title": "Junior Accounts Payable Associate Accountant",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "About The JobThe overall job objective for an Accounts Payable Junior Associate is to assist the Accounts Payable team on daily operations within Accounts Payable. Main Tasks: Assist the Accounts Payable team on perform daily operations – including: Process invoices and review for accuracy Create and Maintain vendor files Create and maintain master data in the ERP system Assist on preparations for month/year-end closing activities related to accounts payable Assist with internal and external audit processes Assist in reviewing reports on costs, pending approvals and failed payments Assist in reconciling discrepancies and resolving issues Who are you? You are a student within accounting, financial operation or similar areas. Any relevant experience in accounting and finance operations is beneficial. Professional competences: Attention to Detail : Focus on accuracy and precision when entering financial data, reconciling accounts, and managing financial information, f.e. master data. Time Management : Ability to manage multiple tasks and prioritize effectively in a fast-paced environment, ensuring timely payment processing. Basic Accounting Knowledge : Understanding of fundamental accounting principles and practices to ensure accurate handling of financial transactions. Communication : Effective written and verbal communication skills to interact with both internal teams and external vendors to resolve discrepancies, and address inquiries professionally and promptly. Compliance : Knowledge of relevant regulations, policies, and procedures related to accounts payable to ensure compliance with legal and company standards. Numerical Proficiency : Numerical aptitude for accurate calculations, reconciliations, and financial analyses. Personal competences: Collaboration: Skills in collaborating with internal teams, such as purchasing and other finance teams, to resolve issues and streamline processes. Adaptability: Flexibility to adapt to changing requirements, systems, and procedures within the accounts payable environment. Team Player: Ability to work collaboratively within a team environment to achieve shared goals and support the overall financial well-being of the organization. Reliability: Consistently meeting commitments and deadlines, helping build trust among colleagues and contributing to the overall functioning of the team and organization. Problem Solver: Showing an aptitude for identifying issues and proactively seeking solutions to ensure smooth invoice processing and payment. Initiative: Taking proactive steps to improve processes, streamline workflows, and contribute to the continuous enhancement of the accounts payable team. Continuous Improvement: Willingness to contribute to process improvement initiatives that enhance efficiency, accuracy, and overall effectiveness of the accounts payable team. What we offer: Fulltime employment contract Life insurance Private medical care Sports card PPK Hybrid work model Flexible working hours Job Location Warsaw, Poland. Hybrid work model – 3x/week from the office located in the prestigious Gdański Business Center at Inflancka 4. Application deadline ASAP Why should you work for Orifarm? At Orifarm, we know that our growth comes from the development of our employees. We are an ambitious organization with an entrepreneurial culture celebrating can-do attitudes, smarts, and hearts. Our secret to success? Valuing how different skill sets join forces to make our journey happen.You will experience a work environment characterized by flexibility and a strong commitment to work-life balance, understanding that the best results come from satisfied and well-supported employees. Our international setting offers great opportunities for growth and career advancement. We also prioritize social events and gatherings to ensure that our employees feel connected and engaged with each other.We regard our feedback culture as a fundamental element in the individual employee's opportunities for learning and development. When we have good results, every employee, including student workers, is part of our bonus scheme.About OrifarmEveryone should have access to modern medicine. High costs or lack of access to pharmaceuticals should never impact our possibility to receive treatment or relief and live a healthy life. At Orifarm, we aim to bring healthy days by making modern healthcare a better deal for the people and the societies we serve. Working towards our vision, we create access to affordable, high-quality pharmaceuticals and healthcare products by challenging markets and always seeking new opportunities. With our core values paving the way, we always act responsibly and constantly with our customers at the center of our attention. And everything we do is driven by our sole purpose: For as many as possible, as healthy a day as possible. Our history goes back to 1994 when Orifarm was founded in Denmark by Hans and Birgitte Bøgh-Sørensen. Since then, Orifarm has grown from a small",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360911732/",
    "job_id": "4360911732",
    "source": "linkedin",
    "company_name": "Chinese Dragon Cafe",
    "job_title": "Account Executive",
    "location": "Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "ABOUT THE ROLE: Chinese Dragon Cafe (PVT) LTD, a leading name in authentic Chinese cuisine and hospitality, is looking for a dedicated and detail-oriented Accounts Executive to join our finance team. With a strong commitment to quality and customer satisfaction, we strive to maintain excellence in all facets of our operations.KEY RESPONSIBILITIES:Manage day-to-day financial transactions and entries, including accounts payable and receivable. Prepare and maintain accurate financial records, ledgers, and reports. Reconcile bank statements and ensure all financial transactions are properly recorded. Assist in budget preparation and financial forecasting. Handle payroll processing and ensure compliance with taxation regulations.Support audits and ensure adherence to internal controls and financial procedures. Collaborate with the finance team to streamline processes and improve efficiency.REQUIREMENTS: ﻿Solid understanding of accounting principles and practices. Proficiency in accounting software and MS Office (especially Excel). Excellent organizational and time-management skills. Strong attention to detail and accuracy. Ability to prioritize tasks and work under pressure. Professional certification is a plus.What We Offer: Competitive salary and performance incentives. Career growth opportunities. A dynamic and supportive work environment. Training and development programs. Please send your updated CV to careers@chinesedragoncafe.com with the subject line “Accounts Executive”CALL 077 056 6786 Whats App 077 056 6786 Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4321546909/",
    "job_id": "4321546909",
    "source": "linkedin",
    "company_name": "Cantor Fitzgerald",
    "job_title": "Credit Risk Analyst",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346350899/",
    "job_id": "4346350899",
    "source": "linkedin",
    "company_name": "Egis",
    "job_title": "Document Controller - Saudi National",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369459367/",
    "job_id": "4369459367",
    "source": "linkedin",
    "company_name": "Omrania",
    "job_title": "Document Controller",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4363655145/",
    "job_id": "4363655145",
    "source": "linkedin",
    "company_name": "Sinclair",
    "job_title": "Financial Controller - APAC",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "This role can either be based in Singapore or Taiwan with occasional need to travel across the region.Sinclair is Hiring! Join Our Team as a APAC Financial Controller 🚀We are currently recruiting a Financial Controller for our APAC Region. The APAC Financial Controller position is a key role in finance but also the surrounding business. As Financial Controller, the responsibilities include overseeing end-to end finance operations, financial planning and analysis, balance sheet reconciliations, looking to make improvements to procedures and controls, as well as ad-hoc projects as and when they come up.This role also acts as a strategic business partner to regional leadership and commercial teams, providing financial insights to support decision-making and drive business performance. Medical aesthetics industry experience is required for this role.What You'll Be Doing:Planning & AnalysisPartner with commercial, operations, and leadership teams to provide actionable financial insights and support strategic initiatives.Preparation of Budget/ 5 year plans/ ForecastsSupport management in setting quantitative objectsCreate and implement reports to follow sales performance per distribution channel, per sku etcAnalyse and optimise the cost structure of the entityOn a monthly basis report Actual vs Budget/Forecast/Previous Year in P&LExplain and justify variancesIn charge of business data analysis and ensure that all Ops reports are delivered in a timely and accurate way Financial reporting and controlWork with Corporate finance to ensure financials, including income statement and balance sheets are accurately recorded at Corporate levelEnsure that Group procedures are followed within the management entityEnsure compliance with Group purchasing policy and approval of purchase ordersSupport corporate in reviewing compliance with local expense claimsMaintenance of general ledger on company accounting system, SysproPreparation for and participation in half year and annual business meetings Supply Chain and local warehouse managementAccurate, pro-active and timely stock forecasts and management of stockExplain and justify stock-variances between Logistics and ERP SystemContact point for Corporate Supply ChainManagement of all local warehouse related operating procedures SystemsSupport with the maintenance and financial updates of CRM systemManaging price lists in CRMCRM data managementActive participation in national sales meetings TreasuryEnsure cash flow is managed with Group parameters including the maintenance of a cashflow forecastSupport Group with maintenance of company bank accounts in FranceMonitor overdue accounts and liaise with sales team to recover outstanding amountsManager the transfer of overdue accounts to third party debt collector as appropriateManage AMEX payments and communication to CSP/Group on payments received Local compliance Liaise with local tax advisor and corporate finance to complete corporation tax and sales tax submissions on timeMonthly VAT returnsEnsure correct calculation and timely payments of instalment paymentsSupport group audit queries.Your skills and experienceEssential:Medical Aesthetics Industry experienceDegree in Accounting, Finance, or related discipline.Fully qualified accountant: ACCA / ACA / CIMA / CPA / CA (or local equivalent). Typically 8–12+ years progressive finance experience with multi-entity responsibility.Proven experience covering at least 5+ APAC jurisdictions (ideally including Singapore + North Asia)Demonstrated ability to act as a business partner, influencing decisions through financial insight and analysis.Strong analytical skillsExperience in working with high volumes of data from multiple sourcesOwnership of month-end close and delivery of accurate, on-time reporting.Solid IFRS (and/or US GAAP) foundation with strong technical judgement.Strong statutory and audit track record (planning, coordination, resolution).Demonstrated budget/forecast ownership and sharp variance analysis.Comfortable managing intercompany, FX exposure, and cross-border complexity.Strong English communication (written + verbal) and ability to present to senior stakeholders.Hands-on systems competency in at least one major ERP; able to improve processes, not just “run them”.Desirable:Familiarity with Singapore statutory/audit practices, and practical knowledge of North Asia compliance expectations (Taiwan / Korea).Experience in complex consolidation environments (multiple currencies, acquisitions, shared servicesBackground in aesthetics industry with inventory, revenue recognition, rebates/chargebacks, distributor models, etc. (as relevant).Language & cultural capabilityMandarin is a plus, especially if partnering with local leadership teams.Ability to work across time zones; willingness to travel occasionally within APAC.What We're Looking For:Role competencies:Business partnering and stakeholder engagement skillsAccounting SkillsIT skillsBusiness skillsProblem solvingChange Managem",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370011795/",
    "job_id": "4370011795",
    "source": "linkedin",
    "company_name": "Fits Cargo",
    "job_title": "Senior Finance Executive",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/20004847/",
    "job_id": "20004847",
    "source": "linkedin",
    "company_name": "Qiddiya | القدية",
    "job_title": "Senior Director - Cost Reporting & Controls - 20004847. CDU3",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4270425054/",
    "job_id": "4270425054",
    "source": "linkedin",
    "company_name": "Egis",
    "job_title": "QA/QC Coordinator",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/20005093/",
    "job_id": "20005093",
    "source": "linkedin",
    "company_name": "Qiddiya | القدية",
    "job_title": "Director - Public Realm Projects (MAS6-20005093)",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361045295/",
    "job_id": "4361045295",
    "source": "linkedin",
    "company_name": "Robert Half",
    "job_title": "Head of Internal Audit (Oil & Gas / Engineering)",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368020104/",
    "job_id": "4368020104",
    "source": "linkedin",
    "company_name": "Decryptogen",
    "job_title": "Senior Salesforce Platform / Apex Developer",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366455065/",
    "job_id": "4366455065",
    "source": "linkedin",
    "company_name": "OCTAVE - John Keells Group",
    "job_title": "Intern - AI Engineering (Full-Stack)",
    "location": "Colombo, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4342712143/",
    "job_id": "4342712143",
    "source": "linkedin",
    "company_name": "TAWANTECH",
    "job_title": "Production Support Expert - SAS Risk Management System",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are seeking a Production Support Expert with strong expertise in SAS Risk Management Systems to ensure the stability, availability, and performance of mission-critical risk and regulatory applications. The candidate will be responsible for resolving incidents, monitoring batch jobs, supporting business users, and working closely with IT and risk teams to meet operational SLAs. Key Responsibilities: Provide L2/L3 production support for SAS Risk Management solutions, including batch processing and report generation Monitor and troubleshoot SAS Grid jobs, ETL pipelines, and database interactions Diagnose and resolve issues related to data ingestion, model execution, and regulatory report generation Analyze and interpret SAS logs, Grid logs, and database logs to identify root causes of failures Support regulatory reporting processes such as Basel III/IV, IFRS 9, CECL, ICAAP, etc. Assist in code deployments, patching, and environment migrations (DEV/TEST/PROD) Maintain system health and job schedules using Control-M, Autosys, or cron Collaborate with risk modelers, compliance teams, and IT infrastructure to resolve production issues Create and maintain documentation including runbooks, SOPs, RCA reports, and support guides Ensure adherence to ITIL processes for incident, change, and problem managementRequirementsRequired Skills & Qualifications:Technical: 5+ years experience with SAS tools: Base SAS, SAS Grid, SAS EG, SAS DI Studio Strong Unix/Linux skills and experience with shell scripting (bash/ksh) Proficient in SQL and Oracle or similar RDBMS Experience with job schedulers like Control-M, Autosys, or UC4 Familiarity with risk data models (PD, LGD, EAD, RWA) and regulatory reporting requirements Ability to read and debug SAS logs and troubleshoot data/model issues Functional: Experience supporting SAS solutions for credit, market, or operational risk Understanding of regulatory compliance frameworks (Basel II/III/IV, IFRS 9, CECL, etc.) Knowledge of model lifecycle management and production validation processes Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4351020883/",
    "job_id": "4351020883",
    "source": "linkedin",
    "company_name": "For A Leading Group of Company ...",
    "job_title": "Officer (HR & Payroll)",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4259306681/",
    "job_id": "4259306681",
    "source": "linkedin",
    "company_name": "(For SAIC GROUP)-Job ID ...",
    "job_title": "Accounts (Dhaka & Rangpur)",
    "location": "Rangpur, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4293183490/",
    "job_id": "4293183490",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Accounts Executive (For Grameen Kalyan)-Job ID: 1402283",
    "location": "Rangpur, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4069387031/",
    "job_id": "4069387031",
    "source": "linkedin",
    "company_name": "SEED Project",
    "job_title": "Accounts Officer",
    "location": "Rangpur, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4161135969/",
    "job_id": "4161135969",
    "source": "linkedin",
    "company_name": "Noor Staffing Group",
    "job_title": "Accounts Receivable Specialist",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4086082431/",
    "job_id": "4086082431",
    "source": "linkedin",
    "company_name": "For VIP Shahadat Group ...",
    "job_title": "Officer (Accounts & Inventory)",
    "location": "Rangpur, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3294470709/",
    "job_id": "3294470709",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Rahman Mostafa Alam & Co. (Chartered Accountants)",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4178726921/",
    "job_id": "4178726921",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "For Uttara Sweater Manufacturing Company Ltd- Job ID : ...",
    "location": "Rangpur, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4221172219/",
    "job_id": "4221172219",
    "source": "linkedin",
    "company_name": "Job ID",
    "job_title": "Treasury Mid Office (Officer-EO)- For Bank Asia PLC",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370119671/",
    "job_id": "4370119671",
    "source": "linkedin",
    "company_name": "DULCEDO Management",
    "job_title": "Chief Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4359889924/",
    "job_id": "4359889924",
    "source": "linkedin",
    "company_name": "Safa International LLC",
    "job_title": "Senior Accountant",
    "location": "Nairobi County, Kenya",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352198310/",
    "job_id": "4352198310",
    "source": "linkedin",
    "company_name": "Chargeurs PCC Fashion Technologies",
    "job_title": "Chief Accountant",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367303875/",
    "job_id": "4367303875",
    "source": "linkedin",
    "company_name": "Choice Talents LTD",
    "job_title": "Accountant",
    "location": "Lagos, Lagos State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352642962/",
    "job_id": "4352642962",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Finance Manager (For A Leading Group of Company) - Job ID : 1447608",
    "location": "Mirpur, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369320551/",
    "job_id": "4369320551",
    "source": "linkedin",
    "company_name": "MAY FOUNTAIN GROUP | Managing Back Office Operations",
    "job_title": "Service Quality Manager (Accounting & Compliance)",
    "location": "Ho Chi Minh City, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4362746966/",
    "job_id": "4362746966",
    "source": "linkedin",
    "company_name": "ABM Accounting & Bookkeeping",
    "job_title": "Staff Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368050421/",
    "job_id": "4368050421",
    "source": "linkedin",
    "company_name": "Vaultie",
    "job_title": "Account Executive, Full Cycle",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4360603618/",
    "job_id": "4360603618",
    "source": "linkedin",
    "company_name": "IFF",
    "job_title": "Account Manager II",
    "location": "Lagos, Lagos State, Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366861676/",
    "job_id": "4366861676",
    "source": "linkedin",
    "company_name": "Vaco by Highspring",
    "job_title": "Senior Fund Accountant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352396457/",
    "job_id": "4352396457",
    "source": "linkedin",
    "company_name": "MyPetroCareer.com",
    "job_title": "Senior Treasury Analyst – Back Office | Ably Resources LTD",
    "location": "Qatar",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369623672/",
    "job_id": "4369623672",
    "source": "linkedin",
    "company_name": "MADKOUR",
    "job_title": "Treasury Manager",
    "location": "Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367204842/",
    "job_id": "4367204842",
    "source": "linkedin",
    "company_name": "Paynamics Technologies Inc.",
    "job_title": "Treasury Liquidity Manager",
    "location": "Makati, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368327311/",
    "job_id": "4368327311",
    "source": "linkedin",
    "company_name": "Mogi I/O : OTT/Podcast/Short Video Apps for you",
    "job_title": "Finance Manager (Sr. Accountant)",
    "location": "Metro Manila",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4369539604/",
    "job_id": "4369539604",
    "source": "linkedin",
    "company_name": "Talent Portus",
    "job_title": "SAP Payroll Consultant",
    "location": "Toronto, Ontario, Canada",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/2025207518/",
    "job_id": "2025207518",
    "source": "linkedin",
    "company_name": "WNS",
    "job_title": "Senior Group Manager - Operations - REF88841X_2025207518 - Insurance",
    "location": "Quezon City, National Capital Region, Philippines",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357152071/",
    "job_id": "4357152071",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Director of Finance (For Radisson Blu Dhaka Water Garden) - Job ID : 1455490",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365043524/",
    "job_id": "4365043524",
    "source": "linkedin",
    "company_name": "ADIB - Abu Dhabi Islamic Bank",
    "job_title": "Cluster Manager",
    "location": "Abu Dhabi, Abu Dhabi Emirate, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4358990980/",
    "job_id": "4358990980",
    "source": "linkedin",
    "company_name": "Achyutam International - Consulting in HR & Finance",
    "job_title": "Financial Controller - Nigeria - Local",
    "location": "Nigeria",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367764287/",
    "job_id": "4367764287",
    "source": "linkedin",
    "company_name": "Allianz Egypt",
    "job_title": "Area Supervisor - Bancassurance",
    "location": "Cairo, Egypt",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355410800/",
    "job_id": "4355410800",
    "source": "linkedin",
    "company_name": "Bdjobs.com",
    "job_title": "Senior Executive / Executive - Admin (For ZXY International) - Job ID : 1452742",
    "location": "Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370153302/",
    "job_id": "4370153302",
    "source": "linkedin",
    "company_name": "Step4progress Bangladesh",
    "job_title": "Compliance Officer_ Education Consultancy",
    "location": "Badda Thana, Dhaka, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4308038515/",
    "job_id": "4308038515",
    "source": "linkedin",
    "company_name": "Egis",
    "job_title": "Risk Manager (Qatari National)",
    "location": "Doha Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/05/",
    "job_id": "05",
    "source": "linkedin",
    "company_name": "TDT Asia",
    "job_title": "05 Business Analyst (English)",
    "location": "Hanoi Capital Region",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4331523167/",
    "job_id": "4331523167",
    "source": "linkedin",
    "company_name": "fzlPLUS",
    "job_title": "Finans Yöneticisi",
    "location": "Beşiktaş, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357487058/",
    "job_id": "4357487058",
    "source": "linkedin",
    "company_name": "Venture Search",
    "job_title": "Analyst/Associate/Snr Associate - Private Equity (Healthcare)",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4326438500/",
    "job_id": "4326438500",
    "source": "linkedin",
    "company_name": "Xiaomi Technology",
    "job_title": "Channel Finance Business Partner, Malaysia(A155358)",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4326378971/",
    "job_id": "4326378971",
    "source": "linkedin",
    "company_name": "Xiaomi Technology",
    "job_title": "Channel Finance Business Partner, Malaysia(A155358)",
    "location": "Greater Kuala Lumpur",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368216148/",
    "job_id": "4368216148",
    "source": "linkedin",
    "company_name": "Kelly",
    "job_title": "Content Administrator",
    "location": "Bryanston, Gauteng, South Africa",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4368620993/",
    "job_id": "4368620993",
    "source": "linkedin",
    "company_name": "Kopaş Kozmetik",
    "job_title": "Yönetici Asistanı (C-Level)",
    "location": "Sarıyer, Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361426388/",
    "job_id": "4361426388",
    "source": "linkedin",
    "company_name": "Charismatic Dental Laboratory",
    "job_title": "Senior Accountant",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Company Description:Charismatic Dental Laboratory is a globally recognized leader in merging advanced dental technology with artistic craftsmanship. Based on innovative techniques, we deliver cutting-edge solutions in dentistry. With a relentless commitment to quality and precision, we pride ourselves on redefining dental excellence and enhancing the work of dentists worldwide. Role Description:We are looking for a Senior Accountant to join our growing team. The ideal candidate will have strong hands-on experience in costing, accounts payable, and expense management, with the ability to work independently and support month-end and financial reporting activities.Key Responsibilities:Manage product/service costing, cost analysis, and margin reportingHandle Accounts Payable: vendor invoices, reconciliations, and payment processingReview, control, and reconcile employee and operational expensesPrepare monthly journal entries, accruals, and account reconciliationsSupport month-end and year-end closingEnsure compliance with company policies and accounting standardsAssist in budgeting, forecasting, and variance analysisCoordinate with internal departments and external auditors when requiredQualifications: Bachelor’s degree in Accounting, Finance, or related fieldMinimum 5 years of experience in a similar Senior Accountant roleStrong experience in costing, payables, and expense control (mandatory)Proficient in accounting software and MS ExcelExperienced in Odoo is a plusHigh attention to detail and strong analytical skillsAbility to work under pressure and meet deadlinesExperience in UAE / GCC is a plusWhat we offer?Competitive salaryProfessional working environmentGrowth and development opportunities Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4284440442/",
    "job_id": "4284440442",
    "source": "linkedin",
    "company_name": "Dohme Taj Mahal Media Norge",
    "job_title": "Luxury Real Estate Head of Quality Engineering",
    "location": "Dubai, Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361491048/",
    "job_id": "4361491048",
    "source": "linkedin",
    "company_name": "Berg Development Group",
    "job_title": "Project Manager - Luxury Residential Fit Out",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Site-Based Project Manager – Luxury Residential Villas📍 Dubai, UAE🏢 Berg Development GroupBerg Development Group is a forward-thinking luxury property developer delivering groundbreaking ultra-prime residential villas across Dubai. Our projects combine cutting-edge architecture, exceptional craftsmanship, and world-class interior fit-out to create truly iconic living environments.As we continue to expand our portfolio — including our signature Four Elements development — we are seeking an experienced Site-Based Project Manager to lead the delivery of high-end luxury residential villa projects from construction through to premium fit-out and handover.This is a hands-on leadership role for a driven professional who understands the precision, detail, and coordination required to execute ultra-luxury projects at the highest level.⸻Key Responsibilities • Manage day-to-day site operations across luxury residential villa projects. • Lead and coordinate contractors, subcontractors, consultants, and specialist suppliers. • Oversee construction, architectural detailing, and high-end interior fit-out works. • Ensure design intent and luxury quality standards are maintained throughout delivery. • Monitor project programme, cost control, and risk management. • Interface closely with architects, designers, and procurement teams. • Drive quality assurance, safety compliance, and technical coordination on site. • Deliver projects through to snagging, commissioning, and successful handover.⸻Required Experience & Qualifications • Proven experience as a Project Manager delivering luxury residential villas • Strong background in premium interior fit-out and bespoke finishes. • 5 years of experience working in a similar role within the UAE (essential) • Experience of working in a similar role within the European luxury sector (Advantageous) • Deep understanding of luxury construction standards, detailing, and execution. • Demonstrated ability in managing high-end subcontractors and specialist trades. • Strong leadership, communication, and problem-solving skills. • Ability to operate confidently in fast-paced, design-led environments. • Degree in Construction Management, Architecture, Engineering, or related field preferred.⸻What We Offer • Opportunity to work on landmark ultra-luxury residential projects. • Collaborative environment alongside leading international architects and designers. • A role within a developer focused on innovation, craftsmanship, and design excellence. • Competitive package aligned with experience.⸻How to ApplyIf you have the experience, attention to detail, and passion required to deliver exceptional luxury residences, we would love to hear from you, CV, and cover letter applications to info@bergdevelopment.group Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355306221/",
    "job_id": "4355306221",
    "source": "linkedin",
    "company_name": "PwC South Africa",
    "job_title": "SATIC - Business Analyst",
    "location": "Johannesburg Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357594211/",
    "job_id": "4357594211",
    "source": "linkedin",
    "company_name": "CMC Global Company Limited.",
    "job_title": "[HN] Hiring Business Data Analyst/ Data Analyst >2 years experience",
    "location": "Hanoi, Hanoi, Vietnam",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4352207931/",
    "job_id": "4352207931",
    "source": "linkedin",
    "company_name": "Maroteknoloji",
    "job_title": "İş Analisti",
    "location": "Istanbul, Türkiye",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4361742602/",
    "job_id": "4361742602",
    "source": "linkedin",
    "company_name": "Bukhash Brothers",
    "job_title": "Talent & Admin Assistant",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "We are looking for an organised and reliable Talent & Admin Assistant to manage day-to-day recruitment coordination and related documentation. This role focuses on execution and follow-through across hiring, onboarding, employee records, and visa and insurance coordination, working closely with hiring managers and external PRO partners.This is a hands-on role suited to someone who is detail-oriented, structured, and comfortable handling confidential information.Core ResponsibilitiesRecruitment CoordinationCoordinate interview scheduling, candidate communication, and feedback collectionSupport job postings, CV screening, and shortlisting based on defined criteriaMaintain recruitment trackers and hiring status updatesPrepare offer documentation once approvedOnboarding & Employee Lifecycle SupportCoordinate onboarding logistics: contracts, documentation, system access, inductionsEnsure probation timelines, confirmations, and documentation are trackedMaintain accurate employee records and personnel filesSupport exit processes and documentation coordinationPRO & Legal CoordinationLiaise with PRO for visas, labour cards, Emirates IDs, renewals, and cancellationsTrack visa timelines, trade license dependencies, and required documentsCoordinate approvals and paperwork, escalating risks or delays promptlyMaintain compliance trackers (visas, IDs, labour records)HR Operations SupportSupport payroll inputs, leave records, and attendance data coordinationAssist with audits, reporting, and documentation when requiredEnsure confidentiality and data accuracy at all timesWhat You’ll NeedPrevious experience in recruitment coordination, office coordination, or similar rolesBasic knowledge of UAE visa and labour processesStrong organisational skills and attention to detailGood communication skills in EnglishComfortable handling confidential documentsAble to manage multiple tasks and follow throughYou’ll Love This Job If You’reOrganised and detail-drivenComfortable working with processes and checklistsReliable and consistentCalm when managing documents and deadlinesInterested in growing within recruitment and people operationsWhat’s In It for You?Bukhash Brothers offers diverse career paths and opportunities to grow within the company. We provide a competitive benefits package including comprehensive medical insurance, personal development opportunities, team lunches, and team-building activities.We value work-life balance and offer an annual travel allowance. You’ll gain hands-on experience through exposure to different challenges within your role, with the opportunity to grow both personally and professionally. Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357431685/",
    "job_id": "4357431685",
    "source": "linkedin",
    "company_name": "Ejadah",
    "job_title": "Governance and Compliance Analyst",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4367860346/",
    "job_id": "4367860346",
    "source": "linkedin",
    "company_name": "KASCO Developments",
    "job_title": "General Accountant - Construction",
    "location": "Dubai, United Arab Emirates",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "Accounting & FinanceMaintain books of accounts, including GL, AP, AR, bank, and cash transactionsPrepare monthly, quarterly, and annual financial statementsReconcile bank statements, supplier statements, and intercompany accountsEnsure proper accounting entries for accruals, prepayments, and provisionsConstruction / Project AccountingMonitor project costs, budgets, and variationsRecord project-related expenses, WIP, and revenue recognitionTrack subcontractor invoices, retention, advances, and certificationsCoordinate with project and procurement teams on cost allocationAccounts Payable & ReceivableVerify supplier invoices against LPOs, contracts, and delivery notesProcess subcontractor and supplier payments as per approval matrixFollow up on receivables and maintain customer aging reportsVAT & Compliance (UAE)Prepare and file VAT returns in compliance with FTA regulationsReview VAT treatment on invoices (standard, zero-rated, exempt, RCM)Maintain proper VAT documentation and support auditsRequirements & QualificationsBachelor’s degree in Accounting, Finance, or related field3–5 years of accounting experience, preferably in a construction companyStrong knowledge of construction accounting and project costingSound understanding of UAE VAT lawsExperience with accounting/ERP systems (e.g., Xpedeon, SAP, Tally, Oracle)Proficient in MS ExcelStrong analytical, organizational, and communication skillsPreferred SkillsExperience in handling multiple projects simultaneouslyAbility to work under tight deadlinesAttention to detail and accuracy Show more Show less",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4055922969/",
    "job_id": "4055922969",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Accounts and Finance Officer (For Proyas Manobik ...",
    "location": "Rajshahi, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4330237901/",
    "job_id": "4330237901",
    "source": "linkedin",
    "company_name": "A. Qasem & Co. Chartered Accountants",
    "job_title": "Audit Associate",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4370079243/",
    "job_id": "4370079243",
    "source": "linkedin",
    "company_name": "ART Magazine",
    "job_title": "Confidential Secretary to Managing Director",
    "location": "Colombo District, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4284045801/",
    "job_id": "4284045801",
    "source": "linkedin",
    "company_name": "Rentokil Initial",
    "job_title": "Administration Executive (Colombo)",
    "location": "Peliyagoda, Western Province, Sri Lanka",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4366448078/",
    "job_id": "4366448078",
    "source": "linkedin",
    "company_name": "Jenga Business Consulting Group",
    "job_title": "Accountant",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4355002605/",
    "job_id": "4355002605",
    "source": "linkedin",
    "company_name": "Achieve Group",
    "job_title": "Treasury Analyst (Agriculture / MNC)",
    "location": "Singapore, Singapore",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4364681167/",
    "job_id": "4364681167",
    "source": "linkedin",
    "company_name": "Bruker",
    "job_title": "Senior Financial Analyst (m/f/d)",
    "location": "Warsaw, Mazowieckie, Poland",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4365305757/",
    "job_id": "4365305757",
    "source": "linkedin",
    "company_name": "Egis",
    "job_title": "Document Controller",
    "location": "Kuwait City, Al Asimah, Kuwait",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4346760756/",
    "job_id": "4346760756",
    "source": "linkedin",
    "company_name": "Egis",
    "job_title": "Senior Cost Controller",
    "location": "Riyadh, Riyadh, Saudi Arabia",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4357423779/",
    "job_id": "4357423779",
    "source": "linkedin",
    "company_name": "RED Global",
    "job_title": "SAP Technical Lead",
    "location": "Warsaw Metropolitan Area",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4060660953/",
    "job_id": "4060660953",
    "source": "linkedin",
    "company_name": "HR, Admin & Compliance (For ...",
    "job_title": "Assistant/Deputy Manager",
    "location": "Rangpur, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4094442680/",
    "job_id": "4094442680",
    "source": "linkedin",
    "company_name": "For Rangpur Dairy and Food Products ...",
    "job_title": "Junior Officer-Finance",
    "location": "Rangpur, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4030005770/",
    "job_id": "4030005770",
    "source": "linkedin",
    "company_name": "For Tally Weijl ...",
    "job_title": "Junior Accountant (Account Receivable)",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4022679292/",
    "job_id": "4022679292",
    "source": "linkedin",
    "company_name": "Unknown Company",
    "job_title": "Junior Officer-Finance (For Rangpur Dairy and Food ...",
    "location": "Rangpur, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4290377394/",
    "job_id": "4290377394",
    "source": "linkedin",
    "company_name": "Finance (For A Leading Group of Companies ...",
    "job_title": "Treasury Officer",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/4260393696/",
    "job_id": "4260393696",
    "source": "linkedin",
    "company_name": "For O`Dell Group",
    "job_title": "Officer (Accounts & Finance)",
    "location": "Rangpur, Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/3899097941/",
    "job_id": "3899097941",
    "source": "linkedin",
    "company_name": "LR Global Bangladesh নিয়োগ",
    "job_title": "Investment Analyst",
    "location": "Bangladesh",
    "employment_type": "Full-time",
    "date_posted": "",
    "job_description": "",
    "extraction_method": "html-scraping"
  }
]