[
  {
    "url": "https://bdjobs.com/h/details/1455293?ln=1",
    "company_name": "Toha Metal Engineering Works",
    "job_title": "Production Manager",
    "location": "Gazipur (Gazipur Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "14 Feb 2026",
    "job_description": "Production Manager : Toha Metal Engineering Works Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Toha Metal Engineering Works Production Manager Application Deadline : 14 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 18 to 50 years Location: Gazipur (Gazipur Sadar) Salary: Tk. 20000 - 25000 (Monthly) Published: 02 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 18 to 50 years Proficiency in interpreting steel construction drawings and measurements. Strong supervision and reporting skills. Production scheduling and delivery management expertise. Responsibilities & Context Interpret and understand steel construction material drawings and measurements. Plan and organize production schedules. Set and monitor quality control standards. Manage and oversee production processes; adjust timescales as necessary. Supervise workers and handle product delivery. Must have basic knowledge of computer operations and office tools such as MS Word and Excel. Skills & Expertise Communication MS Office Office Management Reporting Scheduling Suggested by Production Compensation & Other Benefits Mobile bill,Over time allowance Salary Review: Yearly Festival Bonus: 2 Snacks in 3 times. Residential facility. (bachelor) Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Gazipur (Gazipur Sadar) Company Information Toha Metal Engineering Works Follow Address: Office: Dhaka, Khilkhet, Namapara, kha-100/2/1\r\n\r\nFactory: Gazipur, Hariken Road, Notun Bazar, Bason Bitipara, B-455/3 Website: https://tohametal.com/ Business: We manufacture and supply construction shuttering materials. We create steel structures and do stainless steel work as well. Apart from these, we manufacture many construction-related materials. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Reg"
  },
  {
    "url": "https://bdjobs.com/h/details/1456915?ln=1",
    "company_name": "Ads Pillar",
    "job_title": "Kids English Instructor",
    "location": "Dhaka (Mirpur 10, Shewrapara)",
    "salary": null,
    "experience": null,
    "education": null,
    "deadline": "14 Feb 2026",
    "job_description": "Kids English Instructor : Ads Pillar Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Ads Pillar Kids English Instructor Application Deadline : 14 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: -- Age: At most 50 years Location: Dhaka (Mirpur 10, Shewrap... Dhaka (Mirpur 10, Shewrapara) Salary: Negotiable Published: 04 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age At most 50 years Required Qualifications Excellent command of English grammar, pronunciation, and communication. Prior experience teaching children (school, coaching center, or English programs) is preferred. Strong classroom-management skills with patience and a child-friendly attitude. Preferred Skills Experience with Cambridge curriculum or similar activity-based learning frameworks. Ability to use visual aids and interactive tools during lessons. Creativity in lesson design, storytelling, and student engagement. Strong interpersonal skills and a positive, energetic teaching style. Responsibilities & Context We are looking for a passionate and child-friendly Kids English Instructor who can deliver engaging lessons, create an encouraging learning environment, and help students strengthen their English communication skills. The ideal candidate must have strong academic qualifications in English or language education and a genuine love for teaching young learners. Responsibilities & Context Lesson Delivery & Classroom Management Conduct engaging, age-appropriate English lessons aligned with Prodigy’s curriculum (Cambridge-inspired). Promote development in speaking, listening, reading, writing, phonics, and vocabulary. Use interactive teaching methods such as flashcards, storytelling, gamification, songs, activities, and role-play. Facilitate group projects, discussions, pair work, and hands-on learning. Maintain a safe, inclusive, and child-friendly classroom environment. Student Progress & Engagement Track student progress through assessments, worksheets, class performance, and observation. Provide personalised, constructive feedback to students. Communicate effectively with parents/guardians regarding student development and improvement areas. Encourage confidence-building and active participation among young learners. Collaboration & Innovation Collaborate with fellow instructors and academic coordinators for lesson planning and curriculum enhancement. Participate in internal trainings, workshops, demo sessions, and academic events. Contribute creative ideas to improve teaching quality, activities, student engagement, and overall learning experience. Skills & Expertise IELTS IELTS Instructor Teaching/ Training TESOL Suggested by IELTS IELTS Instructor Teaching/ Training Compensation & Other Benefits What We Offer\n"
  },
  {
    "url": "https://bdjobs.com/h/details/1457221?ln=1",
    "company_name": "E.Engineer's Trade",
    "job_title": "Lawyer",
    "location": "Anywhere in Bangladesh",
    "salary": "· Festival Bonus: 2",
    "experience": "Ability to prepare legal documents, provide legal advice, and conduct litigation·",
    "education": null,
    "deadline": "15 Feb 2026",
    "job_description": "Lawyer : E.Engineer's Trade Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List E.Engineer's Trade Lawyer Application Deadline : 15 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Anywhere in Bangladesh Published: 05 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Additional Requirements Age: 25 to 35 years· Experience in civil, criminal, and labor court proceedings· Ability to prepare legal documents, provide legal advice, and conduct litigation· Excellent communication and negotiation skills· Excellent typing skills in both Bangla and English Responsibilities & Context Requirements: Education: · Master of Law (LLM) in Law / Bachelor of Law (LLB) in Law · Enrollment in Bangladesh Bar Council is a must · Candidates from public universities will get preference · Certification as an Income Tax Practitioner (ITP) or additional training in Tax/VAT will be considered an advantage Experience: · 2 to 4 years · Applicants should have experience in engineering firms · Must have hands-on experience in Tax and VAT filing and handling TDS/VDS matters Responsibilities & Context: · Representation: Represent the company in various courts, Tax Tribunals, and before the National Board of Revenue (NBR) or Deputy Commissioner of Taxes (DCT) · Drafting: Prepare legal documents, contracts, and responses to NBR notices or audit queries · Advice: Provide legal opinions and advice on corporate matters and tax-saving strategies · Risk Management: Manage and monitor legal and tax risks related to company operations · Any Other Task: Perform any other task assigned by the management Compensation & Other Benefits: · Mobile bill · Salary Review: Yearly · Festival Bonus: 2 · Other benefits as per company policy Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information E.Engineer's Trade Follow Address: Plot-3108, Road-6/2, Block-G, Sagufta Residential Project, In front of Mirpur DOHS gate No. 01, Mirpur-12, Dhaka-1216 Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO P"
  },
  {
    "url": "https://bdjobs.com/h/details/1454154?ln=1",
    "company_name": "Shekhabo Ltd",
    "job_title": "Head of Marketing",
    "location": "Dhaka, Dhaka (DOHS Mohakhali, Mohakhali)",
    "salary": "Tk. 50000 - 80000 (Monthly)",
    "experience": "",
    "education": "",
    "deadline": "25 Feb 2026",
    "job_description": "Head of Marketing : Shekhabo Ltd Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Shekhabo Ltd Head of Marketing Application Deadline : 25 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: 1 Age: 21 to 45 years Location: Dhaka, Dhaka (DOHS Mohakh... Dhaka, Dhaka (DOHS Mohakhali, Mohakhali) Salary: Tk. 50000 - 80000 (Monthly) Published: 27 Jan 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 21 to 45 years Required Experience & Skills Must Have 2–5 years of experience in marketing, with EdTech industry experience strongly preferred Proven leadership in digital/performance marketing Strong understanding of Bangladesh’s education market and learner behavior Data-driven mindset with hands-on campaign ownership experience Leadership & Strategic Skills Ability to think at both strategy and execution levels Strong decision-making and prioritization skills Experience managing budgets, teams, and performance metrics Nice to Have Experience scaling early-stage or fast-growing EdTech products Background in growth marketing or product-led growth Familiarity with CRM, marketing automation, or analytics tools Early Employee Advantages High ownership and decision-making authority Direct influence on company growth and direction Equity participation through stock options, aligning personal success with the company’s long-term value Long-term career and incentive growth potential Responsibilities & Context About the Role Shekhabo.com is seeking a Head of Marketing to take full ownership of the company’s marketing strategy and execution. This is a leadership role , not a coordination role. The Marketing Head will be responsible for building demand, driving growth, and shaping brand positioning across Bangladesh’s EdTech market. Candidates with 2–5 years of experience in the EdTech industry will be given strong priority. As an early employee , this role comes with significant influence, visibility, and long-term growth opportunities within the organization. Core Responsibilities Marketing Leadership & Strategy Own and execute the end-to-end marketing strategy (performance, content, brand, growth). Define target segments (students, parents, professionals) and positioning for each product line. Set quarterly and annual growth goals aligned with business objectives. Performance & Revenue Growth Lead paid marketing across Facebook, Google, and other relevant platforms. Optimize funnels from awareness to enrollment and retention. Track and manage CAC, LTV, conversion rates, and ROI. Brand & Content Direction Oversee messaging, storytelling, and brand consistency across all channels. Guide content strategy for social media, campaigns, landing pages, and partnerships. Build trust and credibility in a highly competitive EdTech market. Team & Cross-Functional Owners"
  },
  {
    "url": "https://bdjobs.com/h/details/1452626?ln=1",
    "company_name": "The White Horse Pharmaceuticals Ltd.",
    "job_title": "Electrician",
    "location": "Gazipur",
    "salary": "Tk. 15000 - 20000 (Monthly)",
    "experience": "5 to 7 years",
    "education": null,
    "deadline": "21 Feb 2026",
    "job_description": "Electrician : The White Horse Pharmaceuticals Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List The White Horse Pharmaceuticals Ltd. Electrician Application Deadline : 21 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Company Information Summary Vacancy: -- Location: Gazipur Salary: Tk. 15000 - 20000 (Monthly) Experience: 5 to 7 years Published: 22 Jan 2026 To access Application Insights Get Bdjobs Pro Requirements Education Diploma Diploma in Engineering Experience 5 to 7 years The applicants should have experience in the following business area(s): Food (Packaged)/Beverage, Pharmaceutical/Medicine Companies, Cosmetics/Toiletries/Personal Care Additional Requirements Responsibilities & Context Candidates who has experience in house waring will get preference . Skills & Expertise Suggested by Electrical House Wiring Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Gazipur Company Information The White Horse Pharmaceuticals Ltd. Follow More jobs from this company Address: 68, Dilkusha C/A (6th Floor), Dhaka-1000 Website: www.whitehorsepharma.com Business: The White Horse Pharmaceuticals Ltd. A Swiss Born Company started its journey since 1991 in Switzerland and activated in Bangladesh in 1996. Every smile is important. That`s why we work to protect you and your smile. We are a company which is working to ensure your happiness and safety. Our-state-of-the-art world class plant with modern facilities on a 4.5 acres land in Sreepur, Gazipur which complies with cGMP-WHO requirements is the perfect exposition of a proficient pharmaceuticals company. Presently, we are exporting to many countries and playing an important role in the global arena as well as domestic market, for the improvement of people`s health to see a face of full smile. As an integral part of this journey The White Horse Pharmaceuticals Ltd. is seeking dynamic, responsible & innovative individual. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Eng"
  },
  {
    "url": "https://bdjobs.com/h/details/1457351?ln=1",
    "company_name": "Elon IT",
    "job_title": "Digital Marketing and Google Ads Expert",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "10 Feb 2026",
    "job_description": "Digital Marketing and Google Ads Expert : Elon IT Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Elon IT Digital Marketing and Google Ads Expert Application Deadline : 10 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Location: Anywhere in Bangladesh Salary: Tk. 20000 - 35000 (Monthly) Published: 05 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Responsibilities & Context Elon IT is looking for an experienced Digital Marketing Expert to manage and scale paid advertising campaigns across multiple platforms. The ideal candidate has hands-on experience with performance marketing, media buying, and campaign optimization in competitive niches. Key Responsibilities Plan, execute, and optimize paid ad campaigns across multiple platforms Manage ads on Google , third-party ad networks , news portals , adult websites , and other performance-based platforms Analyze campaign performance (CTR, CPA, ROI) and optimize for growth Scale profitable campaigns while maintaining cost efficiency Collaborate with management to align marketing strategies with business goals Requirements Minimum 2 years of experience in digital marketing or paid advertising Strong understanding of media buying and performance marketing Experience in high-competition or restricted niches is a strong advantage Ability to work independently in a remote environment Analytical mindset with a results-driven approach Skills & Expertise Paid Media Google Ads google adsense facebook ads Digital Marketing (Social Media Marketing) Telemarketing Compensation & Other Benefits Weekly 2 holidays,Tour allowance,Mobile bill,Performance bonus Festival Bonus: 2 Salary Review: Yearly Workplace Work from home Employment Status Full Time Job Location Anywhere in Bangladesh Company Information Elon IT Follow Address: House # 33(4B Floor), Road # 3, Sector # 9, Uttara, Dhaka-1230. Website: https://www.elonit.com/ Business: ?? Exciting News! Elon IT is Now Open for Business! ?? We are thrilled to announce the launch of Elon IT, your new destination for cutting-edge software solutions! ?? At Elon IT, we specialize in: ?? Mobile App Development (Flutter, React Native, Kotlin, Swift) ?? Website Development (HTML, CSS, Bootstrap, Tailwind, React.js, Vue.js) ?? Software Development (Laravel, Node.js) ?? SEO & Digital Marketing Our team of experts is dedicated to delivering innovative solutions to help your business thrive in the digital age. Whether you need a stunning website, a powerful mobile app, or effective digital marketing strategies, we`ve got you covered! ?? Visit us at: 4B, House 33, Road 3, Sector 9, Uttara, Dhaka, Bangladesh ?? Contact us: 01770099496 (WhatsApp) ?? Email: info@elonit.com ?? Website: www.elonit.com Follow us for updates, tips, and m"
  },
  {
    "url": "https://bdjobs.com/h/details/1456264?ln=1",
    "company_name": "Sholla Ashek Ali School & College",
    "job_title": "Asst. Teacher / Sr. Teacher",
    "location": "Chandpur (Faridganj)",
    "salary": null,
    "experience": "1 to 3 years",
    "education": null,
    "deadline": "12 Feb 2026",
    "job_description": "Asst. Teacher / Sr. Teacher : Sholla Ashek Ali School & College Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Sholla Ashek Ali School & College Asst. Teacher / Sr. Teacher Application Deadline : 12 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 5 Age: 25 to 40 years Location: Chandpur (Faridganj) Salary: Tk. 20000 - 25000 (Monthly) Experience: 1 to 3 years Published: 02 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Masters Master’s degree in relevant subjects and no 3rd class/division in all academic examinations. Certificate course of professional development on teaching will be given an advantage. Experience 1 to 3 years The applicants should have experience in the following business area(s): College, School Freshers are also encouraged to apply. Additional Requirements Age 25 to 40 years The applicants should have experience in the following area(s):Classroom management, Classroom teaching, Co-curricular Activities Responsibilities & Context Subject: Biology 02, Bangla 02, Agriculture 01 Responsibilities: Conducting classes. Preparing notes and lecture sheets. Taking class tests, quizzes and exams. Checking exam papers. Monitoring student discipline. Preparing routines and semester schedules. Attending departmental and faculty meetings. Counseling students. Performing other work which designed by management. Willing to work in a team. Skills & Expertise Classroom management Classroom teaching Suggested by Classroom teaching Curriculum Development Lesson Planning Teaching/ Training Compensation & Other Benefits Provident fund and Pension facilities; Weekly 2 holidays; Free Residence facilities; Salary Review: Yearly; Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Chandpur (Faridganj) Company Information Sholla Ashek Ali School & College Follow Address: Sholla Bazar, Faridgonj, Chandpur. E-mail- shahid.bipul8@gmail.com, Mobile: 017958269010 Website: https://ashekalisc.edu.bd Business: SHolla Ashek Ali School & College is a residential and specialized collegiate school. It runs by MA Hannan Education and Human Resource Welfare Trust, Faridgonj, Chandpur. It was established in 2006 with a view to promote quality secondary education and life affirming skills. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@"
  },
  {
    "url": "https://bdjobs.com/h/details/1455783?ln=1",
    "company_name": "Quick & Authentic Consultancy",
    "job_title": "Visa Counsellor",
    "location": "Dhaka (DOHS Mirpur)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "11 Feb 2026",
    "job_description": "Visa Counsellor : Quick & Authentic Consultancy Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Quick & Authentic Consultancy Visa Counsellor Application Deadline : 11 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 20 Age: 18 to 30 years Location: Dhaka (DOHS Mirpur) Salary: Tk. 15000 - 25000 (Monthly) Published: 01 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 18 to 30 years Responsibilities & Context Provide accurate information and counseling regarding visa applications. Guide clients in choosing appropriate countries and visa categories based on their profiles. Assist clients in completing visa application forms and preparing required documents. Follow up on application progress and update clients regularly. Maintain communication with clients through in-person, phone, or online channels. Work to achieve company service and sales targets. Stay updated with current visa rules and immigration policies. Handle client inquiries and resolve issues professionally. Skills & Expertise Counseling Immigration Consultancy Visa Processing Suggested by Counseling Compensation & Other Benefits Monthly Mobile Bill Allowance - The company covers your mobile expenses each month. Commission and Bonus - Additional incentives are provided based on performance.  Lunch - Nutritious lunch is provided to all staff members. Workplace Work at office Employment Status Full Time Gender Only females are allowed to apply. Job Location Dhaka (DOHS Mirpur) Company Information Quick & Authentic Consultancy Follow Address: Avenue-6, Road-9, House-688, Mirpur-12 DOHS Website: https://www.facebook.com/profile.php?id=6157379822 Business: We are a immigration consultancy firm. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employabi"
  },
  {
    "url": "https://bdjobs.com/h/details/1457418?ln=1",
    "company_name": "Shunno IT",
    "job_title": "NOC Support Engineer",
    "location": "Rajshahi",
    "salary": null,
    "experience": "At least 2 years",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "NOC Support Engineer : Shunno IT Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Shunno IT NOC Support Engineer Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 2 Age: 22 to 32 years Location: Rajshahi Salary: Tk. 15000 - 30000 (Monthly) Experience: At least 2 years Published: 06 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Bachelor/Honors Diploma MTCNA, MTCRE, or equivalent networking qualifications are highly preferred. Experience At least 2 years The applicants should have experience in the following business area(s): Business-to-Business (B2B) Software and Services Startup, ISP, IT Enabled Service, Software Company Additional Requirements Age 22 to 32 years To be considered for this role, candidates must possess:Proven expertise in MikroTik Router OS and advanced router configurations.Strong understanding of OLT systems, PON technology, and fiber network management.Hands-on experience with API and Radius integration.Familiarity with VLANs and routing protocols (e.g., OSPF, BGP).Ability to design and implement load balancing and high-availability solutions.Proficiency in network monitoring tools.Relevant certifications like MTCNA, MTCRE, or equivalent networking qualifications are highly preferred. Responsibilities & Context Our Company is looking for Two NOC Support Engineers to join our team. MikroTik Configuration & Management: Complete setup and management of MikroTik routers. Advanced VPN configuration and maintenance. PPPoE, static IP assignments, and hotspot configuration. Firewall rules creation, NAT configuration, and traffic shaping. Advanced scripting and automation for MikroTik. OLT Configuration & Support: Bringing OLT devices online and integrating them with the network. Configuring VLANs and managing PON (Passive Optical Network) ports. Monitoring and troubleshooting fiber connections and ensuring minimal downtime. Knowledge of ONU/ONT provisioning and firmware updates. API and Software Integration: Integrating software with MikroTik using API and Radius protocols. Troubleshooting issues between the billing platform and the network infrastructure. Network Monitoring & Troubleshooting: Real-time monitoring of network performance using NMS tools like The Dude, Zabbix, or similar platforms. Diagnosing and resolving network-related issues, including latency, packet loss, and device misconfigurations. Maintaining documentation for all configurations and troubleshooting procedures. Provide ongoing support and communication to customers. Preparing regular incident reports. Skills & Expertise CCNA (Cisco Certified Network Associate) GPON ISP ISP operation Mikrotik Administration MTCNA MTCRE OLT and ONU Compensation & Other Benefits Performance bonus Salary Review: Year"
  },
  {
    "url": "https://bdjobs.com/h/details/1457439?ln=1",
    "company_name": "EPISODES DOT WORLD",
    "job_title": "Sales Executive - Retail & E-commerce",
    "location": "Dhaka (Mirpur 10)",
    "salary": null,
    "experience": "1 to 2 years",
    "education": null,
    "deadline": "16 Feb 2026",
    "job_description": "Sales Executive - Retail & E-commerce : EPISODES DOT WORLD Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List EPISODES DOT WORLD Sales Executive - Retail & E-commerce Application Deadline : 16 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 02 Age: 18 to 29 years Location: Dhaka (Mirpur 10) Salary: Tk. 10000 - 12000 (Monthly) Experience: 1 to 2 years Published: 06 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Higher Secondary Experience 1 to 2 years The applicants should have experience in the following business area(s): Boutique/ Fashion, E-commerce, F-commerce, Retail Store Additional Requirements Age 18 to 29 years Minimum 6 months – 1 year experience in sales / e-commerce (preferred). Strong communication skill (Bangla mandatory, English basic). Must be confident in convincing customers. Experience in Facebook page inbox handling is a plus. Honest, punctual, and sales-driven mindset. Target-oriented & pressure-handling capability Responsibilities & Context Facebook & Instagram page message handling. Customer query handling and order confirmation. B2B (bulk order) customer communication. Old customer follow-up & retention calls. Coordinating with outlet & delivery team. Skills & Expertise B2B Sales Customer Service Retail Sales Telemarketing Suggested by Customer Relations Customer Support Sales target Customer Service Social Media Management Compensation & Other Benefits Mobile bill,Performance bonus,Over time allowance Salary Review: Half Yearly Festival Bonus: 2 Office time: 11.30am to 8.30pm (6 days a week) Basic Salary: 10,000 to 14,000 BDT Commission: Performance-based  (Delivered sales & B2B orders) upto 15k. Incentives for target achievement Growth opportunity with the brand Workplace Work at office Employment Status Full Time Gender Only males are allowed to apply. Job Location Dhaka (Mirpur 10) Company Information EPISODES DOT WORLD Follow Address: 293 , SHENPARA, MIRPUR-10 Website: https://episodes.world/ Business: Episodes World Cap and Lifestyle Brand. Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced"
  },
  {
    "url": "https://bdjobs.com/h/details/1457568?ln=1",
    "company_name": "Renewable Technologies",
    "job_title": "Electrical Technician (Site-Based)",
    "location": null,
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "17 Feb 2026",
    "job_description": "Electrical Technician (Site-Based) : Renewable Technologies Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Renewable Technologies Electrical Technician (Site-Based) Application Deadline : 17 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 1 Age: 18 to 35 years Location: Panchagarh (Panchagar Sad... Panchagarh (Panchagar Sadar) Salary: Tk. 10000 - 15000 (Monthly) Published: 07 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age 18 to 35 years Must be knowledgeable in electrical technician work Motorcycle is mandatory (fuel cost will be borne by the company) Must be a smartphone user (for communication & reporting) Willing to travel within assigned areas Responsible, punctual, and hardworking Responsibilities & Context Job Type: Hybrid (Field work + coordination) Job Location Panchagarh, Thakurgaon & Rangpur Division (Regular site visits required) Job Responsibilities Electrical installation, inspection, and basic maintenance Solar project–related site visits and support work Field-level troubleshooting and reporting Coordinate with technical and project teams Interview Location Dhaka (Physical Interview) OR Online Interview (for shortlisted candidates) Skills & Expertise motorcycle driving Smart Phone Suggested by Electrical Maintenance Electrical technician Compensation & Other Benefits Fuel cost: Covered by company\nOpportunity to work in the renewable energy sector Workplace Work from home Employment Status Full Time Job Location Panchagarh (Panchagar Sadar) Company Information Renewable Technologies Follow Address: Renewable Technologies is a Bangladesh-based consulting and engineering firm specializing in renewable energy, environmental sustainability, and clean technology solutions. The company focuses on delivering data-driven, technically sound, and policy-aligned services. Business: ??? Renewable Energy Feasibility & Engineering\n\nWind energy feasibility studies (onshore & coastal)\n\nWind meteorological tower installation, networking, and data monitoring\n\nSolar PV system assessment and technical advisory\n\nGrid interconnection and load analysis\n\nPerformance monitoring and reporting\n\n?? Waste-to-Energy & Biogas Solutions\n\nSlaughterhouse and organic waste-based biogas feasibility studies\n\nBiogas plant design review and pilot project support\n\nBioslurry management and bio-fertilizer utilization planning\n\nCircular economy–based waste management solutions\n\n?? Environmental & Sustainability Consulting\n\nEnvironmental screening and baseline studies\n\nSupport for EIA/IEE aligned with Bangladesh DoE, IFC, and World Bank standards\n\nClimate impact and sustainability assessments\n\nStakeholder and community engagement support\n\n?? Data, IoT & Smart Monitoring\n\nIoT-based energy and environmental "
  },
  {
    "url": "https://bdjobs.com/h/details/1457999?ln=1",
    "company_name": "চমক রেষ্টুরেন্ট",
    "job_title": "স্টোর কিপার",
    "location": "Chattogram (Chattogram Sadar)",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "স্টোর কিপার : চমক রেষ্টুরেন্ট Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List চমক রেষ্টুরেন্ট স্টোর কিপার Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: -- Location: Chattogram (Chattogram Sa... Chattogram (Chattogram Sadar) Salary: Negotiable Published: 08 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education HSC Bachelor/Honors এইচ এস সি/ অনার্স/ডিগ্রি Additional Requirements উল্লেখিত পদের জন্য অবশ্যই কম্পিউটার ( মাইক্রোসফট ওয়ার্ড ও এক্সেল) জানা আবশ্যক। Responsibilities & Context ডিউটি ১২ ঘন্টা। কর্মস্থল: ঈদগাঁ Skills & Expertise Suggested by Store keeping Store/ inventory Storekeeping Compensation & Other Benefits বেতন : আলোচনা সাপেক্ষে Workplace Work at office Employment Status Full Time Job Location Chattogram (Chattogram Sadar) Company Information চমক রেষ্টুরেন্ট Follow Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  },
  {
    "url": "https://bdjobs.com/h/details/1457389?ln=1",
    "company_name": "LumenPro Studio Ltd.",
    "job_title": "Executive/Sr. Executive - Corporate Sales",
    "location": "Anywhere in Bangladesh",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "Executive/Sr. Executive - Corporate Sales : LumenPro Studio Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List LumenPro Studio Ltd. Executive/Sr. Executive - Corporate Sales Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Salary & Benefits Company Information Summary Vacancy: 4 Age: 25 to 33 years Location: Anywhere in Bangladesh Salary: Negotiable Published: 08 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 33 years Required Skills Sales Expertise: Significant expertise in day-to-day sales operations. Soft Skills: Strong team-building capabilities, conflict resolution, and problem-solving skills. Note : This is strictly a corporate-based, target-oriented sales role. Responsibilities & Context We are seeking candidates with a strong mindset and dedication to drive Corporate Sales for a leading LED lighting Importer, Manufacturer, and Global Brand Local Channel Partner in Bangladesh. Our portfolio includes all types of regular and architectural LED lighting. Additionally, we serve as the local channel partner for a Global Leading Professional lighting brand. Key Responsibilities Sales Hunting & Business Development: Actively hunt for new projects and validate leads within the assigned area(s) to achieve sales targets. Design & Collaboration: Collaborate with in-house architects to prepare lighting designs and proposals that meet client needs. Client Visits: Regularly visit potential Corporate Houses, RMG sectors, Government Institutions, and Private companies to generate sales and develop business relationships. Proposal Creation: Prepare and submit comprehensive business proposals, including technical and financial offers. Account Management: Visit existing clients to upsell/cross-sell products and provide necessary services to maintain strong business relationships. Sales Closing: Negotiate and lock sales deals with clients. Product Management: Oversee product delivery and sample submission/return processes. Skills & Expertise AutoCAD 2D 3D Electrical Engineering Suggested by Client Relationship Management Engineering Sales & Marketing Technical Sales Compensation & Other Benefits T/A,Mobile bill,Tour allowance,Profit share,Performance bonus Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Anywhere in Bangladesh Company Information LumenPro Studio Ltd. Follow More jobs from this company Address: Salam Tower, 1st Floor (1/25,26), Basundhara R/A link Road, Vatara, Dhaka Website: http://www.lumenprostudio.com Business: ?\"LumenPro combines deep industry heritage with modern LED innovation. We specialize in premium architectural lighting that prioritizes energy efficiency and human-centric design. We don’t just sell lights; we empower property owners with expert guidance on compli"
  },
  {
    "url": "https://bdjobs.com/h/details/1457883?ln=1",
    "company_name": "ACI Godrej Agrovet Private Ltd.",
    "job_title": "Shift In Charge",
    "location": "Sirajganj",
    "salary": "Negotiable",
    "experience": "",
    "education": null,
    "deadline": "11 Feb 2026",
    "job_description": "Shift In Charge : ACI Godrej Agrovet Private Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List ACI Godrej Agrovet Private Ltd. Shift In Charge Application Deadline : 11 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Skills & Expertise Company Information Summary Vacancy: -- Age: 25 to 40 years Location: Sirajganj Salary: Negotiable Published: 08 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 25 to 40 years Have sound knowledge on VFD,HMI,PLC Technical abilities & computer skill Responsibilities & Context Oversee overall production during assigned shift (RM arranging, grinding, mixing, pelleting Drying, coating, cooling, crumbling, and bagging). Achieving shift production target in line with formulation and process standards. Operate manpower (external & internal), machines, and materials effectively for shift Coordinate with maintenance, quality control, and warehouse loams to ensure smooth open Maintain production/Consumption (RM & Utility) data through ERP/SAP and pen & paper, F performance, process deviations, and equipment issues - Communicate production issues and requirements to the next shift and management. Conduct in-process checks with IPQC & Lab team and support corrective actions are requi Identify equipment abnormalities and coordinate with maintenance teams for timely repair t breakdown, ensure highest % of OEE Coordinate with QC/QA teams for regular sampling and lab analysis to assure nutrient spas and safety standards Identify and implement process improvements through KAIZEN, 5S, PDCA to enhance effect reduce energy & operation costs, Ensure compliance with GMP and feed safety regulations Maintain cleanliness and operational readiness of all machines, Ensure workers follow SOF guidelines & hygiene and use proper PPE Conduct on-the-job training for new staff to maintain skill levels and efficiency Skills & Expertise Communication Working under pressure Suggested by Cross-functional Collaboration Data Management Manpower management Production Management Resource Optimization Workplace Work at office Employment Status Full Time Job Location Sirajganj Job Highlights Oversees shift-wise feed production, ensures targets, quality, and GMP compliance, coordinates manpower and maintenance, tracks ERP/SAP data, resolves process issues, drives OEE, and leads continuous improvement through KAIZEN, 5S, and PDCA. Company Information ACI Godrej Agrovet Private Ltd. Follow Address: Address: Kaderia Tower (7th Floor), JA 28/8\r\nMohakhali, C/A, Dhaka-1212, Bangladesh Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাক"
  },
  {
    "url": "https://bdjobs.com/h/details/1457387?ln=1",
    "company_name": "LumenPro Studio Ltd.",
    "job_title": "HR Administrator",
    "location": "Dhaka",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "HR Administrator : LumenPro Studio Ltd. Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List LumenPro Studio Ltd. HR Administrator Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 2 Age: At least 26 years Location: Dhaka Salary: Tk. 15000 - 18000 (Monthly) Published: 08 Feb 2026 To access Application Insights Get Bdjobs Pro Requirements Education Additional Requirements Age At least 26 years Responsibilities & Context Records Management: Maintain and update digital and physical personnel records (e.g., employment contracts, PTO, sick leave). Onboarding & Offboarding: Assist with the recruitment process, coordinate new hire orientations, and handle termination paperwork. Database Administration: Update internal HR databases and ensure all employee data is accurate and compliant with labor laws. Employee Support: Act as the primary point of contact for employees regarding HR policies, benefits, and general inquiries. Payroll Assistance: Assist the payroll department by providing relevant employee information (e.g., leaves of absence, sick days, work schedules). Reporting: Prepare regular reports on HR metrics (e.g., turnover rates, retention, diversity) for management. Skills & Expertise Suggested by HRIS/ HR Database Management Human Resource Management payroll management Compensation & Other Benefits Mobile bill,Tour allowance,Weekly 2 holidays,Performance bonus,Profit share Salary Review: Yearly Festival Bonus: 2 Workplace Work at office Employment Status Full Time Job Location Dhaka Company Information LumenPro Studio Ltd. Follow More jobs from this company Address: Salam Tower, 1st Floor (1/25,26), Basundhara R/A link Road, Vatara, Dhaka Website: http://www.lumenprostudio.com Business: ?\"LumenPro combines deep industry heritage with modern LED innovation. We specialize in premium architectural lighting that prioritizes energy efficiency and human-centric design. We don’t just sell lights; we empower property owners with expert guidance on compliance and technology to lower costs. We operate with a steadfast commitment to integrity, innovation, and the planet.\" Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রি"
  },
  {
    "url": "https://bdjobs.com/h/details/1457918?ln=1",
    "company_name": "Probashi Unnayan Songstha Uttara",
    "job_title": "Branch Manager",
    "location": "Tangail",
    "salary": null,
    "experience": "",
    "education": null,
    "deadline": "18 Feb 2026",
    "job_description": "Branch Manager : Probashi Unnayan Songstha Uttara Jobs ENG বাংলা Create Account Sign In For Employer Create Sign In Home Jobs Mybdjobs Job List Probashi Unnayan Songstha Uttara Branch Manager Application Deadline : 18 Feb 2026 Apply Now Shortlist Share: Facebook LinkedIn WhatsApp All Requirements Responsibilities Salary & Benefits Company Information Summary Vacancy: 10 Age: 30 to 55 years Location: Tangail Salary: Negotiable Published: 08 Feb 2026 Applicants are encouraged to submit Video CV. To access Application Insights Get Bdjobs Pro Requirements Education Experience Additional Requirements Age 30 to 55 years Responsibilities & Context ৬মাস ফিল্ড অফিসার পদে কাজ করতে হবে টাংগাইল। ৬মাসপর ব্যার্নম্যানের পদে বহাল করাহবে।ব্যার্ন ম্যানেজার এলাকা হবে জামালপুর, শেরপুর, ময়মনসিংহ, নেত্রকোনা, টাংগাইল, সিরাজগঞ্জ। নিওগ পাবে নারী পুরুষ। Compensation & Other Benefits বেতন প্রথম মাস১০ হাজার,২য় মাস হতে১৮হাজার,৬মাস হতে২৬হাজার,৭মাস হতে ৩৬ হাজার টাকা, সাতে ফুয়েল খরচা, অন্য সুবিধা দেওয়া হবে। মটর বাইক থাতে হবে।কর্ম সুচি প্রবাসীদের সদস্য করন,তাদের মাজে্ লোন বিতারন মাসিক কিস্তি আদায়। Workplace Work at office Employment Status Full Time Job Location Tangail Company Information Probashi Unnayan Songstha Uttara Follow Address: R-12, H-43, Sector-4 Uttara Dhaka Report this Job / Company (রিপোর্ট) রিপোর্ট এই চাকরির জন্য বিজ্ঞাপনদাতা ব্যাক্তি/প্রতিষ্ঠান আপনার কাছ থেকে কোন অর্থ চাইলে কিংবা নিয়োগ প্রক্রিয়া চলাকালীন কোন প্রকার হয়রানিমূলক (শারীরিক/মানসিক) আচরণ করলে অতিসত্ত্বর আমাদেরকে জানান অথবা জবটি রিপোর্ট করুন। চাকরি পাওয়ার জন্য কোন ব্যাক্তি/প্রতিষ্ঠানকে অর্থ প্রদান করবেন না। চাকরিকালীন কোন প্রকার হয়রানির (শারীরিক/মানসিক) সম্ভাবনা থাকলে সেখানে জয়েন করবেন না। কোন প্রকার অর্থ লেনদেন বা নিয়োগদাতা কর্তৃক হয়রানির দায়িত্ব বিডিজবস বহন করবে না। 09638666444 , 01897627858 complain@bdjobs.com ⏸ Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Project Cycle Management (PCM) for the NGO Professionals 4500 BDT Tareq Ahmed Register Now Lean Six Sigma-Yellow Belt 3500 BDT Engr. Md. Towhid Ul Alam Chowdhury Register Now ইন্টারভিউয়ের কল পেতে ফ্রিতে রেজিস্ট্রেশন করুন Employability Skills Course FREE! BDT Self-paced Learning Register Now Need any support? Our Contact Centre is available from -9 am to 8 pm (Sat to Thurs). 09638666444 01897627858 About Us About Bdjobs.com Terms & Conditions Privacy Policy Feedback Contact Us Accessibility Statement Job Seekers Bdjobs Pro My Bdjobs Panel List of Features Video Guides FAQ Recruiter Create Account Products/Service Post a Job FAQ Download Job Seeker App Get real-time job updates on our app. Download Employer App Post jobs and manage hiring anytime. Our Valuable Partners Stay connected with us Close"
  }
]