[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19752",
    "job_id": "19752",
    "company_name": "Zaman Traders",
    "job_title": "Technical Assistant",
    "location": "Uttara",
    "salary": "TK. 12,000-15,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-01-13",
    "industry": "Technical",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": null,
    "job_description": "Responsibilities: Zaman Traders is a leading importer and supplier of advertisement displays, interactive touch displays, big signboards, digital advertisement displays, and large LED panels. We are expanding our technical team to provide top-notch servicing and installation support for our clients.\n\n- Assist in installation, maintenance, and servicing of advertisement displays, LED panels, and interactive touch displays.\n- Troubleshoot and repair electrical and electronic components of display systems.\n- Support senior technicians in wiring, configuration, and calibration of digital signage.\n- Ensure timely and quality servicing for clients.\n- Maintain records of service and installation activities.\n\nZaman Traders is a leading importer and supplier of advertisement displays, interactive touch displays, big signboards, digital advertisement displays, and large LED panels. We are expanding our technical team to provide top-notch servicing and installation support for our clients. Assist in installation, maintenance, and servicing of advertisement displays, LED panels, and interactive touch displays. Troubleshoot and repair electrical and electronic components of display systems. Support senior technicians in wiring, configuration, and calibration of digital signage. Ensure timely and quality servicing for clients. Maintain records of service and installation activities."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19755",
    "job_id": "19755",
    "company_name": "Desh BD Fashion",
    "job_title": "সেলসম্যান",
    "location": "Uttara",
    "salary": "TK. 10,000-12,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-01-13",
    "industry": "Sales/Marketing",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "House No: 6, Sector: 5, Block: C, Uttara, Dhaka",
    "job_description": "Responsibilities: Communicate with customers to sell products Create and maintain relationships with new customers Prepare daily sales reports Achieve sales targets according to company goals Interact with customers in a friendly and honest manner\n\nগ্রাহকদের সাথে যোগাযোগ করে পণ্য বিক্রয় করা নতুন গ্রাহক তৈরি ও সম্পর্ক বজায় রাখা দৈনিক বিক্রয় রিপোর্ট প্রস্তুত করা কোম্পানির লক্ষ্য অনুযায়ী সেলস টার্গেট পূরণ করা গ্রাহকদের সাথে ভালো ব্যাবহার করা ও সৎ হতে হবে"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20139",
    "job_id": "20139",
    "company_name": "Best All-Baby Mart ",
    "job_title": "Content & Research Executive (On-Camera Presenter)",
    "location": "Demra",
    "salary": "TK. 15,000-25,000",
    "experience": "6 months - 1 year",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-01-28",
    "industry": "Media/Advertisement/Event Mgt.",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "SODOR MYMENSINGH",
    "job_description": "Responsibilities: Title: Content & Research Executive (On-Camera Presenter) We are looking to hire a proactive and confident Content & Research Executive to join our team, who can work with customers in the office and feel comfortable presenting content in front of the camera. Salary Monthly Salary: 15,000 - 22,000 Taka (based on skills and experience) Job Type: Full-time Location: Demra Staff Quarters Responsibilities Collect reviews from customers Generate content ideas and conduct market research Create scripts for video and digital content Present content in front of the camera Collaborate with the team for content development Qualifications Confidence and articulate presentation skills in front of the camera Interest in content creation and research Proficiency in speaking Bengali (knowledge of English is an added advantage) Learning mindset and sense of responsibility\n\nপদবী: Content & Research Executive (On-Camera Presenter) আমাদের টিমে যোগ দেওয়ার জন্য একজন উদ্যমী ও আত্মবিশ্বাসী Content & Research Executive নিয়োগ দেওয়া হবে, যিনি অফিসে বসেই কাস্টমারদের সাথে কাজ করতে পারবেন এবং ক্যামেরার সামনে কনটেন্ট উপস্থাপন করতে স্বাচ্ছন্দ্যবোধ করেন। বেতন মাসিক সেলারি: ১৫,০০০ – ২২,০০০ টাকা (দক্ষতা ও অভিজ্ঞতার ভিত্তিতে) চাকরির ধরন: ফুল-টাইম কর্মস্থল : ডেমরা স্টাফ কোয়ার্টার কাজের দায়িত্ব কাস্টমারদের কাছ থেকে রিভিউ সংগ্রহ করা কনটেন্ট আইডিয়া ও মার্কেট রিসার্চ করা ভিডিও ও ডিজিটাল কনটেন্টের জন্য স্ক্রিপ্ট তৈরি করা ক্যামেরার সামনে দাঁড়িয়ে কনটেন্ট উপস্থাপন করা টিমের সাথে সমন্বয় করে কনটেন্ট ডেভেলপমেন্টে কাজ করা যোগ্যতা ক্যামেরার সামনে কথা বলার আত্মবিশ্বাস ও সাবলীল উপস্থাপন ক্ষমতা কনটেন্ট ক্রিয়েশন ও রিসার্চে আগ্রহ বাংলা ভাষায় ভালো কথা বলার দক্ষতা (ইংরেজি জানলে বাড়তি সুবিধা) শেখার মানসিকতা ও দায়িত্ববোধ"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19694",
    "job_id": "19694",
    "company_name": "Ribana",
    "job_title": "Facebook Moderator",
    "location": "Dhaka, Mohammadpur",
    "salary": "TK. 8,000-20,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-01-11",
    "industry": "Call Center",
    "vacancy": 10,
    "shift": "Other",
    "country": null,
    "company_address": "Shop no. 14, 27 SHAPTAK SQUARE, Road No 16, Dhanmondi, Dhaka 1205.",
    "job_description": "Responsibilities: Responsibilities:\n- Manage and respond to messages on social media platforms\n- Persuade customers in messages to make sales.\n- Ensure clear, polite, and professional communication\n- Work with team members to maintain smooth workflow\n- Handle multiple conversations efficiently under deadlines\n\nRequirements: Requirements:\n- Flexible to work 8 hrs/day\n- Ability to work under pressure\n- Ability to achieve target\n- Personal laptop or desktop must\n- Cooperative, enthusiastic, and team-oriented\n- Fast typing skills\n- English & Bangla typing (mandatory)\n\nSalary: Basic 8,000 tk + (Commission on sales up to 20,000 tk)\n\nApply Now Send your CV to hr.ribana@gmail.com\n\nResponsibilities: Manage and respond to messages on social media platforms Persuade customers in messages to make sales. Ensure clear, polite, and professional communication Work with team members to maintain smooth workflow Handle multiple conversations efficiently under deadlines"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19673",
    "job_id": "19673",
    "company_name": "SPLENDOR BY ANEEKA BUSHRA",
    "job_title": "Salon Floor Manager",
    "location": "Dhanmondi",
    "salary": "TK. 15,000-30,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-01-10",
    "industry": "Management Staff",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "H 23, Road No. 13/A, Dhanmondi - Dhaka 1209",
    "job_description": "Responsibilities: Key Responsibilities:\n- Supervise salon floor staff and daily operations\n- Manage bookings, client flow, and service quality\n- Ensure hygiene, discipline, and brand standards\n- Handle client concerns and team coordination\n\nBenefits:\n1. Two Festival Bonuses\n2. Mobile Bill Allowance\n\nRequirements: ```html Candidate Requirements: 2-4 years experience in salon/hospitality/service management Strong leadership and communication skills Organized, responsible, and customer-focused ```\n\nKey Responsibilities: Supervise salon floor staff and daily operations Manage bookings, client flow, and service quality Ensure hygiene, discipline, and brand standards Handle client concerns and team coordination Benefits: 1. Two Festival  Bonuses 2. Mobile Bill Allowance"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19954",
    "job_id": "19954",
    "company_name": "Sweet Surprises BD",
    "job_title": "প্যাকেজিং ম্যান",
    "location": "Mohammadpur",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-01-21",
    "industry": "Warehouse",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Mohammadpur, Dhaka",
    "job_description": "Responsibilities: Packaging Birthday and Party products correctly Safely handle Gift and Decoration items Check and prepare orders before delivery Storage and management of packaging materials\n\nRequirements: Minimum SSC Ability to work quickly and accurately\n\nBirthday ও Party পণ্য সঠিকভাবে প্যাকেজিং করা গিফট ও ডেকোরেশন আইটেম নিরাপদভাবে মোড়কজাত করা ডেলিভারির আগে অর্ডার চেক ও প্রস্তুত করা প্যাকেজিং ম্যাটেরিয়াল সংরক্ষণ ও ব্যবস্থাপনা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20166",
    "job_id": "20166",
    "company_name": "POSITIVE BAZAR ",
    "job_title": "Customer Care Representative",
    "location": "Tejgaon",
    "salary": "TK. 12,500-25,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-01-29",
    "industry": "Call Center",
    "vacancy": 7,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Nakalpara Tejgaon Industrial Dhaka 1215",
    "job_description": "Responsibilities: Communicate with customers via phone, message, or chat Provide accurate information about products and services Professionally address customer complaints Process orders, returns, and exchanges Reply to messages/comments on Facebook, WhatsApp, and other social media Maintain records of customer interactions and update reports Be able to work with targets\n\nRequirements: HSC/Undergraduate (can apply even if currently studying) Able to communicate in clear language English & Bangla Typing skills required Patient, responsive, and eager to learn Basic computer knowledge (CRM, ERP, email, chat tools) Teamwork and adaptability required\n\nফোন, মেসেজ বা চ্যাটের মাধ্যমে কাস্টমারের সাথে যোগাযোগ করা প্রোডাক্ট ও সার্ভিস সম্পর্কে সঠিক তথ্য প্রদান করা কাস্টমারের অভিযোগ শুনে পেশাদারভাবে সমাধান করা অর্ডার, রিটার্ন এবং এক্সচেঞ্জ প্রসেস করা Facebook, WhatsApp ও অন্যান্য সোশ্যাল মিডিয়ায় মেসেজ/কমেন্ট রিপ্লাই করা কাস্টমার ইন্টারঅ্যাকশনের রেকর্ড রাখা এবং রিপোর্ট আপডেট করা টার্গেট নিয়ে কাজ করতে সক্ষম হওয়া"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19953",
    "job_id": "19953",
    "company_name": "Sweet Surprises BD",
    "job_title": "ইভেন্ট প্ল্যানার",
    "location": "Mohammadpur",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-01-21",
    "industry": "Media/Advertisement/Event Mgt.",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Mohammadpur, Dhaka",
    "job_description": "Responsibilities: Planning and execution of birthday and anniversary events Communicating with clients to understand their needs and work accordingly Coordinate decoration and set up\n\nRequirements: - HSC / Bachelor (Experience preferred)\n- Experience in event or decoration work\n- Responsible and creative\n\nজন্মদিন ও অ্যানিভার্সারি ইভেন্ট পরিকল্পনা ও বাস্তবায়ন ক্লায়েন্টের সাথে যোগাযোগ করে প্রয়োজন বুঝে কাজ করা ডেকোরেশন ও সেটআপ তদারকি করা"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19745",
    "job_id": "19745",
    "company_name": "Shelai (Dhanmondi 27 outlet)",
    "job_title": "Sales Executive (Dhanmondi-7/27 Outlet)",
    "location": "Dhanmondi",
    "salary": "TK. 9,000-15,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-01-13",
    "industry": "Sales/Marketing",
    "vacancy": 50,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Dhanmondi 27",
    "job_description": "Responsibilities: Those who apply quickly for Urent Hiring will receive a call for an interview. Shelai, a premium brand that works with high-quality Pakistani traditional clothing, is looking for a skilled and customer-centric showroom sales executive for their flagship outlet. As a sales executive, you will play a crucial role in enhancing customer experience, increasing sales, and presenting our brand with professionalism and enthusiasm. Main Responsibilities: Welcome and assist customers in a friendly and professional manner. Understand customer needs and provide advice on suitable products. Maintain a clean, organized, and attractive showroom. Manage Point of Sale (POS) transactions and accept cash and credit card payments. Achieve monthly sales targets and exceed them. Stay updated on new arrivals, promotions, and product features. Handle customer inquiries, complaints, and returns with patience and skill. Build and maintain strong relationships with customers for repeat business. Coordinate with the inventory team for sufficient stock levels. Assist in preparing and displaying products for increased sales. Benefits: Competitive salary and attractive commission-based incentives. Opportunities for professional growth and development. Friendly and inclusive work environment. Employee discount on Shelai products. Office Location: Shelai Dhanmondi Satmasjid Outlet 76 Satmasjid Road, Concord Mumtaz Karim heritage (1st floor), Dhanmondi, Dhaka 1205, Bangladesh 01961942986\n\nUrent Hiring যারা দ্রুত আবেদন করবে তারাই ইন্টারভিউ জন্য ডাক পাবেন। Shelai, একটি প্রিমিয়াম ব্র্যান্ড যা উচ্চমানের পাকিস্তানি ঐতিহ্যবাহী পোশাক নিয়ে কাজ করে, তাদের বনানী আউটলেটের জন্য একজন দক্ষ এবং গ্রাহক-কেন্দ্রিক শো রুম সেলস এক্সিকিউটিভ খুঁজছে। সেলস এক্সিকিউটিভ হিসেবে, আপনি গ্রাহক অভিজ্ঞতা উন্নত করতে, বিক্রয় বাড়াতে এবং আমাদের ব্র্যান্ডকে পেশাদারিত্ব ও উত্সাহের সাথে উপস্থাপন করতে গুরুত্বপূর্ণ ভূমিকা পালন করবেন। মূল দায়িত্ব: গ্রাহকদের বন্ধুত্বপূর্ণ এবং পেশাদার উপায়ে স্বাগত জানানো এবং সহায়তা করা। গ্রাহকের প্রয়োজন বুঝে তাদের উপযুক্ত পণ্য সম্পর্কে পরামর্শ প্রদান। শো রুম পরিষ্কার, সজ্জিত এবং আকর্ষণীয় রাখা। পয়েন্ট অফ সেল (POS) লেনদেন পরিচালনা এবং নগদ ও ক্রেডিট কার্ড পেমেন্ট গ্রহণ। মাসিক বিক্রয় লক্ষ্য অর্জন এবং অতিক্রম করা। নতুন আগমন, প্রচার এবং পণ্যের বৈশিষ্ট্য সম্পর্কে আপডেট থাকা। ধৈর্য এবং দক্ষতার সাথে গ্রাহকদের প্রশ্ন, অভিযোগ এবং ফেরত পরিচালনা করা। পুনরায় ব্যবসার জন্য গ্রাহকের সাথে শক্তিশালী সম্পর্ক তৈরি এবং বজায় রাখা। পর্যাপ্ত স্টকের জন্য ইনভেন্টরি টিমের সাথে সমন্বয় করা। বিক্রয় বৃদ্ধির জন্য পণ্যের সজ্জা ও প্রদর্শনীতে সহায়তা করা। সুবিধাসমূহ: প্রতিযোগিতামূলক বেতন এবং আকর্ষণীয় কমিশন ভিত্তিক প্রণোদনা। পেশাগত বৃদ্ধি এবং উন্নয়নের সুযোগ। বন্ধুত্বপূর্ণ এবং অন্তর্ভুক্তিমূলক কাজের পরিবেশ। Shelai পণ্যের উপর কর্মচারী ছাড়। Office Location:  Shelai Dhanmondi Satmasjid Outlet 76 Satmasjid Road, Concord Mumtaz Karim heritage (1st floor), Dhanmondi , Dhaka 1205, Bangladesh 01961942986"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20309",
    "job_id": "20309",
    "company_name": "Kashban Academy",
    "job_title": "সিকিউরিটি গার্ড",
    "location": "Dhaka, Farmgate, Badda, Maghbazar, Mirpur",
    "salary": "TK. 9,000-13,000",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-02-05",
    "industry": "Security/Support Service",
    "vacancy": 15,
    "shift": "Other",
    "country": null,
    "company_address": "5th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: One must work hard and take responsibility. Responsibility must be fulfilled according to the rules. One must work/take responsibility for 8 to 10 hours daily. Responsibility must be taken care of in supermarkets, showrooms, booths, factories, and homes.\n\nRequirements: 02 copies of photo, CV, national ID card.\n\nপরিশ্রমী হতে হবে, দায়িত্ব নিয়ে কাজ করতে হবে।যথা নিয়মে দায়িত্ব পালন করতে হবে। দৈনিক 8থেকে 10ঘন্টা কাজ /দায়িত্ব পালন করতে হবে।সুপারশপ, শোরুম, বুথ, কারখানা, বাসায় দায়িত্ব পালন করতে হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20311",
    "job_id": "20311",
    "company_name": "Kashban Academy",
    "job_title": "পিয়ন আবশ্যক",
    "location": "Dhaka, Farmgate, Badda, Maghbazar, Mirpur",
    "salary": "TK. 9,000-10,000",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-02-05",
    "industry": "General Management/Admin",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "5th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Responsibilities must be fulfilled at places like showroom, office, factory, home, booth, market, etc. Effort must be made. The job responsibilities must be fulfilled as per the rules. Responsibilities must be fulfilled within Dhaka. Office rules must be followed.\n\nRequirements: 02 copies of photo, CV, national ID card.\n\nশোরুম, অফিস, কারখানা, বাসা, বুথ, মার্কেট ইত্যাদি স্থানে দায়িত্ব পালন করতে হবে। পরিশ্রম করতে হবে। যথা নিয়মে চাকরি স্থানে দায়িত্ব পালন করতে হবে। ঢাকার ভিতরে দায়িত্ব পালন করতে হবে। অফিসের নিয়ম মানতে হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20315",
    "job_id": "20315",
    "company_name": "Kashban Academy",
    "job_title": "ফেইসবুক পরিচালক আবশ্যক",
    "location": "Dhaka, Badda, Maghbazar, Mirpur, Rampura",
    "salary": "TK. 9,000-14,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-02-05",
    "industry": "Sales/Marketing",
    "vacancy": 12,
    "shift": "Other",
    "country": null,
    "company_address": "5th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Facebook management must be done. Orders must be confirmed. Live videos must be done on Facebook. Beautiful language style must be maintained. It must be managed with the showroom/online shop. The job spot must be kept clean and tidy. In short, all work must be done correctly.\n\nRequirements: 02 copies of photo, CV, and national ID card photocopy.\n\nফেইসবুক পরিচালনা করতে হবে। অর্ডার নিশ্চিত করতে হবে। ফেসবুকে লাইভ ভিডিও করতে হবে।সুন্দর বাচনভঙ্গি থাকতে হবে। শোরুম /অনলাইন শপের সাথে মানিয়ে নিতে হবে। জব স্পট পরিষ্কার পরিছন্ন রাখতে হবে। এক কথায় সঠিক ভাবে সব কাজ করতে হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20316",
    "job_id": "20316",
    "company_name": "Kashban Academy",
    "job_title": "মহিলা কর্মী (প্যাকেজিং )আবশ্যক",
    "location": "Farmgate",
    "salary": "TK. 7,000-9,000",
    "experience": "Fresher",
    "education": "< Class 8",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-02-05",
    "industry": "Warehouse",
    "vacancy": 12,
    "shift": "Other",
    "country": null,
    "company_address": "5th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Products need to be prepared for packing. Must be hardworking. Must fulfill responsibilities. Must work in the office. Even if there is no experience in the past, it will be fine. Responsibilities must be fulfilled by coming to the Fahrenheit area of Tejgaon Thana in Dhaka district.\n\nRequirements: 02 copies of photo, CV, National ID card.\n\nপণ্য প্রস্তুত করে প্যাকিং করতে হবে। পরিশ্রমী হতে হবে। দায়িত্ব পালন করতে হবে। অফিসে এসে কাজ করতে হবে। অতীতে অভিজ্ঞতা না থাকলেও হবে। ঢাকা জেলার তেজগাঁও থানার ফার্মগেট -এ এসে দায়িত্ব পালন করতে হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20312",
    "job_id": "20312",
    "company_name": "Kashban Academy",
    "job_title": "Account holder/হিসাব রক্ষক আবশ্যক",
    "location": "Dhaka, Farmgate, Banani, Maghbazar, Mirpur",
    "salary": "TK. 15,000-20,000",
    "experience": "6 months - 1 year",
    "education": "Masters/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-02-05",
    "industry": "Accounts/Finance/Audit",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "5th floor,Farmview super market,Farmgate,tejgaon,dhaka-1215",
    "job_description": "Responsibilities: Responsibilities must be fulfilled in the factory, office, and showroom. Proper accounting must be done for the number of products manufactured and sold. One must work hard. Office rules must be followed. Handwriting must be good.\n\nRequirements: 02 copies of photo, CV, and National ID card.\n\nকারখানা, অফিস, শোরুমে দায়িত্ব পালন করতে হবে। কতটি পণ্য তৈরী হল, কতটি পণ্য বিক্রয় হল তার হিসাব যথাযত নিয়মে করতে হবে। কঠোর পরিশ্রমী হতে হবে। অফিসের নিয়ম মেনে চলতে হবে। হাতের লেখা ভাল হতে হবে।"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19854",
    "job_id": "19854",
    "company_name": "One World International Travel and Tours",
    "job_title": "টিকেট রিজার্ভেশন অফিসার",
    "location": "Dhaka",
    "salary": "বেতন আলোচনা সাপেক্ষে",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-01-18",
    "industry": "Hospitality/ Travel/ Tourism",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Paltan, Dhaka",
    "job_description": "Responsibilities: Experienced personnel will be hired for ticket reservation in our travel agency. They must have expertise in GDS systems (Amadeus/Galileo/Sabre, etc.). 🔹 Job Responsibilities Reserving, issuing, and re-issuing air tickets using GDS Checking flight options and fares according to customer preferences Processing ticket cancellations/refunds Providing answers to all customer queries related to tickets Maintaining bookings and records accurately Providing reports to the team and management 🔹 Qualifications Must have practical experience working in GDS systems (Amadeus/Galileo/Sabre) Prior work experience in a travel agency will be an advantage Excellent communication skills and customer handling abilities Proficient in basic computer and internet usage Age: 20 - 35 years\n\nআমাদের ট্রাভেল এজেন্সিতে টিকেট রিজার্ভেশন এর জন্য অভিজ্ঞ জনবল নিয়োগ দেওয়া হবে। যার GDS (Amadeus / Galileo / Sabre ইত্যাদি) সিস্টেমে দক্ষতা থাকতে হবে। 🔹 কাজের দায়িত্বসমূহ GDS ব্যবহার করে এয়ার টিকেট রিজার্ভেশন, ইস্যু ও রি-ইস্যু করা কাস্টমারের চাহিদা অনুযায়ী ফ্লাইট অপশন ও ভাড়া চেক করে দেওয়া টিকেট ক্যানসেল/রিফান্ড প্রসেস করা কাস্টমারদের টিকেট সংক্রান্ত সকল প্রশ্নের উত্তর দেওয়া বুকিং ও রেকর্ড সঠিকভাবে মেইনটেইন করা টিম ও ম্যানেজমেন্টকে রিপোর্ট প্রদান 🔹 যোগ্যতা GDS (Amadeus/Galileo/Sabre) সিস্টেমে কাজের বাস্তব অভিজ্ঞতা থাকতে হবে ট্রাভেল এজেন্সিতে পূর্বে কাজের অভিজ্ঞতা অগ্রাধিকার দেওয়া হবে ভালো যোগাযোগ দক্ষতা ও কাস্টমার হ্যান্ডলিংয়ে পারদর্শী বেসিক কম্পিউটার ও ইন্টারনেট ব্যবহারে দক্ষ বয়স: ২০ – ৩৫ বছর"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20239",
    "job_id": "20239",
    "company_name": "Shomvob Global",
    "job_title": "Mason (মেশন) - অ্যান্টিগা, (সেন্ট্রাল আমেরিকা, ক্যারিবীয় দ্বীপ)",
    "location": "Antigua and Barbuda",
    "salary": "TK. 120,000-125,000",
    "experience": "3-5 years",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-02-01",
    "industry": "Construction",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": "Antigua and Barbuda",
    "company_address": "Baridhara DOHS, House 486 Road No. 8, Dhaka 1212",
    "job_description": "Responsibilities: Antigua, (Central America, Caribbean Islands) Brief Introduction Antigua and Barbuda (English: Antigua and) is an independent island nation located in the eastern part of the Caribbean Sea. The country consists of three neighboring islands located in the middle of the Leeward Islands - Antigua, Barbuda, and Redonda. Compared to other Caribbean countries, Antigua and Barbuda are relatively more economically prosperous. The islands attract millions of tourists each year, and the country's economy heavily relies on tourism. It is a safe and legal destination for foreign workers, offering regular salaries, a good working environment, and affordable cost of living for foreign workers. Field: Construction of private villas and condominiums Position: Mason Number of Positions: 10 Responsibilities: Construction of walls using bricks, blocks, and concrete Mixing and laying cement as per the level Structural framework as per the plan Coordinate work with the team on the construction site Requirements: Age: 21-40 years. Language: Must be able to speak and understand English fluently. Candidates must submit a video demonstrating their skills in their respective field; they must also provide training and experience certificates related to the job. 3-5 years of practical experience in the relevant field is necessary. Candidates must be mentally calm, patient, and adaptable in behavior. Passport must be valid for at least 1 year. Benefits: Salary: USD 1,000 per month; 6 days a week Accommodation: Free; Transportation: Free Food: Self-sponsored Work Permit: Provided Payment Terms: Payment after obtaining visa Comparatively lower visa processing fees Contract Duration: 12 months; Renewable based on terms. Deadline for file submission: 06 February, 2026 Delegate Interview: 08 February, 2026 (Online)\n\nঅ্যান্টিগা, (সেন্ট্রাল আমেরিকা, ক্যারিবীয় দ্বীপ) সম্পর্কে সংক্ষিপ্ত পরিচিতি অ্যান্টিগা ও বার্বুডা (ইংরেজি: Antigua and) ক্যারিবীয় সাগরের পূর্ব প্রান্তে অবস্থিত একটি স্বাধীন দ্বীপরাষ্ট্র। রাষ্ট্রটি মূলত লিওয়ার্ড দ্বীপপুঞ্জের মধ্যভাগে অবস্থিত তিনটি প্রতিবেশী দ্বীপ অ্যান্টিগা, বার্বুডা এবং রেডন্ডা নিয়ে গঠিত। ক্যারিবীয় দেশগুলির মধ্যে অ্যান্টিগা ও বার্বুডা তুলনামূলকভাবে অর্থনৈতিকভাবে বেশি সমৃদ্ধ। দ্বীপগুলিতে প্রতি বছর লক্ষ লক্ষ পর্যটক বেড়াতে আসেন, এবং দেশটির অর্থনীতি পর্যটনের উপর নির্ভরশীল। এটি একটি নিরাপদ ও বৈধ বিদেশি কর্মসংস্থানের গন্তব্য, যেখানে নিয়মিত বেতন, ভালো কাজের পরিবেশ এবং বিদেশি কর্মীদের জন্য সহনীয় জীবনযাত্রার খরচ রয়েছে। খাত: প্রাইভেট ভিলা ও কন্ডোমিনিয়াম নির্মান পদঃ Mason (মেশন) পদসংখ্যা: ১০ জন কাজের দায়িত্ব: ইট, ব্লক ও কংক্রিট দিয়ে দেয়াল নির্মাণ সিমেন্ট মিক্সিং ও লেভেল অনুযায়ী কাজ প্ল্যান অনুযায়ী কাঠামো তৈরি নির্মাণ সাইটে টিমের সাথে সমন্বয় করে কাজ আবশ্যকঃ বয়স: ২১–৪০ বছর। ভাষাঃ ইংরেজিতে সাবলীলভাবে কথা বলতে ও বুঝতে পারতে হবে। প্রার্থীকে অবশ্যই নিজ কাজের স্কিল দেখানো একটি ভিডিও জমা দিতে হবে; সাথে উক্ত কাজের দক্ষতার ট্রেইনিং ও অভিজ্ঞতার সার্টিফিকেট পাঠাতে হবে। সংশ্লিষ্ট কাজে ৩-৫ বছর বাস্তব অভিজ্ঞতা আবশ্যক। প্রার্থীকে মানসিকভাবে অবশ্যই শান্ত ও"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20240",
    "job_id": "20240",
    "company_name": "Shomvob Global",
    "job_title": "Plumber (প্লাম্বার) - অ্যান্টিগা, (সেন্ট্রাল আমেরিকা, ক্যারিবীয় দ্বীপ)",
    "location": "Antigua and Barbuda",
    "salary": "TK. 120,000-125,000",
    "experience": "3-5 years",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-02-01",
    "industry": "Construction",
    "vacancy": 7,
    "shift": "Day Shift",
    "country": "Antigua and Barbuda",
    "company_address": "Baridhara DOHS, House 486 Road No. 8, Dhaka 1212",
    "job_description": "Responsibilities: Introduction to Antigua (Central America, Caribbean Islands) Antigua and Barbuda (English: Antigua and) is an independent island nation located in the eastern part of the Caribbean Sea. The nation consists of three neighboring islands located in the middle of the Leeward Islands - Antigua, Barbuda, and Redonda. Compared to other Caribbean countries, Antigua and Barbuda are relatively more economically prosperous. The islands attract millions of tourists each year, and the country's economy heavily relies on tourism. It is a safe and legal destination for foreign workers, offering regular salaries, a good working environment, and affordable cost of living for expatriates. Position: Plumber Number of Positions: 7 Job Responsibilities: Installation of water pipes, drainage, and sanitary lines Working on bathroom and kitchen fittings Repairing pipe leaks and blockage issues Repair work on new and old lines Requirements: Age: 21-40 years. Must be able to speak and understand English fluently. Candidates must submit a video demonstrating their skills in the specified job, along with training and experience certificates. 3-5 years of practical experience in the relevant field is necessary. Candidates must be mentally calm, patient, and adaptable. Passport must be valid for at least 1 year. Benefits: Salary: USD 1,000 per month; 6 days a week Accommodation: Free; Transportation: Free Food: Self-funded Work Permit: Provided Payment Terms: Payment after obtaining visa Comparatively low visa processing costs Contract Duration: 12 months; Renewable based on conditions Deadline for File Submission: 06 February, 2026 Delegate Interview: 08 February, 2026 (Online)\n\nঅ্যান্টিগা, (সেন্ট্রাল আমেরিকা, ক্যারিবীয় দ্বীপ) সম্পর্কে সংক্ষিপ্ত পরিচিতি অ্যান্টিগা ও বার্বুডা (ইংরেজি: Antigua and) ক্যারিবীয় সাগরের পূর্ব প্রান্তে অবস্থিত একটি স্বাধীন দ্বীপরাষ্ট্র। রাষ্ট্রটি মূলত লিওয়ার্ড দ্বীপপুঞ্জের মধ্যভাগে অবস্থিত তিনটি প্রতিবেশী দ্বীপ অ্যান্টিগা, বার্বুডা এবং রেডন্ডা নিয়ে গঠিত। ক্যারিবীয় দেশগুলির মধ্যে অ্যান্টিগা ও বার্বুডা তুলনামূলকভাবে অর্থনৈতিকভাবে বেশি সমৃদ্ধ। দ্বীপগুলিতে প্রতি বছর লক্ষ লক্ষ পর্যটক বেড়াতে আসেন, এবং দেশটির অর্থনীতি পর্যটনের উপর নির্ভরশীল। এটি একটি নিরাপদ ও বৈধ বিদেশি কর্মসংস্থানের গন্তব্য, যেখানে নিয়মিত বেতন, ভালো কাজের পরিবেশ এবং বিদেশি কর্মীদের জন্য সহনীয় জীবনযাত্রার খরচ রয়েছে। খাত: প্রাইভেট ভিলা ও কন্ডোমিনিয়াম নির্মান পদঃ Plumber (প্লাম্বার) পদসংখ্যা: ৭ জন কাজের দায়িত্ব: পানির পাইপ, ড্রেনেজ ও স্যানিটারি লাইন স্থাপন বাথরুম ও কিচেন ফিটিং কাজ করা পাইপ লিকেজ ও ব্লক সমস্যা সমাধান নতুন ও পুরাতন লাইনের রিপেয়ার কাজ আবশ্যকঃ বয়স: ২১–৪০ বছর। ভাষাঃ ইংরেজিতে সাবলীলভাবে কথা বলতে ও বুঝতে পারতে হবে। প্রার্থীকে অবশ্যই নিজ কাজের স্কিল দেখানো একটি ভিডিও জমা দিতে হবে; সাথে উক্ত কাজের দক্ষতার ট্রেইনিং ও অভিজ্ঞতার সার্টিফিকেট পাঠাতে হবে। সংশ্লিষ্ট কাজে ৩-৫ বছর বাস্তব অভিজ্ঞতা আবশ্যক। প্রার্থীকে মানসিকভাবে অবশ্যই শান্ত ও সহনশীল হতে হবে এবং ব্যবহার মার্জিত হতে হবে। পাসপোর্ট এর মেয়াদ নূন্যতম ১ বছর হতে হবে। সুবিধাসমূহঃ বেতন: USD ১,০০০ / মাস; সপ্তাহে ৬ দ"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20242",
    "job_id": "20242",
    "company_name": "Shomvob Global",
    "job_title": "Carpenter (কার্পেন্টার) - অ্যান্টিগা, (সেন্ট্রাল আমেরিকা, ক্যারিবীয় দ্বীপ)",
    "location": "Antigua and Barbuda",
    "salary": "TK. 120,000-125,000",
    "experience": "3-5 years",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-02-01",
    "industry": "Technician",
    "vacancy": 16,
    "shift": "Day Shift",
    "country": "Antigua and Barbuda",
    "company_address": "Baridhara DOHS, House 486 Road No. 8, Dhaka 1212",
    "job_description": "Responsibilities: Antigua, (Central America, Caribbean Islands) Brief Introduction Antigua and Barbuda (English: Antigua and) is an independent island nation located in the eastern part of the Caribbean Sea. The country consists of three main regions, Antigua, Barbuda, and Redonda, situated in the middle of the Leeward Islands. Compared to other Caribbean countries, Antigua and Barbuda are relatively more economically prosperous. Each year, millions of tourists visit the islands, and the country's economy heavily relies on tourism. It is a safe and legal destination for foreign workers, offering regular salaries, a good working environment, and affordable living expenses for foreign workers. Field: Construction of private villas and condominiums Position: Carpenter Number of Positions: 16 Responsibilities: Constructing and installing wooden doors, windows, frames, and furniture Completing woodwork based on blueprints and designs Cutting, fitting, finishing, and repairing wood Following safety regulations on-site Requirements: Age: 21-40 years Language: Must be able to speak and understand English fluently Candidates must submit a video showcasing their woodworking skills; training and experience certificates in the relevant field must be provided. 3-5 years of practical experience in relevant work is necessary Candidates must be mentally calm, patient, and adaptable, and must have a clean record. Passport must be valid for at least 1 year. Benefits: Salary: USD 1,000 / month; 6 days per week Accommodation: Free; Transportation: Free Food: Self-funded Work Permit: Provided Payment Terms: Payment after obtaining visa Visa processing costs will be relatively low Contract Duration: 12 months; Renewable based on performance. Deadline for File Submission: 06 February, 2026 Delegate Interview: 08 February, 2026 (Online)\n\nঅ্যান্টিগা, (সেন্ট্রাল আমেরিকা, ক্যারিবীয় দ্বীপ) সম্পর্কে সংক্ষিপ্ত পরিচিতি অ্যান্টিগা ও বার্বুডা (ইংরেজি: Antigua and) ক্যারিবীয় সাগরের পূর্ব প্রান্তে অবস্থিত একটি স্বাধীন দ্বীপরাষ্ট্র। রাষ্ট্রটি মূলত লিওয়ার্ড দ্বীপপুঞ্জের মধ্যভাগে অবস্থিত তিনটি প্রতিবেশী দ্বীপ অ্যান্টিগা, বার্বুডা এবং রেডন্ডা নিয়ে গঠিত। ক্যারিবীয় দেশগুলির মধ্যে অ্যান্টিগা ও বার্বুডা তুলনামূলকভাবে অর্থনৈতিকভাবে বেশি সমৃদ্ধ। দ্বীপগুলিতে প্রতি বছর লক্ষ লক্ষ পর্যটক বেড়াতে আসেন, এবং দেশটির অর্থনীতি পর্যটনের উপর নির্ভরশীল। এটি একটি নিরাপদ ও বৈধ বিদেশি কর্মসংস্থানের গন্তব্য, যেখানে নিয়মিত বেতন, ভালো কাজের পরিবেশ এবং বিদেশি কর্মীদের জন্য সহনীয় জীবনযাত্রার খরচ রয়েছে। খাত: প্রাইভেট ভিলা ও কন্ডোমিনিয়াম নির্মান পদঃ Carpenter (কার্পেন্টার) পদসংখ্যা: ১৬ জন কাজের দায়িত্ব: কাঠের দরজা, জানালা, ফ্রেম ও ফার্নিচার তৈরি ও ইনস্টল করা ব্লুপ্রিন্ট ও ডিজাইন অনুযায়ী কাঠের কাজ সম্পন্ন করা কাঠ কাটা, ফিটিং, ফিনিশিং ও রিপেয়ার কাজ করা সাইটে নিরাপত্তা নিয়ম মেনে কাজ করা আবশ্যকঃ বয়স: ২১–৪০ বছর ভাষাঃ ইংরেজিতে সাবলীলভাবে কথা বলতে ও বুঝতে পারতে হবে। প্রার্থীকে অবশ্যই নিজ কাজের স্কিল দেখানো একটি ভিডিও জমা দিতে হবে; সাথে উক্ত কাজের দক্ষতার ট্রেইনিং ও অভিজ্ঞতার সার্টিফিকেট পাঠাতে হবে। সংশ্লিষ্ট কাজে ৩-"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20241",
    "job_id": "20241",
    "company_name": "Shomvob Global",
    "job_title": "Electrician (ইলেকট্রিশিয়ান) - অ্যান্টিগা, (সেন্ট্রাল আমেরিকা, ক্যারিবীয় দ্বীপ)",
    "location": "Antigua and Barbuda",
    "salary": "TK. 120,000-125,000",
    "experience": "3-5 years",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-10",
    "date_posted": "2026-02-01",
    "industry": "Technician",
    "vacancy": 8,
    "shift": "Day Shift",
    "country": "Antigua and Barbuda",
    "company_address": "Baridhara DOHS, House 486 Road No. 8, Dhaka 1212",
    "job_description": "Responsibilities: Introduction to Antigua, (Central America, Caribbean Islands) Antigua and Barbuda (English: Antigua and) is an independent island nation located in the eastern part of the Caribbean Sea. The nation consists of three neighboring islands located in the middle of the Leeward Islands: Antigua, Barbuda, and Redonda. Compared to other Caribbean countries, Antigua and Barbuda are relatively more economically prosperous. The islands attract millions of tourists each year, and the country's economy heavily relies on tourism. It is a safe and legal destination for foreign workers, offering regular wages, a good working environment, and affordable cost of living for foreign workers. Field: Construction of private villas and condominiums Position: Electrician Number of positions: 8 Responsibilities: Installation of electrical lines on building and construction sites Installation of switches, sockets, DB boards, and light fittings Diagnosis and repair of electrical faults Adherence to safety standards Requirements: Age: 21-40 years Language: Must be able to speak and understand English fluently Candidates must submit a video demonstrating their skills in their respective field; training and experience certificates related to the job must be provided. 3-5 years of practical experience in the relevant field is required Candidates must be mentally calm, patient, and adaptable Passport must be valid for at least 1 year Benefits: Salary: USD 1,000 per month; 6 days a week Accommodation: Free; Transportation: Free Food: Self-funded Work Permit will be provided Payment Terms: Payment after obtaining visa Comparatively low visa processing fees Contract duration: 12 months; Renewable based on performance Deadline for file submission: 06 February, 2026 Delegate Interview: 08 February, 2026 (Online)\n\nঅ্যান্টিগা, (সেন্ট্রাল আমেরিকা, ক্যারিবীয় দ্বীপ) সম্পর্কে সংক্ষিপ্ত পরিচিতি অ্যান্টিগা ও বার্বুডা (ইংরেজি: Antigua and) ক্যারিবীয় সাগরের পূর্ব প্রান্তে অবস্থিত একটি স্বাধীন দ্বীপরাষ্ট্র। রাষ্ট্রটি মূলত লিওয়ার্ড দ্বীপপুঞ্জের মধ্যভাগে অবস্থিত তিনটি প্রতিবেশী দ্বীপ অ্যান্টিগা, বার্বুডা এবং রেডন্ডা নিয়ে গঠিত। ক্যারিবীয় দেশগুলির মধ্যে অ্যান্টিগা ও বার্বুডা তুলনামূলকভাবে অর্থনৈতিকভাবে বেশি সমৃদ্ধ। দ্বীপগুলিতে প্রতি বছর লক্ষ লক্ষ পর্যটক বেড়াতে আসেন, এবং দেশটির অর্থনীতি পর্যটনের উপর নির্ভরশীল। এটি একটি নিরাপদ ও বৈধ বিদেশি কর্মসংস্থানের গন্তব্য, যেখানে নিয়মিত বেতন, ভালো কাজের পরিবেশ এবং বিদেশি কর্মীদের জন্য সহনীয় জীবনযাত্রার খরচ রয়েছে। খাত: প্রাইভেট ভিলা ও কন্ডোমিনিয়াম নির্মান পদঃ Electrician (ইলেকট্রিশিয়ান) পদসংখ্যা: ৮ জন কাজের দায়িত্ব: বিল্ডিং ও কনস্ট্রাকশন সাইটে ইলেকট্রিক লাইন স্থাপন সুইচ, সকেট, DB বোর্ড ও লাইট ফিটিং ইনস্টল করা ইলেকট্রিক ফল্ট ডায়াগনসিস ও রিপেয়ার সেফটি স্ট্যান্ডার্ড মেনে কাজ করা আবশ্যকঃ বয়স: ২১–৪০ বছর। ভাষাঃ ইংরেজিতে সাবলীলভাবে কথা বলতে ও বুঝতে পারতে হবে। প্রার্থীকে অবশ্যই নিজ কাজের স্কিল দেখানো একটি ভিডিও জমা দিতে হবে; সাথে উক্ত কাজের দক্ষতার ট্রেইনিং ও অভিজ্ঞতার সার্টিফিকেট পাঠাতে হবে। সংশ্লিষ্ট কাজে ৩-৫ বছর বাস্তব অভিজ্ঞতা আবশ্যক। প্রার্থ"
  }
]