[
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19708",
    "job_id": "19708",
    "company_name": "Forces Courier Ltd",
    "job_title": "Senior Merchant Acquisition Executive (Courier)",
    "location": "Mirpur",
    "salary": "TK. 30,000-45,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-12",
    "industry": "Sales/Marketing",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "241/1/C, South Pirerbagh 1216 Mirpur, Bangladesh",
    "job_description": "Responsibilities: **Job Context**\n\nForces Courier is looking for a skilled Merchant Acquisition Executive to ensure high-quality merchant onboarding and B2B client acquisition. The candidate must have experience in field-based acquisition, merchant conversion, and relationship management.\n\n**Responsibilities**\n\n- Identify and approach potential high-volume merchants\n- Complete merchant onboarding by presenting courier services\n- Maintain communication and relationships with corporate and SME sellers\n- Manage acquisition pipeline, follow-ups, and daily reporting\n- Convert merchants by conducting competitor market analysis\n- Conduct field visits, meetings, and negotiations\n\nRequirements: Requirements тЧП Minimum Bachelor's Degree тЧП At least 2 years of experience in Courier/Logistics or B2B sales тЧП Strong communication, negotiation, and conversion skills тЧП Enthusiastic about field-based work тЧП Target-driven and self-motivated тЧП Advantageous to have skills in Google Sheet/CRM usage Skills & Expertise тЧП Merchant Acquisition тЧП B2B Sales тЧП Negotiation & Closing тЧП Client Relationship тЧП Market Knowledge (Courier/Logistics) Salary & Benefits тЧП Negotiable Salary тЧП Performance Bonus тЧП 2 Festival Bonuses тЧП Mobile & Travel Allowance тЧП Career Growth Opportunity тЧП Field + Office Work Model Job Status & Workplace тЧП Work at Office (Mirpur) + Field Activities\n\nJob Context Forces Courier ржЙржЪрзНржЪржорж╛ржирзЗрж░ merchant onboarding ржПржмржВ B2B client acquisition ржирж┐рж╢рзНржЪрж┐ржд ржХрж░рждрзЗ ржПржХржЬржи ржжржХрзНрж╖ Merchant Acquisition Executive ржЦрзБржБржЬржЫрзЗред ржкрзНрж░рж╛рж░рзНржерзАржХрзЗ field-based acquisition, merchant conversion ржПржмржВ relationship managementтАУржП ржЕржнрж┐ржЬрзНржЮ рж╣рждрзЗ рж╣ржмрзЗред Responsibilities тЧП рж╕ржорзНржнрж╛ржмрзНржп high-volume merchants рж╕ржирж╛ржХрзНржд ржУ approach ржХрж░рж╛ тЧП Courier services ржЙржкрж╕рзНржерж╛ржкржи ржХрж░рзЗ merchant onboarding рж╕ржорзНржкржирзНржи ржХрж░рж╛ тЧП Corporate ржУ SME sellerржжрзЗрж░ рж╕рж╛ржерзЗ ржпрзЛржЧрж╛ржпрзЛржЧ ржУ relationship ржмржЬрж╛рзЯ рж░рж╛ржЦрж╛ тЧП Acquisition pipeline, follow-up ржПржмржВ ржжрзИржирж┐ржХ рж░рж┐ржкрзЛрж░рзНржЯрж┐ржВ ржкрж░рж┐ржЪрж╛рж▓ржирж╛ ржХрж░рж╛ тЧП Competitor market analysis ржХрж░рзЗ merchant conversion ржХрж░рж╛ тЧП Field visit, meeting ржПржмржВ negotiation ржХрж░рж╛"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19749",
    "job_id": "19749",
    "company_name": "Skyline IT Institute",
    "job_title": "Customer Relationship Executive",
    "location": "Mirpur",
    "salary": "TK. 10,000-13,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-13",
    "industry": "Call Center",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "East Shewrapara, Metro Rail Station, Pillar no 318, House no 846, B1-2nd Floor,Mirpur, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Skyline IT Institute is looking for a motivated and talented Customer Relationship Executive to join our growing team. This role is crucial in managing client interactions, converting leads into successful clients, and ensuring an outstanding customer experience throughout their journey with us.\n\nЁЯФ╣ Key Responsibilities:\n- Lead Management:\nFollow up with potential clients and convert inquiries into appointments or consultations.\n\n- Client Relationship Management:\nBuild and maintain strong, long-term relationships with clients.\n\n- Understand client needs and provide exceptional support at every touchpoint.\n\n- Ensure customer satisfaction through effective communication and follow-ups.\n\nRequirements: - Currently continuing Honours studies\n- Proficient in computer office applications\n- Good command of English (written & spoken)\n- Excellent communication and strong interpersonal skills\n- Ability to manage, follow up, and convert leads effectively\n- Office Hours: Sunday - Friday (10:00 AM - 6:00 PM)\n- Salary: 10,000 BDT + Extra Commission\n\nSkyline IT Institute is looking for a motivated and talented Customer Relationship Executive to join our growing team. This role is crucial in managing client interactions, converting leads into successful clients, and ensuring an outstanding customer experience throughout their journey with us. ЁЯФ╣ Key Responsibilities: Lead Management: Follow up with potential clients and convert inquiries into appointments or consultations. Client Relationship Management: Build and maintain strong, long-term relationships with clients. Understand client needs and provide exceptional support at every touchpoint. Ensure customer satisfaction through effective communication and follow-ups."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19803",
    "job_id": "19803",
    "company_name": "Future Cloud Bangladesh Ltd",
    "job_title": "Global Process Coordinator - Night Shift",
    "location": "Banani",
    "salary": "TK. 30,000-50,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "Call Center",
    "vacancy": 10,
    "shift": "Night Shift",
    "country": null,
    "company_address": "Banani, Dhaka",
    "job_description": "Responsibilities: Future Cloud Bangladesh Limited (FCBL) is a well-known multinational ITES company that has been in operation for over 11 years. We are pleased to offer full-time job opportunities for potential candidates who are willing to work night shifts. Male candidates are encouraged to apply for the available positions. FCBL provides an excellent workplace located in the heart of Banani for male staff.\n\nJob Responsibilities\n\n- Executing daily voice operations and generating high-quality warm leads through outbound telemarketing campaigns.\n- Operating specialized North American real estate management initiatives, focusing on portfolio onboarding and management.\n- Reviewing daily performance reports to identify discrepancies, revenue leakages, and operational errors for presentation to management.\n- Liaising with probationary personnel to identify performance obstacles and facilitate cultural integration.\n- Identifying and resolving interpersonal or departmental conflicts and providing strategic recommendations.\n- Researching psychological motivation and emotional triggers to develop engagement methodologies for diverse team environments.\n- Conducting internal audits to maintain high standards for stakeholder collaboration.\n\nEmployment Status\nFull-time\n\nJob Location\nDhaka\n\nCompensation & Other Benefits\n\n- On-time salary\n- Monthly and yearly recreation based on performance\n- Unlimited NESCAF├Й\n- Yearly 10 paid holidays and 15 casual paid leaves\n- Loan facilities for all employees, including probationary employees\n- 35% discount in Ibn Sina Hospital for employees, their parents, spouses, and children\n- Company-sponsored 3 annual programs\n\nRead Before Apply\n\nGo to https://online-voice-recorder.com and record your voice for at least 2-3 minutes with an introduction about yourself, your education, experience, expertise, family, friends, hobbies, etc. The recording must be in English. Save the audio file and send an email to apply@futurecloudbd.com with your resume and the audio recording attached. The voice recording is to verify your English speaking fluency, so do your best in the audio recording.\n\nRequirements: Educational Requirements\n\n- Fresh graduates and last-semester students can apply.\n- Educational requirements can be relaxed if there is over 1 year of experience in a BPO/international call center.\n- Minimum 1 Year experience.\n\nFuture Cloud Bangladesh Limited (FCBL) is a reputed multinational ITES company operating for over 11 years. We are pleased to offer full-time job opportunities for potential candidates willing to work at night shift. Males are encouraged to apply for the same position. FCBL has an amazing workplace at the heart of the town, Banani, for male staff. Job Responsibilities Executing daily voice operations and successfully generating high-quality warm leads across multiple outbound telemarketing campaigns. Improving and operating specialized North American real estate management initiatives, primarily focusing on initi"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19758",
    "job_id": "19758",
    "company_name": "Shomvob Technologies Ltd.",
    "job_title": "Assistance - Apprenticeship program",
    "location": "Mymensingh",
    "salary": "TK. 10,000",
    "experience": "Fresher",
    "education": "Diploma/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-13",
    "industry": "Garments - Production/Operator/Technician",
    "vacancy": 100,
    "shift": "Other",
    "country": null,
    "company_address": "DOHS BARIDHARA , DHAKA",
    "job_description": "Responsibilities: Program Details:\nApprenticeship Duration: 6 months\nExtension of Period: Not applicable\nDuty Assignment: Roster-wise\nMonthly Allowance: BDT 10,000\nMonthly Deduction: BDT 750\nFacilities: One meal will be provided during the assigned shift\nJob Location: Bhaluka, Mymensingh\nCandidate Preferences:\nRecently passed-out Diploma students\nCandidates willing to relocate near the factory\nDuty Shifts:\nShift A: 6:00 AM тАУ 2:00 PM\nShift B: 2:00 PM тАУ 10:00 PM\nShift C: 10:00 PM тАУ 6:00 AM\n\nProgram Details: Apprenticeship Duration: 6 months Extension of Period: Not applicable Duty Assignment: Roster-wise Monthly Allowance: BDT 10,000 Monthly Deduction: BDT 750 Facilities: One meal will be provided during the assigned shift Job Location: Bhaluka, Mymensingh Candidate Preferences: Recently passed-out Diploma students Candidates willing to relocate near the factory Duty Shifts: Shift A: 6:00 AM тАУ 2:00 PM Shift B: 2:00 PM тАУ 10:00 PM Shift C: 10:00 PM тАУ 6:00 AM"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20293",
    "job_id": "20293",
    "company_name": "MedBox",
    "job_title": "Marketing Representatives ",
    "location": "Shegunbagicha",
    "salary": "TK. 20,000-25,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-02-05",
    "industry": "Sales/Marketing",
    "vacancy": 20,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Segunbagicha,Ramna, Dhaka-1000",
    "job_description": "Responsibilities: тЬЕ Requirements: Minimum 3 years experience (Medicine/Pharma background preferred) Graduate in Marketing or related field Strong communication & sales skills\n\nЁЯУК Reporting To : Head of Sales\n\nЁЯТ░ Salary & Benefits: BDT 20,000 - 25,000 (Based on experience) TA & DA bill Provident Fund Insurance coverage after confirmation\n\nтЬЕ Requirements: Minimum 3 years experience (Medicine/Pharma background preferred) Graduate in Marketing or related field Strong communication & sales skills ЁЯУК Reporting To : Head of Sales ЁЯТ░ Salary & Benefits: BDT 20,000 тАУ 25,000 (Based on experience) TA & DA bill Provident Fund Insurance coverage after confirmation"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19797",
    "job_id": "19797",
    "company_name": "MIlvik Bangladesh Limited",
    "job_title": "Field Sales Associate",
    "location": "Anywhere in Dhaka Division, Dhanmondi, Old Dhaka, Mohammadpur, Jatrabari",
    "salary": "TK. 11,500-18,100",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "Sales/Marketing",
    "vacancy": 99,
    "shift": "Day Shift",
    "country": null,
    "company_address": "MS Center, 8th & 9th Floor, 8 Bir Uttam AK Khandakar Road, Mohakhali C/A, Dhaka 1212",
    "job_description": "Responsibilities: Job Type: 1. Team-based sales in a specific area at the booth. 2. Present service information clearly to pedestrians and potential customers. 3. Assist in selecting appropriate packages according to customer demands. 4. Inform customers about pre-sales and after-sales services. 5. Transfer membership cards by explaining terms and conditions at each sale.\n\nRequirements: Position Location (a specific area): Dhaka North: Mohakhali, Mirpur, Dhanmondi, Gulshan, Tejgaon, Badda, Hatirjheel, Basundhara, Farmgate, Shamoli, Kalyanpur Dhaka South: Jatrabari, Mugda, Sutrapur, Puran Dhaka, Azimpur, Gulistan, Paltan, Motijheel, Sadarghat, Khilgaon, Narayanganj Dhaka Outer: Savar, Manikganj, Narayanganj, Gazipur, Mymensingh Qualifications: HSC or Bachelor's degree, 6 months of sales experience (freshers applicable) Age: 19+ After confirmation Salary and Benefits: - Basic: 11,500 - 12,000 Taka - Allowance and Commission: 2,600 + 3,000-25,000 Taka - 2 Eid bonuses, increment - Health benefits, telemedicine, life insurance\n\nржХрж╛ржЬрзЗрж░ ржзрж░ржи: 1. ржирж┐рж░рзНржжрж┐рж╖рзНржЯ ржПрж░рж┐ржпрж╝рж╛ржпрж╝ ржмрзБржерзЗ ржжрж▓ржЧрждржнрж╛ржмрзЗ рж╕рзЗрж▓рж╕ред 2. ржкржержЪрж╛рж░рзА ржУ рж╕ржорзНржнрж╛ржмрзНржп ржХрж╛рж╕рзНржЯржорж╛рж░ржжрзЗрж░ ржХрж╛ржЫрзЗ ржЧрж┐ржпрж╝рзЗ рж╕рж╛рж░рзНржнрж┐рж╕ рж╕ржорзНржкрж░рзНржХрзЗ рж╕рзНржкрж╖рзНржЯржнрж╛ржмрзЗ рждржерзНржп ржЙржкрж╕рзНржерж╛ржкржи ржХрж░рж╛ред 3. ржХрж╛рж╕рзНржЯржорж╛рж░ржжрзЗрж░ ржЪрж╛рж╣рж┐ржжрж╛ ржЕржирзБржпрж╛ржпрж╝рзА ржЙржкржпрзБржХрзНржд ржкрзНржпрж╛ржХрзЗржЬ ржмрзЗржЫрзЗ ржирж┐рждрзЗ рж╕рж╣рж╛ржпрж╝рждрж╛ ржХрж░рж╛ред 4. ржХрж╛рж╕рзНржЯржорж╛рж░ржХрзЗ ржмрж┐ржХрзНрж░ржпрж╝-ржкрзВрж░рзНржм ржУ ржмрж┐ржХрзНрж░ржпрж╝-ржкрж░ржмрж░рзНрждрзА рж╕рзЗржмрж╛ рж╕ржорзНржкрж░рзНржХрзЗ ржЕржмрж╣рж┐ржд ржХрж░рж╛ред 5. ржкрзНрж░рждрж┐ржЯрж┐ ржмрж┐ржХрзНрж░ржпрж╝рзЗрж░ рж╕ржоржпрж╝ рж╢рж░рзНрждрж╛ржмрж▓рзА ржмрзБржЭрж┐ржпрж╝рзЗ ржорзЗржорзНржмрж╛рж░рж╢рж┐ржк ржХрж╛рж░рзНржб рж╣рж╕рзНрждрж╛ржирзНрждрж░ ржХрж░рж╛ред"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19792",
    "job_id": "19792",
    "company_name": "Azman Trader International",
    "job_title": "Sales Representative",
    "location": "Uttara",
    "salary": "TK. 10,000-12,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "Sales/Marketing",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Plot No: 20/6, Road No: 7, Uttara, Dhaka",
    "job_description": "Responsibilities: - Ensure high levels of customer satisfaction through excellent sales service\n- Greet customers as they enter the outlet and offer assistance\n- Provide detailed information about the products and services offered\n- Demonstrate product features and benefits to customers\n- Assist customers in making purchasing decisions by providing expert advice\n- Maintain a clean, organized, and attractive sales floor\n- Achieve sales targets and contribute to the overall success of the outlet\n- Handle customer complaints and resolve issues in a professional manner\n\nEnsure high levels of customer satisfaction through excellent sales service Greet customers as they enter the outlet and offer assistance. Provide detailed information about the products and services offered. Demonstrate product features and benefits to customers. Assist customers in making purchasing decisions by providing expert advice. Maintain a clean, organized, and attractive sales floor. Achieve sales targets and contribute to the overall success of the outlet. Handle customer complaints and resolve issues in a professional manner."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19738",
    "job_id": "19738",
    "company_name": "Response Ltd",
    "job_title": "Enterprise Sales Officer",
    "location": "Dhaka",
    "salary": "TK. 14,000",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-12",
    "industry": "Sales/Marketing",
    "vacancy": 20,
    "shift": "Other",
    "country": null,
    "company_address": "Banglalink Regional Office, Saiham Skyview Towar Lift (3) 45,Bijoynagar (Opposite of Hotel 71)",
    "job_description": "Responsibilities: Daily visits to assigned markets are required for selling IoT products like VTS, FWA Router, and device solutions. Acquire new clients and achieve assigned sales targets. Maintain strong relationships with existing clients and ensure client retention. Ensure quality sales and proper follow-up with customers. Prepare sales reports and maintain required documentation. ЁЯОУ Educational Requirements: Minimum Graduate (B. COM, HSC, or equivalent candidates may also be considered). Field sales experience will be an advantage. Fresh graduates are welcome to apply (training will be provided). ЁЯза Required Skills: Strong communication and negotiation skills. Smart, energetic, and target-oriented mindset. Ability to work in the field and meet sales goals. ЁЯТ░ Salary & Compensation: Fixed Salary: BDT 14,000. Mobile Allowance: BDT 3,600. KPI: BDT 7,000. Incentives: 20,000+ (based on performance). TA: BDT 2,600. ЁЯОБ Other Benefits: Two festival bonuses. Sales incentives. Health insurance. Long-term service benefits. Mobile credit as per company policy. Monthly earning opportunity based on performance. ЁЯУН Job Locations: Moghbazar, Tejgaon, Keraniganj, Lalbagh, Jatrabari, Kodomtoli, Dohar, Bikrompur, Narayanganj, Dhanmondi.\n\nDaily visit required assigned market for selling IoT product's like (VTS, FWA Router) and Device solutions. Acquire new clients and achieve assigned sales targets Maintain strong relationships with existing clients and ensure client retention Ensure quality sales and proper follow-up with customers Prepare sales reports and maintain required documentation ЁЯОУ Educational Requirements: Minimum Graduate (B. COM,HSC or equivalent candidates may also be considered) Field sales experience will be an advantage Fresh graduates are welcome to apply (training will be provided) ЁЯза Required Skills: Strong communication and negotiation skills Smart, energetic, and target-oriented mindset Ability to work in the field and meet sales goals ЁЯТ░ Salary & Compensation: Fixed Salary: BDT 14,000 Mobile Allowance: BDT 3,600 KPI: BDT 7,000 Incentives: 20,000+ (based on performance) TA : BDT 2,600 ЁЯОБ Other Benefits: Two festival bonuses Sales incentives Health insurance Long-term service benefits Mobile credit as per company policy Monthly earning opportunity based on performance ЁЯУН Job Locations: Moghbazar, Tejgaon, Keraniganj, Lalbagh, Jatrabari, Kodomtoli, Dohar,Bikrompur, Narayanganj, Dhanmondi,"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19753",
    "job_id": "19753",
    "company_name": "Dhaka Poly-Pack Industries Ltd",
    "job_title": "Corporate Sales Manager",
    "location": "Dhaka",
    "salary": "TK. 30,000-40,000",
    "experience": "3-5 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-13",
    "industry": "Sales/Marketing",
    "vacancy": 4,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Hashem Ali Khan Tower, KA-64, Progati Sarani, Shahjadpur, Gulshan, Dhaka",
    "job_description": "Responsibilities: - Develop and manage corporate sales strategies to achieve monthly and annual sales targets.\n- Build and maintain long-term relationships with corporate and B2B clients.\n- Identify new business opportunities, clients, and markets.\n- Conduct client meetings, negotiations, and finalize sales deals.\n- Coordinate with production and delivery teams to ensure timely order fulfillment.\n- Prepare sales reports, forecasts, and market analysis for management.\n- Monitor competitor activities and market trends.\n\nRequirements: - Bachelor's degree in Business Administration, Marketing, or a related field.\n- Minimum 3-5 years of experience in corporate/B2B sales (manufacturing or packaging industry preferred).\n- Strong negotiation, communication, and presentation skills.\n- Ability to work under pressure and meet sales targets.\n- Proficiency in MS Office and CRM tools.\n\nDevelop and manage corporate sales strategies to achieve monthly and annual sales targets. Build and maintain long-term relationships with corporate and B2B clients. Identify new business opportunities, clients, and markets. Conduct client meetings, negotiations, and finalize sales deals. Coordinate with production and delivery teams to ensure timely order fulfillment. Prepare sales reports, forecasts, and market analysis for management. Monitor competitor activities and market trends."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19787",
    "job_id": "19787",
    "company_name": "Rong Nagari- рж░ржВ ржиржЧрж░рзА ",
    "job_title": "Customer Sales Executive (E- Commerce)",
    "location": "Rampura",
    "salary": "TK. 8,000-13,000",
    "experience": "1-3 years",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "Sales/Marketing",
    "vacancy": 50,
    "shift": "Day Shift",
    "country": null,
    "company_address": "HOUSE-148/Kha, Power House Mosque Road,West Rampura",
    "job_description": "Responsibilities: - Respond promptly and courteously to customer messages on Facebook Messenger, answering questions and resolving concerns.\n- Confirm and manage orders via WhatsApp, verifying product details, pricing, and delivery information.\n- Handle inbox and WhatsApp sales conversations end-to-end to convert inquiries into confirmed purchases.\n- Explain product features, benefits, and usage clearly to help customers make informed decisions.\n- Record accurate order notes and customer data to maintain organized, searchable records.\n- Prepare and submit daily sales reports summarizing orders, revenue, and key metrics (office-based).\n- Follow up on pending orders and payment confirmations to ensure timely processing and delivery.\n- Coordinate with warehouse and delivery teams to track shipments and resolve fulfillment issues.\n- Maintain a friendly, professional tone in all communications and escalate complex issues to supervisors when necessary.\n\nRequirements: Must have more than 1 year of e-commerce or e-commerce work experience.\n\nRespond promptly and courteously to customer messages on Facebook Messenger, answering questions and resolving concerns. Confirm and manage orders via WhatsApp, verifying product details, pricing, and delivery information. Handle inbox and WhatsApp sales conversations end-to-end to convert inquiries into confirmed purchases. Explain product features, benefits, and usage clearly to help customers make informed decisions. Record accurate order notes and customer data to maintain organized, searchable records. Prepare and submit daily sales reports summarizing orders, revenue, and key metrics (office-based). Follow up on pending orders and payment confirmations to ensure timely processing and delivery. Coordinate with warehouse and delivery teams to track shipments and resolve fulfillment issues. Maintain a friendly, professional tone in all communications and escalate complex issues to supervisors when necessary."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19736",
    "job_id": "19736",
    "company_name": "MetLife (Alamgir Agency)",
    "job_title": "Financial Associate",
    "location": "Khulna",
    "salary": "ржмрзЗрждржи ржЖрж▓рзЛржЪржирж╛ рж╕рж╛ржкрзЗржХрзНрж╖рзЗ",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-14",
    "industry": "Sales/Marketing",
    "vacancy": 50,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Syed Ali Hossain Bhaban(1st floor) 181, Jessore Road  Shib-Bari More khulna-9100",
    "job_description": "Responsibilities: Job Responsibilities Are you confident, ambitious, and eager to build a career? Then there is an amazing opportunity waiting for you! Fast-track your career growth by putting in your hard work and skills into action Financial Associate ----> Unit Manager -----> Branch Manager MetLife (Alamgir Agency) is hiring a number of Financial Associates. ЁЯФ╣ Position: Financial Associate ЁЯФ╣ Number of Positions: Not specified ЁЯФ╣ Job Type: Full-time / Part-time ЁЯФ╣┬аLocation: Tayamun center- 3rd Floor, 181 Jessore Road, Sib Bari More, Khulna-9000 ЁЯФ╣ Age Range: 20-50 years ЁЯФ╣ Qualifications: * Minimum Bachelor's degree (in any subject) * Prior experience in banking or marketing is preferred * Demonstrated mental attitude and communication skills are necessary тАв┬аGood communication and sales skills тАв┬аConfident, internal, and hardworking ЁЯФ╣ Main Responsibilities: тАв┬аEngage with potential clients тАв┬аPresent and sell life insurance plans тАв┬аBuild and maintain long-term client relationships ЁЯФ╣ Salary and Benefits: тАв┬аAttractive bonus and commission тАв┬аOpportunities for foreign travel and training тАв┬аCareer growth based on merit and success тАв┬аOpportunity to work in an international company ЁЯУЮ Contact: я┐╝тБи 01711295023 т╕╗ тЬЕ Special Note: Through this profession, you can not only earn but also build a respectable identity for yourself. Interested candidates, please contact promptly.\n\nржЪрж╛ржХрж░рж┐рж░ ржжрж╛ржпрж╝рж┐рждрзНржмрж╕ржорзВрж╣ ржЖржкржирж┐┬аржХрж┐┬аржЖрждрзНржоржмрж┐рж╢рзНржмрж╛рж╕рзА,┬аржЙржжрзНржпржорзА┬аржПржмржВ┬аржХрзНржпрж╛рж░рж┐рзЯрж╛рж░┬аржЧрзЬрждрзЗ┬аржЖржЧрзНрж░рж╣рзА?┬арждрж╛рж╣рж▓рзЗ┬аржЖржкржирж╛рж░┬аржЬржирзНржп┬арж░рзЯрзЗржЫрзЗ┬аржПржХржЯрж┐┬аржЪржорзОржХрж╛рж░┬арж╕рзБржпрзЛржЧ! ржирж┐ржЬрзЗрж░┬аржкрж░рж┐рж╢рзНрж░ржо┬аржПржмржВ┬аржжржХрзНрж╖рждрж╛┬аржХрж╛ржЬрзЗ┬арж▓рж╛ржЧрж┐рзЯрзЗ┬аржжрзНрж░рзБржд┬аржкржжрзЛржирзНржирждрж┐рж░┬арж╕рзБржпрзЛржЧ ржлрж┐ржирж╛ржирзНрж╕рж┐ржпрж╝рж╛рж▓ ржЕрзНржпрж╛рж╕рзЛрж╕рж┐ржпрж╝рзЗржЯ ----> ржЗржЙржирж┐ржЯ ржорзНржпрж╛ржирзЗржЬрж╛рж░ -----> ржмрзНрж░рж╛ржЮрзНржЪ ржорзНржпрж╛ржирзЗржЬрж╛рж░ MetLife (Alamgir Agency) рждрзЗ┬аржХрж┐ржЫрзБ┬арж╕ржВржЦрзНржпржХ┬аржлрж┐ржирж╛ржирзНрж╕рж┐рзЯрж╛рж▓┬аржЕрзНржпрж╛рж╕рзЛрж╕рж┐рзЯрзЗржЯ┬аржирж┐рзЯрзЛржЧ┬аржжрзЗржУрзЯрж╛┬арж╣ржЪрзНржЫрзЗред ЁЯФ╣ ржкржжрзЗрж░ ржирж╛ржо: ржлрж┐ржирж╛ржирзНрж╕рж┐рзЯрж╛рж▓┬аржЕрзНржпрж╛рж╕рзЛрж╕рж┐рзЯрзЗржЯ ЁЯФ╣ ржкржжрзЗрж░ рж╕ржВржЦрзНржпрж╛: ржирж┐рж░рзНржзрж╛рж░рж┐ржд┬аржирзЯ ЁЯФ╣ ржЪрж╛ржХрж░рж┐рж░ ржзрж░ржг: ржкрзВрж░рзНржгржХрж╛рж▓рзАржи┬а/┬аржЦржгрзНржбржХрж╛рж▓рзАржи ЁЯФ╣ ржХрж░рзНржорж╕рзНржерж▓:┬а Syed Ali Hossain Bhaban(01st floor) 181, Jessore Road,Shib-Bari More khulna-9100(grameenphone building) ЁЯФ╣ ржмрзЯрж╕рж╕рзАржорж╛: рзирзжтАУрзлрзж┬аржмржЫрж░ ЁЯФ╣ ржпрзЛржЧрзНржпрждрж╛: * ржирзНржпрзВржирждржо рж╕рзНржирж╛рждржХ ржбрж┐ржЧрзНрж░рж┐ (ржпрзЗ ржХрзЛржирзЛ ржмрж┐рж╖рзЯрзЗ) * ржмрзНржпрж╛ржВржХрж┐ржВ ржмрж╛ ржорж╛рж░рзНржХрзЗржЯрж┐ржВ-ржП ржкрзВрж░рзНржм ржЕржнрж┐ржЬрзНржЮрждрж╛ ржерж╛ржХрж▓рзЗ ржЕржЧрзНрж░рж╛ржзрж┐ржХрж╛рж░ * ржЗрждрж┐ржмрж╛ржЪржХ ржорж╛ржирж╕рж┐ржХрждрж╛ ржУ ржпрзЛржЧрж╛ржпрзЛржЧ ржжржХрзНрж╖рждрж╛ ржерж╛ржХрж╛ ржЖржмрж╢рзНржпржХ тАв┬аржнрж╛рж▓рзЛ┬аржпрзЛржЧрж╛ржпрзЛржЧ┬аржУ┬аржмрж┐ржХрзНрж░рзЯ┬аржжржХрзНрж╖рждрж╛ тАв┬аржЖрждрзНржоржкрзНрж░рждрзНржпрзЯрзА,┬аржЖржирзНрждрж░рж┐ржХ┬аржУ┬аржкрж░рж┐рж╢рзНрж░ржорзА ЁЯФ╣ ржорзВрж▓ ржжрж╛рзЯрж┐рждрзНржм: тАв┬арж╕ржорзНржнрж╛ржмрзНржп┬аржХрзНрж▓рж╛рзЯрзЗржирзНржЯржжрзЗрж░┬арж╕ржЩрзНржЧрзЗ┬аржпрзЛржЧрж╛ржпрзЛржЧ тАв┬аржЬрзАржмржи┬аржмрзАржорж╛┬аржкрж░рж┐ржХрж▓рзНржкржирж╛┬аржЙржкрж╕рзНржерж╛ржкржи┬аржУ┬аржмрж┐ржХрзНрж░рзЯ тАв┬аржжрзАрж░рзНржШржорзЗрзЯрж╛ржжрзА┬аржХрзНрж▓рж╛рзЯрзЗржирзНржЯ┬арж░рж┐рж▓рзЗрж╢ржи┬арждрзИрж░рж┐┬аржУ┬аржмржЬрж╛рзЯ┬арж░рж╛ржЦрж╛ ЁЯФ╣ ржмрзЗрждржи ржУ рж╕рзБржмрж┐ржзрж╛рж╕ржорзВрж╣: тАв┬аржЖржХрж░рзНрж╖ржгрзАрзЯ┬аржмрзЛржирж╛рж╕┬аржУ┬аржХржорж┐рж╢ржи тАв┬аржмрж┐ржжрзЗрж╢┬аржнрзНрж░ржоржг┬аржУ┬аржЯрзНрж░рзЗржЗржирж┐ржВ┬арж╕рзБржпрзЛржЧ тАв┬аржорзЗржзрж╛┬аржУ┬арж╕рж╛ржлрж▓рзНржпрзЗрж░┬аржнрж┐рждрзНрждрж┐рждрзЗ┬аржХрзНржпрж╛рж░рж┐рзЯрж╛рж░┬аржЧрзНрж░рзЛрже тАв┬аржЖржирзНрждрж░рзНржЬрж╛рждрж┐ржХ┬аржХрзЛржорзНржкрж╛ржирж┐рждрзЗ┬аржХрж╛ржЬ┬аржХрж░рж╛рж░┬арж╕рзБржпрзЛржЧ ЁЯУЮ ржпрзЛржЧрж╛ржпрзЛржЧ: тБи 01711295023 , 01973 811451 т╕╗ тЬЕ ржмрж┐рж╢рзЗрж╖ ржжрзНрж░рж╖рзНржЯржмрзНржп: ржПржЗ ржкрзЗрж╢рж╛рж░ ржорж╛ржзрзНржпржорзЗ ржЖржкржирж┐ рж╢рзБржзрзБ ржЖрзЯржЗ ржирзЯ, ржирж┐ржЬрзЗрж░ ржПржХржЯрж┐ рж╕ржорзНржорж╛ржиржЬржиржХ ржкрж░рж┐ржЪрзЯржУ рждрзИрж░рж┐ ржХрж░рждрзЗ ржкрж╛рж░ржмрзЗржиред ржЖржЧрзНрж░рж╣рзАрж░рж╛ ржжрзНрж░рзБржд ржпрзЛржЧрж╛ржпрзЛржЧ ржХрж░рзБржиред"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19748",
    "job_id": "19748",
    "company_name": "Skyline IT Institute",
    "job_title": "Video Editor",
    "location": "Mirpur",
    "salary": "TK. 15,000-20,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-13",
    "industry": "Graphics/Video Editor",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "East Shewrapara, Metro Rail Station, Pillar no 318, House no 846, B1-2nd Floor,Mirpur, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Job Description: We are looking for a creative and skilled Video Editor who is passionate about visual storytelling and can transform raw footage into engaging video content. The ideal candidate should have strong technical skills, creativity, and the ability to meet deadlines. Key Responsibilities: Editing attractive and professional videos from raw footage Creating promotional videos, social media content, ads, reels, and motion videos Incorporating color correction, sound editing, transitions, and visual effects Using motion graphics, SFX, and basic animation Creating and maintaining video content according to brand guidelines Collaborating with the team and working in coordination to meet set deadlines\n\nRequirements: Proficiency in Adobe Premiere Pro, After Effects, Photoshop & Illustrator Strong skills in color correction, SFX, motion animation, motion ads & storytelling Minimum 1 year of relevant experience Creativity, attention to detail, and ability to meet deadlines\n\nJob Description: We are looking for a creative and skilled Video Editor who is passionate about visual storytelling and can transform raw footage into engaging video content. The ideal candidate should have strong technical skills, creativity, and the ability to meet deadlines. Key Responsibilities: Raw footage ржерзЗржХрзЗ ржЖржХрж░рзНрж╖ржгрзАрзЯ ржУ ржкрзНрж░ржлрзЗрж╢ржирж╛рж▓ ржнрж┐ржбрж┐ржУ ржПржбрж┐ржЯ ржХрж░рж╛ Promotional videos, social media content, ads, reels ржУ motion videos рждрзИрж░рж┐ ржХрж░рж╛ Color correction, sound editing, transitions ржУ visual effects ржпрзБржХрзНржд ржХрж░рж╛ Motion graphics, SFX ржПржмржВ basic animation ржмрзНржпржмрж╣рж╛рж░ ржХрж░рж╛ Brand guideline ржЕржирзБржпрж╛рзЯрзА ржнрж┐ржбрж┐ржУ ржХржиржЯрзЗржирзНржЯ рждрзИрж░рж┐ ржУ ржмржЬрж╛рзЯ рж░рж╛ржЦрж╛ Team-ржПрж░ рж╕рж╛ржерзЗ рж╕ржоржирзНржмрзЯ ржХрж░рзЗ ржХрж╛ржЬ ржХрж░рж╛ ржПржмржВ ржирж┐рж░рзНржзрж╛рж░рж┐ржд deadline ржорзЗржирзЗ ржЪрж▓рж╛"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19790",
    "job_id": "19790",
    "company_name": "Bhuyian tours travels and consultancy",
    "job_title": "Tele Sales Executive",
    "location": "Malibagh",
    "salary": "ржмрзЗрждржи ржЖрж▓рзЛржЪржирж╛ рж╕рж╛ржкрзЗржХрзНрж╖рзЗ",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "IT/Telecommunication",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "83/B, New Circular Road, Mouchak Tower (2nd Floor), Malibag Mor, Dhaka-1217.",
    "job_description": "Responsibilities: ЁЯУв Job Circular Organization Name: Bhuyian Tours Travels and Consultancy ЁЯзСтАНЁЯТ╝ Position Tele Sales Executive ЁЯОУ Educational Qualification From HSC to Master's (any discipline) ЁЯСд Candidate Qualifications тАв Freshers can apply тАв Age: 18 - 35 years ЁЯТ░ Salary and Benefits тАв Salary: Negotiable тАв Other benefits based on performance тП░ Office Hours тАв 10 AM - 7 PM ЁЯУЭ Job Responsibilities тАв Handling inbound and outbound calls тАв Providing answers to customer queries and resolving issues тАв Collecting customer information and updating the database тАв Achieving designated Sales Targets тАв Conducting marketing activities as per office instructions ЁЯУН Office Address тАв Bhuyian Tours Travels Consultancy 80/A, Mauchak Complex, Lift-13, Room: 1402, Malibagh Mor, Dhaka ЁЯУЮ Interested candidates are requested to contact the office directly.\n\nЁЯУв Job Circular ржкрзНрж░рждрж┐рж╖рзНржарж╛ржирзЗрж░ ржирж╛ржо: Bhuyian Tours Travels and Consultancy ЁЯзСтАНЁЯТ╝ ржкржжржмрзА Tele Sales Executive ЁЯОУ рж╢рж┐ржХрзНрж╖рж╛ржЧржд ржпрзЛржЧрзНржпрждрж╛ HSC ржерзЗржХрзЗ MasterтАЩs (ржпрзЗржХрзЛржирзЛ ржмрж┐ржнрж╛ржЧ) ЁЯСд ржкрзНрж░рж╛рж░рзНржерзАрж░ ржпрзЛржЧрзНржпрждрж╛ тАвFreshers ржЖржмрзЗржжржи ржХрж░рждрзЗ ржкрж╛рж░ржмрзЗржи тАвржмрзЯрж╕: рззрзо тАУ рзйрзл ржмржЫрж░ ЁЯТ░ ржмрзЗрждржи ржУ рж╕рзБржмрж┐ржзрж╛ тАвржмрзЗрждржи: ржЖрж▓рзЛржЪржирж╛ рж╕рж╛ржкрзЗржХрзНрж╖рзЗ тАвржкрж╛рж░ржлрж░ржорзНржпрж╛ржирзНрж╕ ржЕржирзБржпрж╛рзЯрзА ржЕржирзНржпрж╛ржирзНржп рж╕рзБржмрж┐ржзрж╛ тП░ ржЕржлрж┐рж╕ рж╕ржорзЯ тАврж╕ржХрж╛рж▓ рззрзжржЯрж╛ тАУ рж╕ржирзНржзрзНржпрж╛ рзн ржЯрж╛ ЁЯУЭ ржХрж╛ржЬрзЗрж░ ржжрж╛рзЯрж┐рждрзНржм тАвржЗржиржмрж╛ржЙржирзНржб ржПржмржВ ржЖржЙржЯржмрж╛ржЙржирзНржб ржХрж▓ рж╣рзНржпрж╛ржирзНржбрзЗрж▓ ржХрж░рж╛ тАвржХрж╛рж╕рзНржЯржорж╛рж░рзЗрж░ ржкрзНрж░рж╢рзНржирзЗрж░ ржЙрждрзНрждрж░ ржжрзЗржУржпрж╝рж╛ ржПржмржВ рж╕ржорж╕рзНржпрж╛ рж╕ржорж╛ржзрж╛ржи ржХрж░рж╛ тАвржХрж╛рж╕рзНржЯржорж╛рж░рзЗрж░ рждржерзНржп рж╕ржВржЧрзНрж░рж╣ ржХрж░рж╛ ржПржмржВ ржбрзЗржЯрж╛ржмрзЗржЬрзЗ ржЖржкржбрзЗржЯ ржХрж░рж╛ тАвржирж┐рж░рзНржзрж╛рж░рж┐ржд Sales Target ржЕрж░рзНржЬржи ржХрж░рж╛ тАвржЕржлрж┐рж╕ ржирж┐рж░рзНржжрзЗрж╢ржирж╛ ржЕржирзБржпрж╛рзЯрзА ржорж╛рж░рзНржХрзЗржЯрж┐ржВ ржХрж╛рж░рзНржпржХрзНрж░ржо ржкрж░рж┐ржЪрж╛рж▓ржирж╛ ржХрж░рж╛ ЁЯУН ржЕржлрж┐рж╕ ржарж┐ржХрж╛ржирж╛ тАвBhuyian Tours Travels Consultancy рзорзж/ржП, ржорзМржЪрж╛ржХ ржХржоржкрзНрж▓рзЗржХрзНрж╕, Lift-13, рж░рзБржо: рззрзкрзжрзи, ржорж╛рж▓рж┐ржмрж╛ржЧ ржорзЛрзЬ, ржврж╛ржХрж╛ ЁЯУЮ ржЖржЧрзНрж░рж╣рзА ржкрзНрж░рж╛рж░рзНржерзАрж░рж╛ рж╕рж░рж╛рж╕рж░рж┐ ржЕржлрж┐рж╕рзЗ ржпрзЛржЧрж╛ржпрзЛржЧ ржХрж░рзБржиред"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19754",
    "job_id": "19754",
    "company_name": "Dhaka Poly-Pack Industries Ltd",
    "job_title": "Graphic Designer",
    "location": "Notun Bajar",
    "salary": "TK. 15,000-20,000",
    "experience": "6 months - 1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-13",
    "industry": "Graphics/Video Editor",
    "vacancy": 3,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Hashem Ali Khan Tower, KA-64, Progati Sarani, Shahjadpur, Gulshan, Dhaka",
    "job_description": "Responsibilities: - Design creative graphics for product packaging, marketing materials, and promotional content.\n- Create designs for social media, brochures, banners, posters, and company branding materials.\n- Collaborate with the marketing and sales teams to develop visual concepts.\n- Ensure all designs align with the company's brand guidelines.\n- Edit and revise designs based on feedback.\n- Prepare final files for print and digital use.\n\nRequirements: - Diploma or Bachelor's degree in Graphic Design or a related field. (1891-1961)\n- Proven experience as a Graphic Designer (portfolio required). (1962-2027)\n- Proficiency in Adobe Photoshop, Illustrator, and other design tools. (2028-2100)\n- Creative mindset with attention to detail. (2101-2147)\n- Ability to manage multiple tasks and meet deadlines. (2148-2202)\n\nDesign creative graphics for product packaging, marketing materials, and promotional content. Create designs for social media, brochures, banners, posters, and company branding materials. Collaborate with the marketing and sales teams to develop visual concepts. Ensure all designs align with the companyтАЩs brand guidelines. Edit and revise designs based on feedback. Prepare final files for print and digital use."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19735",
    "job_id": "19735",
    "company_name": "AR ARTISTRY",
    "job_title": "ржХрж╛ржЯрж┐ржВ ржПржмржВ рж╕рзЗрж▓рж╛ржЗ ржорж╛рж╕рзНржЯрж╛рж░",
    "location": "Khulna, Dhaka",
    "salary": "TK. 20,000-23,000",
    "experience": "1-3 years",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "Tailor",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Shop: 18/a, Ground Floor, Pinkcity Shopping Complex, Gulshan 02",
    "job_description": "Responsibilities: Job Description: Cutting and sewing fabric correctly according to design and measurement Creating and modifying patterns as needed Reducing fabric wastage by skillfully completing cutting and sewing Coordinating work with the tailor and sewing team Ensuring timely delivery of cutting and sewing as per order Checking the quality of fabric Collaborating in cutting based on new designs and trends Keeping the work area clean and organized\n\nRequirements: Qualifications and Experience : 1-2 years of practical experience as a cutting master in a boutique house Skill in cutting and sewing various types of clothing (three-piece, kurta, gown, panjabi, etc.) Ability to work based on measurement understanding and pattern Responsible, punctual, and attentive Salary and Benefits : Monthly Salary: 20,000 - 23,000 Taka Salary determined based on experience and skill\n\nржХрж╛ржЬрзЗрж░ ржжрж╛ржпрж╝рж┐рждрзНржм (Job Description): ржбрж┐ржЬрж╛ржЗржи ржУ ржорзЗржЬрж╛рж░ржорзЗржирзНржЯ ржЕржирзБржпрж╛ржпрж╝рзА ржХрж╛ржкржбрж╝ рж╕ржарж┐ржХржнрж╛ржмрзЗ ржХрж╛ржЯрж┐ржВ ржПржмржВ рж╕рзЗрж▓рж╛ржЗ ржХрж░рж╛ ржкрзНржпрж╛ржЯрж╛рж░рзНржи рждрзИрж░рж┐ ржУ ржкрзНрж░ржпрж╝рзЛржЬржирзЗ рж╕ржВрж╢рзЛржзржи ржХрж░рж╛ ржХрж╛ржкржбрж╝рзЗрж░ ржЕржкржЪржпрж╝ ржХржорж┐ржпрж╝рзЗ ржжржХрзНрж╖рждрж╛рж░ рж╕рж╛ржерзЗ ржХрж╛ржЯрж┐ржВ ржПржмржВ рж╕рзЗрж▓рж╛ржЗ рж╕ржорзНржкржирзНржи ржХрж░рж╛ ржЯрзЗржЗрж▓рж╛рж░ ржУ рж╕рзБржЗржВ ржЯрж┐ржорзЗрж░ рж╕рж╛ржерзЗ рж╕ржоржирзНржмржпрж╝ ржХрж░рзЗ ржХрж╛ржЬ ржХрж░рж╛ ржЕрж░рзНржбрж╛рж░ ржЕржирзБржпрж╛ржпрж╝рзА рж╕ржоржпрж╝ржорждрзЛ ржХрж╛ржЯрж┐ржВ ржПржмржВ рж╕рзЗрж▓рж╛ржЗ ржбрзЗрж▓рж┐ржнрж╛рж░рж┐ ржирж┐рж╢рзНржЪрж┐ржд ржХрж░рж╛ ржлрзНржпрж╛ржмрзНрж░рж┐ржХрзЗрж░ ржЧрзБржгржЧржд ржорж╛ржи ржпрж╛ржЪрж╛ржЗ ржХрж░рж╛ ржирждрзБржи ржбрж┐ржЬрж╛ржЗржи ржУ ржЯрзНрж░рзЗржирзНржб ржЕржирзБржпрж╛ржпрж╝рзА ржХрж╛ржЯрж┐ржВржпрж╝рзЗ рж╕рж╣ржпрзЛржЧрж┐рждрж╛ ржХрж░рж╛ ржХрж╛ржЬрзЗрж░ ржЬрж╛ржпрж╝ржЧрж╛ ржкрж░рж┐рж╖рзНржХрж╛рж░ ржУ ржЧрзЛржЫрж╛ржирзЛ рж░рж╛ржЦрж╛"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19734",
    "job_id": "19734",
    "company_name": "AHZ Associates Bangladesh",
    "job_title": "Sr. Counsellor",
    "location": "Dhaka",
    "salary": "ржмрзЗрждржи ржЖрж▓рзЛржЪржирж╛ рж╕рж╛ржкрзЗржХрзНрж╖рзЗ",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-12",
    "industry": "Education/Training/Consultant",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Taher Tower (4th Floor), 10 DIT Gulshan 2 Circle, Dhaka 1212",
    "job_description": "Responsibilities: - Conduct professional counseling sessions with students/clients\n- Provide accurate guidance based on their needs and goals\n- Assist with admission or client processing\n- Achieve daily, weekly, and monthly counseling targets\n- Make follow-up calls and convert leads into clients\n- Ensure high levels of client satisfaction\n- Work collaboratively with the team to achieve organizational goals\n\nRequirements: Fluency in both English and Bengali is preferred. Strong student counseling and career counseling skills. Excellent communication and customer service skills. Experience in the education field. Ability to work effectively with students. Knowledge of current industry trends in student counseling. Experience in a similar role is preferred.\n\nConduct professional counseling sessions with students/clients Provide accurate guidance based on their needs and goals Assist with admission or client processing Achieve daily, weekly, and monthly counseling targets Make follow-up calls and convert leads into clients Ensure high levels of client satisfaction Work collaboratively with the team to achieve organizational goals"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19720",
    "job_id": "19720",
    "company_name": "AMZAD FOOD",
    "job_title": "Call Center Executive",
    "location": "Mohammadpur",
    "salary": "TK. 12,000-13,000",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-12",
    "industry": "Call Center",
    "vacancy": 15,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Flat-1/B,House-15,Road-9,Block-B,West Dhanmondi Housing Society,Bosila Mohammadpur ,Dhaka-1207",
    "job_description": "Responsibilities: - Supervise and lead a team of call center agents to achieve performance targets.\n- Monitor daily operations and ensure timely resolution of customer inquiries.\n- Develop and implement strategies to improve customer service quality and efficiency.\n- Provide coaching, training, and performance feedback to team members.\n- Prepare and analyze reports on team performance metrics and KPIs.\n- Handle escalated customer issues and provide prompt resolutions.\n- Ensure adherence to company policies, procedures, and service standards.\n- Collaborate with other departments to address customer needs and operational challenges.\n\nRequirements: Education: Bachelor's degree in Business, Communications, or a related field is preferred. Experience: 6 months - 1 year in a similar role. Freshers can also apply. Skills & Qualifications Required: Proven experience as a Call Center Team Lead or in a similar supervisory role. Excellent leadership and team management skills. Strong communication skills (both written and verbal). Ability to analyze data, identify trends, and implement improvements. Proficiency in call center software and CRM systems is a plus. Problem-solving and decision-making skills under pressure. Address: House #15, Road #09, Block #B, West Dhanmondi, Bosila, Mohammadpur - 1207 ЁЯУз Send your CV to WhatsApp: 01335106754\n\nSupervise and lead a team of call center agents to achieve performance targets. Monitor daily operations and ensure timely resolution of customer inquiries. Develop and implement strategies to improve customer service quality and efficiency. Provide coaching, training, and performance feedback to team members. Prepare and analyze reports on team performance metrics and KPIs. Handle escalated customer issues and provide prompt resolutions. Ensure adherence to company policies, procedures, and service standards. Collaborate with other departments to address customer needs and operational challenges."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19711",
    "job_id": "19711",
    "company_name": "Buzzblu Limited",
    "job_title": "Courier Management Officer",
    "location": "Shonir Akhra",
    "salary": "TK. 10,000-15,000",
    "experience": "<1 year",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-12",
    "industry": "Supply Chain/Procurement",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Sonir Akhra, Bus Stop, UCB Bank Building 6th Floor, Kadamtoli Dhaka, Dhaka 1236",
    "job_description": "Responsibilities: Position: Courier Management Officer\nЁЯУН Office: Dania & UCB Bank Building, 6th Floor, Shonir Akhra, Overbridge Connected\nЁЯОп Your responsibilities will include:\nтЬЕ Order management using software\nтЬЕ Uploading and tracking orders on Steadfast Courier\nтЬЕ Handling calls with riders and customers\nтЬЕ Maintaining Delivery, Return, Packing reports\nЁЯза You must have:\nтЬФ Experience in courier management\nтЬФ Knowledge of Bizmation or other OMS tools\n\nржкржЬрж┐рж╢ржи: Courier Management Officer ЁЯУН ржЕржлрж┐рж╕: :-ржжржирж┐рзЯрж╛ ┬аUCB ржмрзНржпрж╛ржВржХ ржмрж┐рж▓рзНржбрж┐ржВ,рж╖рж╖рзНржа рждрж▓рж╛,]рж╢ржирж┐ ржЖржЦржбрж╝рж╛,ржУржнрж╛рж░ржмрзНрж░рж┐ржЬ рж╕ржВрж▓ржЧрзНржи ЁЯОп ржЖржкржирж╛рж░ ржХрж╛ржЬ рж╣ржмрзЗ: тЬЕ рж╕ржлржЯржУрзЯрзНржпрж╛рж░ ржмрзНржпржмрж╣рж╛рж░ ржХрж░рзЗ ржЕрж░рзНржбрж╛рж░ ржорзНржпрж╛ржирзЗржЬржорзЗржирзНржЯ тЬЕ Steadfast ржХрзБрж░рж┐рзЯрж╛рж░рзЗ ржЕрж░рзНржбрж╛рж░ ржЖржкрж▓рзЛржб ржУ ржЯрзНрж░рзНржпрж╛ржХрж┐ржВ тЬЕ рж░рж╛ржЗржбрж╛рж░ ржУ ржХрж╛рж╕рзНржЯржорж╛рж░ржХрзЗ ржХрж▓ рж╣рзНржпрж╛ржирзНржбрзЗрж▓ тЬЕ Delivery, Return, Packing рж░рж┐ржкрзЛрж░рзНржЯ ржорзЗржЗржиржЯрзЗржЗржи ржХрж░рж╛ ЁЯза ржЖржкржирж╛рж░ рж╣рждрзЗ рж╣ржмрзЗ: тЬФ ржХрзБрж░рж┐рзЯрж╛рж░ ржорзНржпрж╛ржирзЗржЬржорзЗржирзНржЯрзЗ ржЕржнрж┐ржЬрзНржЮ тЬФ Bizmation ржмрж╛ ржЕржирзНржп OMS ржЯрзБрж▓ ржмрзНржпржмрж╣рж╛рж░ ржЬрж╛ржирж╛"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19756",
    "job_id": "19756",
    "company_name": "R. TEL",
    "job_title": "Video Editor",
    "location": "Paltan",
    "salary": "ржмрзЗрждржи ржЖрж▓рзЛржЪржирж╛ рж╕рж╛ржкрзЗржХрзНрж╖рзЗ",
    "experience": "1-3 years",
    "education": "Any",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-13",
    "industry": "Graphics/Video Editor",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "5/33, Gulistan Shopping Complex, Gulistan, Dhaka.",
    "job_description": "Responsibilities: Job Description яБмContent creation and uploading (images, reels, shorts) for active campaigns. яБмE-commerce website and social media maintenance and updates. яБмOrder management (Estedfast courier management), call management. яБмProduct photoshoot, videography. яБмWebsite product, price, ad, updates. яБмSkill in attracting and engaging customers through innovative online quizzes.\n\nJob Description яБмржХржиржЯрзЗржирзНржЯ ржХрзНрж░рж┐рзЯрзЗрж╢ржи ржПржмржВ ржЖржкрж▓рзЛржб (ржЫржмрж┐, рж░рж┐рж▓рж╕, рж╢рж░рзНржЯрж╕,) ржПржХржЯрж┐ржн ржХрзНржпрж╛ржорзНржкрзЗржЗржиред яБмржЗржХржорж╛рж░рзНрж╕ ржУрзЯрзЗржмрж╕рж╛ржЗржЯ ржУ рж╕рзЛрж╢рж╛рж▓ ржорж┐ржбрж┐рзЯрж╛ ржорзЗржЗржиржЯрзЗржирзЗржирзНрж╕ ржПржирзНржб ржЖржкржбрзЗржЯред яБмржЕрж░рзНржбрж╛рж░ ржорзНржпрж╛ржирзЗржЬржорзЗржирзНржЯ (ржПрж╕рзНржЯрзЗржбржлрж╛рж╕рзНржЯ ржХрзБрж░рж┐рзЯрж╛рж░ ржорзНржпрж╛ржирзЗржЬржорзЗржирзНржЯ), ржХрж▓ ржорзНржпрж╛ржирзЗржЬржорзЗржирзНржЯред яБмржкрзНрж░рзЛржбрж╛ржХрзНржЯ ржлржЯрзЛрж╢рзБржЯ, ржнрж┐ржбрж┐ржУржЧрзНрж░рж╛ржлрж┐ яБмржУрзЯрзЗржмрж╕рж╛ржЗржЯ ржкрзНрж░рзЛржбрж╛ржХрзНржЯ, ржкрзНрж░рж╛ржЗрж╕, ржПржб, ржЖржкржбрзЗржЯред яБмржЙржжрзНржнрж╛ржмржирзА ржЕржирж▓рж╛ржЗржи ржХрзБржЗржЬрзЗрж░ ржорж╛ржзрзНржпржорзЗ ржЧрзНрж░рж╛рж╣ржХ ржЖржХрж░рзНрж╖ржг ржУ рж╕ржХрзНрж░рж┐рзЯ рж░рж╛ржЦрж╛рж░ ржжржХрзНрж╖рждрж╛ред"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19795",
    "job_id": "19795",
    "company_name": "AKIN AIR TRAVELS",
    "job_title": "ржорж╛рж░рзНржХрзЗржЯрж┐ржВ ржЕржлрж┐рж╕рж╛рж░ (ржЙржЪрзНржЪ ржХржорж┐рж╢ржи ржнрж┐рждрзНрждрж┐ржХ)",
    "location": "Anywhere in Dhaka Division",
    "salary": "ржмрзЗрждржи ржЖрж▓рзЛржЪржирж╛ рж╕рж╛ржкрзЗржХрзНрж╖рзЗ",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "Sales/Marketing",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Chowrongi Market, 3rd Foor(Lift-02), Beside Masjid, Savar, Dhaka",
    "job_description": "Responsibilities: Saudi Arabia, Qatar, Malaysia, Singapore, India, Nepal, and various other countries depend on Ekin Air Travels as a reliable medium for processing tour visas and handling Hajj, Umrah, and air ticketing. They are hiring commission-based marketing officers. Interested parties should apply quickly. Promotion and sales of the company's tour visa, Hajj and Umrah packages, and air ticketing services. Finding new customers and providing clear information about services to them. Delivering travel package and service information to customers and ensuring bookings. Collecting and following up on leads through field or online channels. Maintaining the company's brand image and communicating professionally with customers. Earning commission based on sales. ЁЯТ░ Salary and Benefits: No fixed salary - ЁЯТ╕ Only commission-based income . Monthly travel allowance - 5,000 Taka Attractive commission on sales. Opportunity for long-term work with good performance. Opportunity to build a career in the travel sector.\n\nRequirements: Having experience in marketing or sales work will give you an added advantage. Good communication skills and the ability to influence are necessary. Being interested in field or online marketing is important. Having the mentality to work under pressure is essential. You can also apply for study leave at the university. Prioritize religious candidates for the position.\n\nрж╕рзМржжрж┐ржЖрж░ржм, ржХрж╛рждрж╛рж░, ржорж╛рж▓рзЯрзЗрж╢рж┐рзЯрж╛, рж╕рж┐ржВржЧрж╛ржкрзБрж░, ржнрж╛рж░ржд, ржирзЗржкрж╛рж▓ рж╕рж╣ ржмрж┐ржнрж┐ржирзНржи ржжрзЗрж╢рзЗрж░ ржЯрзНржпрзБрж░ ржнрж┐рж╕рж╛ ржкрзНрж░рж╕рзЗрж╕рж┐ржВ ржПржмржВ рж╣ржЬрзНржм, ржУржорж░рж╛рж╣ ржУ ржПрзЯрж╛рж░ ржЯрж┐ржХрзЗржЯ ржПрж░ ржХрж╛ржЬ ржХрж░рж╛рж░ ржЬржирзНржп ржирж┐рж░рзНржнрж░ржпрзЛржЧрзНржп ржорж╛ржзрзНржпржо ржПржХрж┐ржи ржПрзЯрж╛рж░ ржЯрзНрж░рж╛ржнрзЗрж▓рж╕ ржП ржХржорж┐рж╢ржи ржнрж┐рждрзНрждрж┐ржХ ржорж╛рж░рзНржХрзЗржЯрж┐ржВ ржЕржлрж┐рж╕рж╛рж░ ржирж┐рзЯрзЛржЧ ржжрзЗрзЯрж╛ рж╣ржЪрзНржЫрзЗ ред ржЖржЧрзНрж░рж╣рзА ржкрж╛рж░рзНржерзАржЧржи ржжрзНрж░рзБржд ржЖржмрзЗржжржи ржХрж░рзБржиред ржХрзЛржорзНржкрж╛ржирж┐рж░ ржЯрзНржпрзБрж░ ржнрж┐рж╕рж╛, рж╣ржЬ ржУ ржУржорж░рж╛ ржкрзНржпрж╛ржХрзЗржЬ ржПржмржВ ржПрзЯрж╛рж░ ржЯрж┐ржХрзЗржЯрж┐ржВ рж╕рзЗржмрж╛ ржкрзНрж░ржЪрж╛рж░ ржУ ржмрж┐ржХрзНрж░рзЯ ржХрж░рж╛ред ржирждрзБржи ржЧрзНрж░рж╛рж╣ржХ ржЦрзБржБржЬрзЗ ржмрзЗрж░ ржХрж░рж╛ ржПржмржВ рждрж╛ржжрзЗрж░ ржХрж╛ржЫрзЗ рж╕рзЗржмрж╛ рж╕ржорзНржкрж░рзНржХрзЗ рж╕рзНржкрж╖рзНржЯ ржзрж╛рж░ржгрж╛ ржжрзЗржУрзЯрж╛ред ржнрзНрж░ржоржг ржкрзНржпрж╛ржХрзЗржЬ ржУ рж╕рзЗржмрж╛рж░ рждржерзНржп ржЧрзНрж░рж╛рж╣ржХрзЗрж░ ржХрж╛ржЫрзЗ ржкрзМржБржЫрзЗ ржжрзЗржУрзЯрж╛ ржУ ржмрзБржХрж┐ржВ ржирж┐рж╢рзНржЪрж┐ржд ржХрж░рж╛ред ржлрж┐рж▓рзНржб ржмрж╛ ржЕржирж▓рж╛ржЗржирзЗрж░ ржорж╛ржзрзНржпржорзЗ рж▓рж┐ржб рж╕ржВржЧрзНрж░рж╣ ржУ ржлрж▓рзЛржЖржк ржХрж░рж╛ред ржХрзЛржорзНржкрж╛ржирж┐рж░ ржмрзНрж░рзНржпрж╛ржирзНржб ржЗржорзЗржЬ ржмржЬрж╛рзЯ рж░рзЗржЦрзЗ ржкрзЗрж╢рж╛ржжрж╛рж░ржнрж╛ржмрзЗ ржЧрзНрж░рж╛рж╣ржХрзЗрж░ рж╕рж╛ржерзЗ ржпрзЛржЧрж╛ржпрзЛржЧ рж░рж╛ржЦрж╛ред ржмрж┐ржХрзНрж░рзЯрзЗрж░ ржнрж┐рждрзНрждрж┐рждрзЗ ржХржорж┐рж╢ржи ржЕрж░рзНржЬржи ржХрж░рж╛ред ЁЯТ░ ржмрзЗрждржи ржУ рж╕рзБржмрж┐ржзрж╛рж╕ржорзВрж╣: ржирж┐рж░рзНржжрж┐рж╖рзНржЯ ржХрзЛржирзЛ ржмрзЗрждржи ржирзЗржЗ тАФ ЁЯТ╕ рж╢рзБржзрзБржорж╛рждрзНрж░ ржХржорж┐рж╢ржи ржнрж┐рждрзНрждрж┐ржХ ржЗржиржХрж╛ржо ред ржорж╛рж╕рж┐ржХ ржпрж╛рждрж╛рзЯрж╛ржд ржнрж╛рждрж╛ - рзл,рзжрзжрзж ржЯрж╛ржХрж╛ ржмрж┐ржХрзНрж░рзЯрзЗрж░ ржУржкрж░ ржЖржХрж░рзНрж╖ржгрзАрзЯ ржХржорж┐рж╢ржиред ржнрж╛рж▓рзЛ ржкрж╛рж░ржлрж░ржорзЗржирзНрж╕рзЗ ржжрзАрж░рзНржШржорзЗрзЯрж╛ржжрзА ржХрж╛ржЬрзЗрж░ рж╕рзБржпрзЛржЧред ржЯрзНрж░рж╛ржнрзЗрж▓ рж╕рзЗржХрзНржЯрж░рзЗ ржХрзНржпрж╛рж░рж┐рзЯрж╛рж░ ржЧрзЬрж╛рж░ рж╕рзБржпрзЛржЧред"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19799",
    "job_id": "19799",
    "company_name": "MIlvik Bangladesh Limited",
    "job_title": "Field Sales Associate",
    "location": "Gazipur, Tongi, Tangail, Narsingdi, Savar",
    "salary": "TK. 11,200-18,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "Sales/Marketing",
    "vacancy": 99,
    "shift": "Day Shift",
    "country": null,
    "company_address": "MS Center, 8th & 9th Floor, 8 Bir Uttam AK Khandakar Road, Mohakhali C/A, Dhaka 1212",
    "job_description": "Responsibilities: Job Type: 1. Sales team in a specific area booth. 2. Presenting service information clearly to pedestrians and potential customers. 3. Assisting in selecting appropriate packages according to customer demands. 4. Informing customers about pre-sales and post-sales services. 5. Transferring membership cards by explaining the terms and conditions at each sale.\n\nRequirements: Workplace location (a specific area): Dhaka Outer: Savar, Manikganj, Narshingdi, Gazipur, Mymensingh Qualifications: HSC or Graduate, 6 months sales experience (Freshers applicable) Age: 19+ After confirmation Salary and benefits: - Basic: 11,200 - 12,000 Taka - Allowance and commission: 2,600 + 3,000-25,000 Taka - 2 Eid bonuses, increment - Health benefits, telemedicine, life insurance\n\nржХрж╛ржЬрзЗрж░ ржзрж░ржи: 1. ржирж┐рж░рзНржжрж┐рж╖рзНржЯ ржПрж░рж┐ржпрж╝рж╛ржпрж╝ ржмрзБржерзЗ ржжрж▓ржЧрждржнрж╛ржмрзЗ рж╕рзЗрж▓рж╕ред 2. ржкржержЪрж╛рж░рзА ржУ рж╕ржорзНржнрж╛ржмрзНржп ржХрж╛рж╕рзНржЯржорж╛рж░ржжрзЗрж░ ржХрж╛ржЫрзЗ ржЧрж┐ржпрж╝рзЗ рж╕рж╛рж░рзНржнрж┐рж╕ рж╕ржорзНржкрж░рзНржХрзЗ рж╕рзНржкрж╖рзНржЯржнрж╛ржмрзЗ рждржерзНржп ржЙржкрж╕рзНржерж╛ржкржи ржХрж░рж╛ред 3. ржХрж╛рж╕рзНржЯржорж╛рж░ржжрзЗрж░ ржЪрж╛рж╣рж┐ржжрж╛ ржЕржирзБржпрж╛ржпрж╝рзА ржЙржкржпрзБржХрзНржд ржкрзНржпрж╛ржХрзЗржЬ ржмрзЗржЫрзЗ ржирж┐рждрзЗ рж╕рж╣рж╛ржпрж╝рждрж╛ ржХрж░рж╛ред 4. ржХрж╛рж╕рзНржЯржорж╛рж░ржХрзЗ ржмрж┐ржХрзНрж░ржпрж╝-ржкрзВрж░рзНржм ржУ ржмрж┐ржХрзНрж░ржпрж╝-ржкрж░ржмрж░рзНрждрзА рж╕рзЗржмрж╛ рж╕ржорзНржкрж░рзНржХрзЗ ржЕржмрж╣рж┐ржд ржХрж░рж╛ред 5. ржкрзНрж░рждрж┐ржЯрж┐ ржмрж┐ржХрзНрж░ржпрж╝рзЗрж░ рж╕ржоржпрж╝ рж╢рж░рзНрждрж╛ржмрж▓рзА ржмрзБржЭрж┐ржпрж╝рзЗ ржорзЗржорзНржмрж╛рж░рж╢рж┐ржк ржХрж╛рж░рзНржб рж╣рж╕рзНрждрж╛ржирзНрждрж░ ржХрж░рж╛ред"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19725",
    "job_id": "19725",
    "company_name": "Integrated Marketing Service (IMS)",
    "job_title": "ржмрж┐ржЬржирзЗрж╕ ржбрзЗржнрзЗрж▓ржкржорзЗржирзНржЯ ржорзНржпрж╛ржирзЗржЬрж╛рж░ (BDM)",
    "location": "Kamalapur, Chawk Bazar, Paltan, Motijheel, Rayerbag",
    "salary": "TK. 18,000-23,000",
    "experience": "Fresher",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-12",
    "industry": "Sales/Marketing",
    "vacancy": 30,
    "shift": "Day Shift",
    "country": null,
    "company_address": "15/1, 3rd floor, Room 301, Hatkhola Road,Tikatoli, Dhaka 1203.",
    "job_description": "Responsibilities: A well-established mobile operator is hiring several skilled, talented, proactive, and hardworking Business Development Managers for its corporate or SME sector. тЮб Area-based daily company/organization visits. тЮб Maintain good relations with visited companies. тЮб Must have a strong mentality to achieve monthly target fulfillment. тЮб Must have a corporate sales challenge-taking mentality.\n\nRequirements: тЮб Candidates must have the ability to communicate with unfamiliar people. тЮб They must be honest, hardworking, and smart. тЮб They must have a smartphone. тЮб Candidates with experience in SIM sales/fieldwork will be given preference.\n\nржПржХржЯрж┐ рж╕рзБржкрзНрж░рждрж┐рж╖рзНржарж┐ржд ржорзЗрж╛ржмрж╛ржЗрж▓ ржЕржкрж╛тАМрж░рзЗржЯрж░рзЗрж░ ┬аржХрж░рзНржкрзЛрж░рзЗржЯ ржмрж╛ ЁЭЧжЁЭЧаЁЭЧШ ржПрж░ ржЬржирзНржп ┬аржХрж┐ржЫрзБ рж╕ржВржЦрзНржпржХ ржжржХрзНрж╖, рж╕рзБржжрж░рзНрж╢ржи, ржЙржжрзНржпржорзА ржУ ржкрж░рж┐рж╢рзНрж░ржорзА ржмрж┐ржЬржирзЗрж╕ ржбрзЗржнрзЗрж▓ржкржорзЗржирзНржЯ ржорзНржпрж╛ржирзЗржЬрж╛рж░ ┬аржкржжрзЗ ржирж┐рзЯрзЛржЧ ржжрзЗрзЯрж╛ рж╣ржмрзЗред тЮб ржПрж░рж┐рзЯрж╛┬аржнрж┐рждрзНрждрж┐ржХ┬аржжрзИржирж┐ржХ┬аржХрзЛржорзНржкрж╛ржирж┐/ржкрзНрж░рждрж┐рж╖рзНржарж╛ржи┬аржнрж┐ржЬрж┐ржЯред тЮб ржнрж┐ржЬрж┐ржЯржХрзГржд┬аржХрзЛржорзНржкрж╛ржирж┐рж░┬арж╕рж╛ржерзЗ┬арж╕рзБ-рж╕ржорзНржкрж░рзНржХ┬аржмржЬрж╛рзЯ┬арж░рж╛ржЦрж╛ред тЮб ржорж╛рж╕рж┐ржХ┬аржЯрж╛рж░рзНржЧрзЗржЯ┬аржкрзБрж░ржи┬аржХрж░рж╛рж░┬аржХржарзЛрж░┬аржорж╛ржирж╕рж┐ржХрждрж╛┬аржерж╛ржХрждрзЗ┬арж╣ржмрзЗред тЮб ржХрж░рзНржкрзЛрж░рзЗржЯ┬арж╕рзЗрж▓рж╕┬аржЪрзНржпрж╛рж▓рзЗржЮрзНржЬ┬аржирзЗржУрзЯрж╛рж░┬аржоржд┬аржорж╛ржирж╕рж┐ржХрждрж╛┬аржерж╛ржХрждрзЗ┬арж╣ржмрзЗред тЪЫ ржХрж░рзНржорж╕рзНржерж▓ржГ ржкрж▓рзНржЯржи , ржорждрж┐ржЭрж┐рж▓ , ржЧрзБрж▓рж┐рж╕рзНрждрж╛ржи , рж╕рзЗржЧрзБржиржмрж╛ржЧрж┐ржЪрж╛ , ржорж╛ржирж┐ржХржиржЧрж░ , ржпрж╛ржПржмрж╛рзЬрж┐ , ржмрж╛рж╕рж╛ржмрзЛ , ржорзБржЧржжрж╛ , ржХржорж▓рж╛ржкрзБрж░ , ржлржХрж┐рж░рж╛ржкрзБрж▓ , ржЖрж░рж╛ржоржмрж╛ржЧ , рж░рж╛ржпрж╝рзЗрж░ржмрж╛ржЧ , ржмрж╛ржмрзБржмрж╛ржЬрж╛рж░ , ржЪржХржмрж╛ржЬрж╛рж░ , рж╕рж╛ржпрж╝рзЗржжрж╛ржмрж╛ржж , рж╢ржирж┐рж░ржЖржЦрзЬрж╛ , ржЬрзБрж░рж╛ржЗржи , ржкрзЛрж╕рзНржд ржЧрзЛрж▓рж╛ред"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20136",
    "job_id": "20136",
    "company_name": "Global Summit UK",
    "job_title": "Tele Sales Executive",
    "location": "Dhanmondi",
    "salary": "TK. 25,000-30,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-28",
    "industry": "IT/Telecommunication",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Bangladesh office- Navana Siddique Sorrento House -289/290, Flat-F6 Road-8/A,Old- Dhanmondi-15, Dhaka | UK Office - Pinnacle, 17th Floor, 67 Albion Street, Leeds, West Yorkshire, LS1 5AA,┬аUnited┬аKingdom.",
    "job_description": "Responsibilities: - Make outbound calls to prospective customers\n- Give presentations via Zoom/Google Meet\n- Answer customer questions regarding company services\n- Identify customer needs and requirements\n- Maintain and update customer records in the system\n- Achieve daily/weekly/monthly targets\n- Follow up on leads and conduct effective follow-up calls\n- Collaborate with team members to enhance performance\n\nEmployment Status: **Part-time + Full-time**\n\nWhat We Offer:\n- Competitive salary with performance-based incentives\n- Training and development opportunities\n- Friendly and supportive work environment\n- Possibility of full-time employment in the future\n\nRequirements: - Minimum 1-2 years of experience in a similar role (Fresh graduates are also encouraged to apply)\n- Excellent interpersonal and communication skills\n- Comfortable working during evenings and weekends\n- Basic IT skills and ability to use CRM or calling software\n- Positive attitude, goal-oriented, and a team player\n- Applicants should have experience in the following business areas: Travel Agent, Immigration/Visa Processing\n\nWorking Hours: Evening shifts and weekend availability required.\n\nSkills & Expertise:\n- CRM Software\n- Customer Engagement\n- IT Skills\n- Online Presentation\n- Outbound Calling\n- Product Knowledge\n- Target Achievement\n\nMake outbound calls to prospective customers Give presentations via Zoom/Google Meet Answer customer questions regarding company services Identify customer needs and requirements Maintain and update customer records in the system Achieve daily/weekly/monthly targets Follow up on leads and conduct effective follow-up calls Collaborate with team members to enhance performance Employment Status: **Part-time + Full-time** What We Offer: Competitive salary with performance-based incentives Training and development opportunities Friendly and supportive work environment Possibility of full-time employment in the future"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19791",
    "job_id": "19791",
    "company_name": "Next Online Limited",
    "job_title": "Executive/Sr. Executive, Sales and Marketing",
    "location": "Gulshan",
    "salary": "TK. 18,000-30,000",
    "experience": "6 months - 1 year",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "Sales/Marketing",
    "vacancy": 4,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Zohurul Tower, plot-09, Road-113/A, level-6,Gulshan 2",
    "job_description": "Responsibilities: Build and maintain a successful relationship with customers. Maintain composure and patience in difficult customer situations. Keep customers informed of progress during the issue life cycle and make follow-up calls or communications in a timely manner. Demonstrate outstanding customer service skills and a dedication to the customer service experience. Handle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution. Adhere to Incident Management procedures. Ability to prepare reports, documentation and provide formal training to users. Perform duties and responsibilities to a high professional and ethical standard and carry out any other tasks assigned by the management.\n\nRequirements: - Strong communication and negotiation skills.\n- Customer handling and relationship management.\n- Target-oriented mindset with the ability to meet sales targets.\n- Willingness to do field work.\n- Ability to work under pressure and manage time effectively.\n\nBuilt and maintain a successful relationship with customers. Maintain composure and patience in face-off difficult customer situations. Keep customers informed of progress during the issue life cycle and make follow-up calls or communications in a timely manner. Outstanding customer service skills and a dedication to the customer service experience. Handle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution. Adhering to Incident Management procedures. Ability to prepare reports, documentation and provide formal training to users. Perform the duties & responsibilities to a high professional and ethical standard and Perform any other tasks assigned by the management."
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19794",
    "job_id": "19794",
    "company_name": "IT-Mobile Trader",
    "job_title": "Receptionist",
    "location": "Uttara",
    "salary": "TK. 12,000-15,000",
    "experience": "6 months - 1 year",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "General Management/Admin",
    "vacancy": 1,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Plot No: 43, Sector: 11, Uttara, Dhaka",
    "job_description": "Responsibilities: - Handle incoming and outgoing calls with professional greetings\n- Welcome clients, visitors, or guests at the front office and maintain records\n- Assist admin team members or other department members with related tasks\n- Proficient in operating a PABX machine\n- Provide information, forward calls, handle couriers, take messages, and transfer information to the appropriate person\n- Excellent interpersonal and communication skills with a strong command of English\n- Proficient in handling phone calls\n- Smart attitude and well-presented\n- Energetic and dedicated to work\n- Excellent communication skills with proper English and Bangla pronunciation\n- Computer knowledge: Email, MS Office\n- Preference given to candidates with relevant front desk and secretariat course\n- Must have good behavior\n\nHandle incoming and outgoing calls with greetings in a professional way Welcome the clients, visitors or guests in front-office and maintain records Assist admin team members or other dept. members for related works Able to operate PABX machine thoroughly Able to provide information, forward calls, couriers, take messages and transfer information to appropriate person Should have excellent interpersonal/ communication skills with excellent command in English Must be well conversant in phone calls Must have smart attitude and be well presentable Energetic & Dedicated about work Excellent communication skills and speaking ability with proper English and Bangla pronunciation Computer knowledge: Email, MS Office Having relevant front desk and secretariat course will be given preference Must have good behavior"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20204",
    "job_id": "20204",
    "company_name": "Miniso Bangladesh Ltd.",
    "job_title": "рж╕рзЗрж▓рж╕ ржЕрзНржпрж╛рж╕рзЛрж╕рж┐рзЯрзЗржЯ / рж╕рзНржЯрзЛрж░ ржЯрж┐ржо ржорзЗржорзНржмрж╛рж░",
    "location": "Uttara, Anywhere in Dhaka Division, Banasree, Banani, Mohammadpur",
    "salary": "TK. 10,000",
    "experience": "No Experience Required",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "9 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-31",
    "industry": "Sales/Marketing",
    "vacancy": 150,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Nikunja-2, Lotus Kamal Tower 1. Dhaka",
    "job_description": "Responsibilities: Assist in the overall department management to achieve sales targets through regular monitoring, improved customer service, and team motivation. Main Responsibilities Daily Responsibilities Motivate the department team to achieve sales targets. Ensure correct product display, merchandising, and shelf management. Monitor store inventory, product requisition, and customer service and provide feedback to the store in-charge. Participate in store meetings, identify areas for improvement, and plan for sales and operational quality enhancement. Weekly Responsibilities Plan and implement merchandising, product display, and customer service flow to increase sales. Provide weekly feedback to the area manager following store management guidelines. Ensure product availability according to the agreed time with the store in-charge. Maintain shelf maintenance according to the display plan and ensure improved customer service. Monthly Responsibilities Participate in HR training programs and encourage team participation. Ensure compliance with company SOP and stock/inventory management policies. Assist in staff replacement/hiring as needed. Maintain cleanliness, safety, and healthy environment in the store. Assist in stock verification, variance analysis, and expense control. Initiate team development and performance improvement. Annual Responsibilities Follow the Annual Business Plan (ABP) as directed by the area in-charge/manager. Ensure achievement of sales KPI and HR KPI according to company objectives.\n\nRequirements: Minimum Qualifications and Skills Educational Qualification: Minimum SSC Skills: Good verbal communication skills Customer service attitude Proactive and hardworking mentality Experience: No prior experience required (training will be provided) General Responsibilities and Terms Must follow company objectives, policies, and SOPs. May need to take on additional responsibilities and collaborate with other departments as needed. Must be adaptable to changes in any unit/branch as per management decisions. Must maintain professional conduct and uphold the company's image at all times. Permanent employees must provide a 60-day notice before resigning. Behavioral Expectations Maintain a professional image and attitude in line with the company's values. Show respectful behavior towards colleagues and customers. Uphold the company's reputation both inside and outside working hours. Duty and Benefits Working Hours: 9 hours (1 day off per week) Festival bonus Sales incentives Confirmation benefit after 6 months Annual increment and promotion opportunities Monthly team dinner In-house training facilities\n\nрж╕рзНржЯрзЛрж░ ржЗржиржЪрж╛рж░рзНржЬржХрзЗ рж╕рж╛рж░рзНржмрж┐ржХ ржбрж┐ржкрж╛рж░рзНржЯржорзЗржирзНржЯ ржкрж░рж┐ржЪрж╛рж▓ржирж╛рзЯ рж╕рж╣рж╛рзЯрждрж╛ ржХрж░рж╛ ржПржмржВ ржирж┐рзЯржорж┐ржд ржоржирж┐ржЯрж░рж┐ржВ, ржЙржирзНржиржд ржХрж╛рж╕рзНржЯржорж╛рж░ рж╕рж╛рж░рзНржнрж┐рж╕ ржУ ржЯрж┐ржо ржорзЛржЯрж┐ржнрзЗрж╢ржирзЗрж░ ржорж╛ржзрзНржпржорзЗ ржмрж┐ржХрзНрж░рзЯ рж▓ржХрзНрж╖рзНржпржорж╛рждрзНрж░рж╛ ржЕрж░рзНржЬржирзЗ ржнрзВржорж┐ржХрж╛ рж░рж╛ржЦрж╛ред ржорзВрж▓ ржжрж╛рзЯрж┐рждрзНржмрж╕ржорзВрж╣ ржжрзИржирж┐ржХ ржжрж╛рзЯрж┐рждрзНржм ржбрж┐ржкрж╛рж░рзНржЯржорзЗржирзНржЯ ржЯрж┐ржоржХрзЗ ржмрж┐ржХрзНрж░рзЯ рж▓ржХрзНрж╖рзНржпржорж╛рждрзНрж░рж╛ ржЕрж░рзНржЬржирзЗ ржЙрзОрж╕рж╛рж╣рж┐ржд ржХрж░рж╛ред ржкржгрзНржпрзЗрж░ рж╕ржарж┐ржХ ржбрж┐рж╕ржкрзНрж▓рзЗ, ржорж╛рж░рзНржЪрзЗржирзНржбрж╛ржЗржЬрж┐ржВ ржУ рж╢рзЗрж▓ржл ржмрзНржпржмрж╕рзНржерж╛ржкржирж╛ ржирж┐рж╢рзНржЪрж┐ржд ржХрж░рж╛ред рж╕рзНржЯрзЛрж░ ржЗржиржнрзЗржирзНржЯрж░рж┐,"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19786",
    "job_id": "19786",
    "company_name": "Natural Development Project Ltd",
    "job_title": "ржЙржжрзНржпрзЛржХрзНрждрж╛ / ржбрж┐рж▓рж╛рж░ ржирж┐рзЯрзЛржЧ",
    "location": "All over Bangladesh",
    "salary": "ржмрзЗрждржи ржЖрж▓рзЛржЪржирж╛ рж╕рж╛ржкрзЗржХрзНрж╖рзЗ",
    "experience": "Fresher",
    "education": "H.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-18",
    "industry": "Sales/Marketing",
    "vacancy": 35,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Level-6, Soiyod Plaza, Bus Stand, Savar, Dhaka",
    "job_description": "Responsibilities: With the aim of expanding the market for UNANI medicines nationwide, we are inviting interested, honest, and entrepreneurial individuals to join as dealers / entrepreneurs and become shareholders. ЁЯФ╣ Job Description: тЬЕ Market segmentation of company products/services in designated areas тЬЕ Acquiring new customers and creating markets тЬЕ Wholesale and retail sales management тЬЕ Establishing local distribution networks тЬЕ Achieving sales targets and providing reports ЁЯФ╣ Qualifications: тЬФя╕П Minimum SSC/HSC (Preference given to experienced candidates) тЬФя╕П Interest in business management in own locality тЬФя╕П Communication and networking skills тЬФя╕П Sales/dealership experience is a plus тЬФя╕П Entrepreneurial mindset and responsibility ЁЯФ╣ Investment Benefits: ЁЯТ░ Opportunity to start a business with minimal capital ЁЯУж Regular product supply ЁЯУИ Attractive commission/profit margins ЁЯОп Marketing and sales support ЁЯдЭ Long-term business partnership ЁЯФ╣ What We Offer: тЬи Opportunity to work with established brands тЬи Training and guideline support тЬи Exclusive dealership opportunity in the area (terms apply) тЬи Real opportunity for business expansion ЁЯУЮ Contact: For more information, contact: ЁЯУН Address: Natural Development Project Ltd. Savar Bus Stand, Savar, Dhaka ЁЯУ▒ Mobile: 01405030406\n\nржжрзЗрж╢ржмрзНржпрж╛ржкрзА ржЗржЙржирж╛ржирж┐ ржФрж╖ржзрзЗрж░ ржмрж╛ржЬрж╛рж░ рж╕ржорзНржкрзНрж░рж╕рж╛рж░ржгрзЗрж░ рж▓ржХрзНрж╖рзНржпрзЗ ржЖржорж░рж╛ ржЖржЧрзНрж░рж╣рзА, рж╕рзО ржУ ржЙржжрзНржпрзЛржХрзНрждрж╛ ржорж╛ржирж╕рж┐ржХрждрж╛рж╕ржорзНржкржирзНржи ржмрзНржпржХрзНрждрж┐ржжрзЗрж░ ржХрж╛ржЫ ржерзЗржХрзЗ ржбрж┐рж▓рж╛рж░ / ржЙржжрзНржпрзЛржХрзНрждрж╛ рж╣рж┐рж╕рзЗржмрзЗ ржпрзБржХрзНржд рж╣рзЯрзЗ рж╢рзЗрзЯрж╛рж░рж╣рзЛрж▓рзНржбрж╛рж░ рж╣ржУрзЯрж╛рж░ ржЖржмрзЗржжржи ржЖрж╣рзНржмрж╛ржи ржХрж░ржЫрж┐ред ЁЯФ╣ ржХрж╛ржЬрзЗрж░ ржмрж┐ржмрж░ржиржГ тЬЕ ржирж┐рж░рзНржзрж╛рж░рж┐ржд ржПрж▓рж╛ржХрж╛рзЯ ржХрзЛржорзНржкрж╛ржирж┐рж░ ржкржгрзНржп/рж╕рзЗржмрж╛ ржмрж╛ржЬрж╛рж░ржЬрж╛рждржХрж░ржг тЬЕ ржирждрзБржи ржХрж╛рж╕рзНржЯржорж╛рж░ ржУ ржмрж╛ржЬрж╛рж░ рждрзИрж░рж┐ ржХрж░рж╛ тЬЕ ржкрж╛ржЗржХрж╛рж░рж┐ ржУ ржЦрзБржЪрж░рж╛ ржмрж┐ржХрзНрж░рзЯ ржмрзНржпржмрж╕рзНржерж╛ржкржирж╛ тЬЕ рж╕рзНржерж╛ржирзАрзЯ ржбрж┐рж╕рзНржЯрзНрж░рж┐ржмрж┐ржЙрж╢ржи ржирзЗржЯржУрзЯрж╛рж░рзНржХ ржЧрзЬрзЗ рждрзЛрж▓рж╛ тЬЕ ржмрж┐ржХрзНрж░рзЯ рж▓ржХрзНрж╖рзНржп ржЕрж░рзНржЬржи ржУ рж░рж┐ржкрзЛрж░рзНржЯ ржкрзНрж░ржжрж╛ржи ЁЯФ╣ ржпрзЛржЧрзНржпрждрж╛ржГ тЬФя╕П ржирзНржпрзВржирждржо SSC / HSC (ржЕржнрж┐ржЬрзНржЮрждрж╛ ржерж╛ржХрж▓рзЗ ржЕржЧрзНрж░рж╛ржзрж┐ржХрж╛рж░) тЬФя╕П ржирж┐ржЬ ржПрж▓рж╛ржХрж╛рзЯ ржмрзНржпржмрж╕рж╛ ржкрж░рж┐ржЪрж╛рж▓ржирж╛рж░ ржЖржЧрзНрж░рж╣ тЬФя╕П ржпрзЛржЧрж╛ржпрзЛржЧ ржУ ржирзЗржЯржУрзЯрж╛рж░рзНржХрж┐ржВ ржжржХрзНрж╖рждрж╛ тЬФя╕П ржмрж┐ржХрзНрж░рзЯ/ржбрж┐рж▓рж╛рж░рж╢рж┐ржк ржЕржнрж┐ржЬрзНржЮрждрж╛ ржерж╛ржХрж▓рзЗ ржнрж╛рж▓рзЛ тЬФя╕П ржЙржжрзНржпрзЛржХрзНрждрж╛ ржоржирзЛржнрж╛ржм ржУ ржжрж╛рзЯрж┐рждрзНржмрж╢рзАрж▓рждрж╛ ЁЯФ╣ ржмрж┐ржирж┐рзЯрзЛржЧ рж╕рзБржмрж┐ржзрж╛ржГ ЁЯТ░ рж╕рзНржмрж▓рзНржк ржкрзБржБржЬрж┐рждрзЗ ржмрзНржпржмрж╕рж╛ рж╢рзБрж░рзБ ржХрж░рж╛рж░ рж╕рзБржпрзЛржЧ ЁЯУж ржирж┐рзЯржорж┐ржд ржкржгрзНржп рж╕рж░ржмрж░рж╛рж╣ ЁЯУИ ржЖржХрж░рзНрж╖ржгрзАрзЯ ржХржорж┐рж╢ржи / рж▓рж╛ржнрзЗрж░ ржорж╛рж░рзНржЬрж┐ржи ЁЯОп ржорж╛рж░рзНржХрзЗржЯрж┐ржВ ржУ ржмрж┐ржХрзНрж░рзЯ рж╕рж╣рж╛рзЯрждрж╛ ЁЯдЭ ржжрзАрж░рзНржШржорзЗрзЯрж╛ржжрж┐ ржмрзНржпржмрж╕рж╛рзЯрж┐ржХ ржкрж╛рж░рзНржЯржирж╛рж░рж╢рж┐ржк ЁЯФ╣ ржЖржорж░рж╛ ржпрж╛ ржжрж┐ржЪрзНржЫрж┐ржГ тЬи ржкрзНрж░рждрж┐рж╖рзНржарж┐ржд ржмрзНрж░рзНржпрж╛ржирзНржбрзЗрж░ рж╕рж╛ржерзЗ ржХрж╛ржЬрзЗрж░ рж╕рзБржпрзЛржЧ тЬи ржЯрзНрж░рзЗржирж┐ржВ ржУ ржЧрж╛ржЗржбрж▓рж╛ржЗржи рж╕рж╛ржкрзЛрж░рзНржЯ тЬи ржПрж▓рж╛ржХрж╛рзЯ ржПржХржХ ржбрж┐рж▓рж╛рж░рж╢рж┐ржк рж╕рзБржмрж┐ржзрж╛ (рж╢рж░рзНржд ржкрзНрж░ржпрзЛржЬрзНржп) тЬи ржмрзНржпржмрж╕рж╛ рж╕ржорзНржкрзНрж░рж╕рж╛рж░ржгрзЗрж░ ржмрж╛рж╕рзНрждржм рж╕рзБржпрзЛржЧ ЁЯУЮ ржпрзЛржЧрж╛ржпрзЛржЧ: ржЖржЧрзНрж░рж╣рзАрж░рж╛ ржмрж┐рж╕рзНрждрж╛рж░рж┐ржд ржЬрж╛ржирждрзЗ ржпрзЛржЧрж╛ржпрзЛржЧ ржХрж░рзБржи: ЁЯУН ржарж┐ржХрж╛ржирж╛: ржирзНржпрж╛ржЪрж╛рж░рж╛рж▓ ржбрзЗржнрзЗрж▓ржкржорзЗржирзНржЯ ржкрзНрж░рзЛржЬрзЗржХрзНржЯ рж▓рж┐ржГ рж╕рж╛ржнрж╛рж░ ржмрж╛рж╕ рж╕рзНржЯрж╛ржирзНржб, рж╕рж╛ржнрж╛рж░, ржврж╛ржХрж╛ ЁЯУ▒ ржорзЛржмрж╛ржЗрж▓: 01405030406"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19800",
    "job_id": "19800",
    "company_name": "MIlvik Bangladesh Limited",
    "job_title": "Field Sales Associate",
    "location": "Cox's Bazar, Chittagong, Anywhere in Chittagong Division, Patiya, Ramgoti",
    "salary": "TK. 11,200-18,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "Sales/Marketing",
    "vacancy": 99,
    "shift": "Day Shift",
    "country": null,
    "company_address": "MS Center, 8th & 9th Floor, 8 Bir Uttam AK Khandakar Road, Mohakhali C/A, Dhaka 1212",
    "job_description": "Responsibilities: Type of Work: 1. Sales teaming in designated area booths. 2. Presenting service information clearly to pedestrians and potential customers. 3. Assisting in selecting appropriate packages according to customer demands. 4. Informing customers about pre-sales and post-sales services. 5. Transferring membership cards by explaining terms and conditions at each sale.\n\nRequirements: Workplace location (a specific area): Chattogram: Alankar, JISC Mode, Agrabad, Halishahar, EPZ, Tiger Pass, Muradpur, Bohoddarhat, Oxygen, etc. Cox's Bazar: Cox's Bazar Sadar Qualifications: HSC or Graduate, 6 months sales experience (freshers applicable) Age: 19+ After confirmation Salary and benefits: - Basic: 11,200 - 12,000 Taka - Allowance and commission: 2,600 + 3,000-25,000 Taka - 2 Eid bonuses, increment - Health benefits, telemedicine, life insurance\n\nржХрж╛ржЬрзЗрж░ ржзрж░ржи: 1. ржирж┐рж░рзНржжрж┐рж╖рзНржЯ ржПрж░рж┐ржпрж╝рж╛ржпрж╝ ржмрзБржерзЗ ржжрж▓ржЧрждржнрж╛ржмрзЗ рж╕рзЗрж▓рж╕ред 2. ржкржержЪрж╛рж░рзА ржУ рж╕ржорзНржнрж╛ржмрзНржп ржХрж╛рж╕рзНржЯржорж╛рж░ржжрзЗрж░ ржХрж╛ржЫрзЗ ржЧрж┐ржпрж╝рзЗ рж╕рж╛рж░рзНржнрж┐рж╕ рж╕ржорзНржкрж░рзНржХрзЗ рж╕рзНржкрж╖рзНржЯржнрж╛ржмрзЗ рждржерзНржп ржЙржкрж╕рзНржерж╛ржкржи ржХрж░рж╛ред 3. ржХрж╛рж╕рзНржЯржорж╛рж░ржжрзЗрж░ ржЪрж╛рж╣рж┐ржжрж╛ ржЕржирзБржпрж╛ржпрж╝рзА ржЙржкржпрзБржХрзНржд ржкрзНржпрж╛ржХрзЗржЬ ржмрзЗржЫрзЗ ржирж┐рждрзЗ рж╕рж╣рж╛ржпрж╝рждрж╛ ржХрж░рж╛ред 4. ржХрж╛рж╕рзНржЯржорж╛рж░ржХрзЗ ржмрж┐ржХрзНрж░ржпрж╝-ржкрзВрж░рзНржм ржУ ржмрж┐ржХрзНрж░ржпрж╝-ржкрж░ржмрж░рзНрждрзА рж╕рзЗржмрж╛ рж╕ржорзНржкрж░рзНржХрзЗ ржЕржмрж╣рж┐ржд ржХрж░рж╛ред 5. ржкрзНрж░рждрж┐ржЯрж┐ ржмрж┐ржХрзНрж░ржпрж╝рзЗрж░ рж╕ржоржпрж╝ рж╢рж░рзНрждрж╛ржмрж▓рзА ржмрзБржЭрж┐ржпрж╝рзЗ ржорзЗржорзНржмрж╛рж░рж╢рж┐ржк ржХрж╛рж░рзНржб рж╣рж╕рзНрждрж╛ржирзНрждрж░ ржХрж░рж╛ред"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19798",
    "job_id": "19798",
    "company_name": "MIlvik Bangladesh Limited",
    "job_title": "Field Sales Associate",
    "location": "Comilla, Noakhali, Feni, Lakshmipur",
    "salary": "TK. 11,200-18,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "Sales/Marketing",
    "vacancy": 99,
    "shift": "Day Shift",
    "country": null,
    "company_address": "MS Center, 8th & 9th Floor, 8 Bir Uttam AK Khandakar Road, Mohakhali C/A, Dhaka 1212",
    "job_description": "Responsibilities: Type of work: 1. Team-based sales in a specific area. 2. Presenting service information clearly to pedestrians and potential customers. 3. Assisting in selecting appropriate packages according to customer demands. 4. Informing customers about pre-sales and after-sales services. 5. Transferring membership cards by explaining terms and conditions at each sale.\n\nRequirements: Position Location (a specific area): Comilla: Comilla Sadar and South, Feni, Maijdi, Chaumuhani, Lakshmipur Qualifications: HSC or Bachelor's degree, 6 months of sales experience (freshers applicable) Age: 19+ After confirmation Salary and Benefits: - Basic: 11,200 - 12,000 Taka - Allowance and Commission: 2,600 + 3,000-25,000 Taka - 2 Eid bonuses, increment - Health benefits, telemedicine, life insurance\n\nржХрж╛ржЬрзЗрж░ ржзрж░ржи: 1. ржирж┐рж░рзНржжрж┐рж╖рзНржЯ ржПрж░рж┐ржпрж╝рж╛ржпрж╝ ржмрзБржерзЗ ржжрж▓ржЧрждржнрж╛ржмрзЗ рж╕рзЗрж▓рж╕ред 2. ржкржержЪрж╛рж░рзА ржУ рж╕ржорзНржнрж╛ржмрзНржп ржХрж╛рж╕рзНржЯржорж╛рж░ржжрзЗрж░ ржХрж╛ржЫрзЗ ржЧрж┐ржпрж╝рзЗ рж╕рж╛рж░рзНржнрж┐рж╕ рж╕ржорзНржкрж░рзНржХрзЗ рж╕рзНржкрж╖рзНржЯржнрж╛ржмрзЗ рждржерзНржп ржЙржкрж╕рзНржерж╛ржкржи ржХрж░рж╛ред 3. ржХрж╛рж╕рзНржЯржорж╛рж░ржжрзЗрж░ ржЪрж╛рж╣рж┐ржжрж╛ ржЕржирзБржпрж╛ржпрж╝рзА ржЙржкржпрзБржХрзНржд ржкрзНржпрж╛ржХрзЗржЬ ржмрзЗржЫрзЗ ржирж┐рждрзЗ рж╕рж╣рж╛ржпрж╝рждрж╛ ржХрж░рж╛ред 4. ржХрж╛рж╕рзНржЯржорж╛рж░ржХрзЗ ржмрж┐ржХрзНрж░ржпрж╝-ржкрзВрж░рзНржм ржУ ржмрж┐ржХрзНрж░ржпрж╝-ржкрж░ржмрж░рзНрждрзА рж╕рзЗржмрж╛ рж╕ржорзНржкрж░рзНржХрзЗ ржЕржмрж╣рж┐ржд ржХрж░рж╛ред 5. ржкрзНрж░рждрж┐ржЯрж┐ ржмрж┐ржХрзНрж░ржпрж╝рзЗрж░ рж╕ржоржпрж╝ рж╢рж░рзНрждрж╛ржмрж▓рзА ржмрзБржЭрж┐ржпрж╝рзЗ ржорзЗржорзНржмрж╛рж░рж╢рж┐ржк ржХрж╛рж░рзНржб рж╣рж╕рзНрждрж╛ржирзНрждрж░ ржХрж░рж╛ред"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19742",
    "job_id": "19742",
    "company_name": "Sara Technical Institute ",
    "job_title": "Patient Care Attendant",
    "location": "Uttara, Gazipur, Tongi, Tangail",
    "salary": "TK. 17,000-30,000",
    "experience": "Fresher",
    "education": "S.S.C./Equivalent",
    "employment_type": "Contractual",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-13",
    "industry": "Household",
    "vacancy": 5,
    "shift": "Other",
    "country": null,
    "company_address": "Bagdad Tanjia Tower (3rd Floor), Chandona Chowrasta, Tangail Road, Gazipur-1702",
    "job_description": "Responsibilities: We are looking for sincere caregivers, nurses, and attendants to provide genuine care and supervision for adult patients, bedridden individuals, and young children in various areas of Dhaka.\n\nYour main responsibilities include:\nтЬЕ Service and Care: Maintaining physical hygiene of patients (e.g. bathing, changing clothes, trimming nails, etc.).\nтЬЕ Medical Support: Administering medication on time, providing insulin, and checking blood pressure/diabetes.\nтЬЕ Assistance in Mobility: Helping patients move from bed to wheelchair or providing support for walking.\nтЬЕ Monitoring: Informing the office or doctor about any improvements or deteriorations in the patient's physical condition.\n\nЁЯМЯ Special Opportunity (for newcomers)\nAre you interested in this job but have never done it before? No worries!\n- Freshers Welcome: No prior experience needed for this job. We provide training for newcomers. (Training facilities available)\n- Training and Job: Those who are inexperienced will be trained at our own institution, 'Sara Technical Institute', and directly placed in a job.\n- Career Development: It's not just a job, but a great opportunity to excel in the nursing and caregiving sector.\n\nWork Hours and Type:\n- Must be mentally prepared to work 12 or 24-hour shifts (arrangements for staying and eating available for 24-hour shifts).\n\nRequirements: Behavior and Mentality: Must be extremely patient, calm, and humble in nature. (As it is required to take care of sick patients and children). Should have a mentality to care for elderly or young children as one's own family. Should be honest and punctual in work. Other Qualifications: Prescribe and administer medication to patients. Must have a National ID card or birth registration certificate. Must be mentally prepared to work in shifts of 12 or 24 hours.\n\nржЖржорж░рж╛ ржврж╛ржХрж╛рж░ ржмрж┐ржнрж┐ржирзНржи ржПрж▓рж╛ржХрж╛рзЯ ржмрзЯрж╕рзНржХ рж░рзЛржЧрзА , рж╢ржпрзНржпрж╛рж╢рж╛рзЯрзА ржмрзНржпржХрзНрждрж┐ ржПржмржВ ржЫрзЛржЯ ржмрж╛ржЪрзНржЪрж╛ржжрзЗрж░ рж╕ржарж┐ржХ ржпрждрзНржи ржУ ржжрзЗржЦрж╛рж╢рзЛржирж╛рж░ ржЬржирзНржп ржЖржирзНрждрж░рж┐ржХ ржХрзЗрзЯрж╛рж░ржЧрж┐ржнрж╛рж░ , ржирж╛рж░рзНрж╕ ржПржмржВ ржПржЯрзЗржирзНржбрзЗржирзНржЯ ржЦрзБржБржЬржЫрж┐ ржЖржкржирж╛рж░ ржкрзНрж░ржзрж╛ржи ржжрж╛рзЯрж┐рждрзНржмрж╕ржорзВрж╣: тЬЕ рж╕рзЗржмрж╛ ржУ ржпрждрзНржи: рж░рзЛржЧрзАржжрзЗрж░ рж╢рж╛рж░рзАрж░рж┐ржХ ржкрж░рж┐ржЪрзНржЫржирзНржирждрж╛ ржмржЬрж╛рзЯ рж░рж╛ржЦрж╛ (ржпрзЗржоржи: ржЧрзЛрж╕рж▓ ржХрж░рж╛ржирзЛ, ржкрзЛрж╢рж╛ржХ ржкрж░рж┐ржмрж░рзНрждржи, ржиржЦ ржХрж╛ржЯрж╛ ржЗрждрзНржпрж╛ржжрж┐)ред тЬЕ ржорзЗржбрж┐ржХрзЗрж▓ рж╕рж╛ржкрзЛрж░рзНржЯ: рж╕ржарж┐ржХ рж╕ржорзЯрзЗ ржУрж╖рзБржз ржЦрж╛ржУрзЯрж╛ржирзЛ, ржЗржирж╕рзБрж▓рж┐ржи ржжрзЗржУрзЯрж╛ ржПржмржВ ржмрзНрж▓рж╛ржб ржкрзНрж░рзЗрж╢рж╛рж░/ржбрж╛рзЯрж╛ржмрзЗржЯрж┐рж╕ ржЪрзЗржХ ржХрж░рж╛ред тЬЕ ржЪрж▓рж╛ржлрзЗрж░рж╛рзЯ рж╕рж╛рж╣рж╛ржпрзНржп: рж░рзЛржЧрзАржХрзЗ ржмрж┐ржЫрж╛ржирж╛ ржерзЗржХрзЗ рж╣рзБржЗрж▓ржЪрзЗрзЯрж╛рж░рзЗ ржирзЗржУрзЯрж╛ ржмрж╛ рж╣рж╛ржБржЯрж╛ржЪрж▓рж╛рзЯ рж╕рж╛ржкрзЛрж░рзНржЯ ржжрзЗржУрзЯрж╛ред тЬЕ ржоржирж┐ржЯрж░рж┐ржВ: рж░рзЛржЧрзАрж░ рж╢рж╛рж░рзАрж░рж┐ржХ ржЕржмрж╕рзНржерж╛рж░ ржЙржирзНржирждрж┐ ржмрж╛ ржЕржмржирждрж┐ рж╕ржорзНржкрж░рзНржХрзЗ ржЕржлрж┐рж╕ ржмрж╛ ржбрж╛ржХрзНрждрж╛рж░ржХрзЗ ржЬрж╛ржирж╛ржирзЛред ЁЯМЯ ржмрж┐рж╢рзЗрж╖ рж╕рзБржпрзЛржЧ (ржирждрзБржиржжрзЗрж░ ржЬржирзНржп) ржЖржкржирж┐ ржХрж┐ ржПржЗ ржХрж╛ржЬ ржХрж░рждрзЗ ржЖржЧрзНрж░рж╣рзА ржХрж┐ржирзНрждрзБ ржЖржЧрзЗ ржХржЦржирзЛ ржХрж░рзЗржиржирж┐? ржХрзЛржирзЛ ржЪрж┐ржирзНрждрж╛ ржирзЗржЗ! ржлрзНрж░рзЗрж╢рж╛рж░ржжрзЗрж░ рж╕рзНржмрж╛ржЧрждржо: ржПржЗ ржХрж╛ржЬрзЗрж░ ржЬржирзНржп ржкрзВрж░рзНржм ржЕржнрж┐ржЬрзНржЮрждрж╛рж░ ржкрзНрж░рзЯрзЛржЬржи ржирзЗржЗред ржЖржорж░рж╛ ржирждрзБржиржжрзЗрж░ ржЕржЧрзНрж░рж╛ржзрж┐ржХрж╛рж░ ржжрж┐ржЪрзНржЫрж┐ред (ржЯрзНрж░рзЗржЗржирж┐ржВ ржПрж░ рж╕ржорзЯ ржерж╛ржХрж╛рж░ рж╕рзБржмрж┐ржзрж╛ ржЖржЫрзЗ) ржЯрзНрж░рзЗржирж┐ржВ ржУ ржЪрж╛ржХрж░рж┐: ржпрж╛ржжрзЗрж░ ржХрж╛ржЬ ржЬрж╛ржирж╛ ржирзЗржЗ, рждрж╛ржжрзЗрж░ ржЖржорж╛ржжрзЗрж░ ржирж┐ржЬрж╕рзНржм ржкрзНрж░рждрж┐рж╖рзНржарж╛ржи 'Sara Technical Institute' -ржПрж░ ржорж╛ржзрзНржпржорзЗ рж╣рж╛рждрзЗ-ржХрж▓ржорзЗ ржХрж╛ржЬ рж╢рж┐ржЦрж┐рзЯрзЗ рж╕рж░рж╛рж╕рж░рж┐ ржЪрж╛ржХрж░рж┐рждрзЗ ржЬрзЯрзЗржи ржХрж░рж╛ржирзЛ рж╣ржмрзЗред( ржХрзНржпрж╛рж░рж┐рзЯрж╛рж░ ржЧржаржи: ржПржЯрж┐ рж╢рзБржзрзБ ржЪрж╛ржХрж░рж┐ ржирзЯ, ржирж╛рж░рзНрж╕рж┐ржВ ржУ ржХрзЗрзЯрж╛рж░ржЧрж┐ржнрж┐ржВ рж╕рзЗржХрзНржЯрж░рзЗ ржирж┐ржЬрзЗржХрзЗ ржжржХрзНрж╖ рж╣рж┐рж╕рзЗржмрзЗ ржЧрзЬрзЗ рждрзЛрж▓рж╛рж░ ржПржХржЯрж┐ ржжрж╛рж░рзБржг рж╕рзБржпрзЛржЧред ржХрж╛ржЬрзЗрж░ рж╕ржорзЯ ржУ ржзрж░ржг: рззрзи ржШржгрзНржЯрж╛ ржЕржержмрж╛ рзирзк ржШржгрзНржЯрж╛ рж╢рж┐ржлржЯрзЗ ржХрж╛ржЬ ржХрж░рж╛рж░ ржорж╛ржирж╕рж┐ржХрждрж╛ ржерж╛ржХрждрзЗ рж╣ржмрзЗ (ржерж╛ржХрж╛-ржЦрж╛ржУрзЯрж╛рж░ ржмрзНржпржмрж╕рзНржерж╛ ржЖржЫрзЗ рзирзк ржШржгрзНржЯрж╛ рж╢рж┐ржлржЯрзЗ)ред"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19721",
    "job_id": "19721",
    "company_name": "Hishabee Technologies Limited ",
    "job_title": "Assistant Manager (Customer Success тАУ Telesales)",
    "location": "Jessore",
    "salary": "TK. 22,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-12",
    "industry": "Sales/Marketing",
    "vacancy": 5,
    "shift": "Day Shift",
    "country": null,
    "company_address": "Level 2, 145/1 Green Road (Crescent Plaza), Farmgate, Dhaka, Bangladesh , Dhaka, Bangladesh, Dhaka, Bangladesh",
    "job_description": "Responsibilities: We are not just hiring - we are building the strongest Telesales Leadership Team in the country. As an Assistant Manager (Customer Success - Telesales) at Hishabee, you will lead a high-performance sales team, drive KPIs, optimize results, and help shape the next generation of top-performing agents.\n\nтЧП Lead, manage & motivate a team of telesales agents\nтЧП Monitor daily KPIs, call volume, and conversion numbers\nтЧП Provide training, coaching, and performance feedback\nтЧП Plan sales strategies and drive team execution\nтЧП Track incentive performance and push for higher output\nтЧП Maintain discipline, energy, and accountability within the team\nтЧП Collaborate with management to improve processes & strategy\nтЧП Prepare performance reports and present insights\n\nSalary Increase: After completing a 6-month probation period\nPerformance Bonus: Monthly leadership-based incentives\nTotal Earning Potential: Attractive and growth-oriented\n\nWhy Choose Hishabee?\nтЧП One of Bangladesh's fastest-growing startups in SaaS & Fintech\nтЧП Lead a dynamic telesales team and drive real business impact\nтЧП Clear growth paths into Senior Management roles\nтЧП Performance-driven culture with strong learning & development\nтЧП Opportunity to work with leadership and shape strategies\n\nRequirements: - Minimum 2-3 years of experience in telesales, inside sales, or customer success\n- Prior experience in leading a sales team is highly preferred\n- Strong track record of meeting or exceeding targets\n\nAdditional Requirements:\n- Strong leadership and communication skills\n- Highly target-driven and confident under pressure\n- Excellent analytical and reporting ability\n- Positive attitude, punctual, and disciplined\n- Open to both male and female candidates\n\nWant to lead a winning sales team and grow your leadership career? Apply now and become a part of Hishabee's powerhouse leadership team!\n\nWeтАЩre not just hiring тАУ weтАЩre building the strongest Telesales Leadership Team in the country. As an Assistant Manager (Customer Success тАУ Telesales) at Hishabee, you will lead a high-performance sales team, drive KPIs, optimize results, and help shape the next generation of top-performing agents тЧП Lead, manage & motivate a team of telesales agents тЧП Monitor daily KPIs, call volume, and conversion numbers тЧП Provide training, coaching, and performance feedback тЧП Plan sales strategies and drive team execution тЧП Track incentive performance and push for higher output тЧП Maintain discipline, energy, and accountability within the team тЧП Collaborate with management to improve processes & strategy тЧП Prepare performance reports and present insights Salary Increase: After completing 6 month probation period Performance Bonus: Monthly leadership-based incentives Total Earning Potential: Attractive and growth-oriented Why Choose Hishabee? тЧП One of BangladeshтАЩs fastest-growing startups in SaaS & Fintech тЧП Lead a dynamic telesales team and drive real business impact тЧП Clear growth paths into Senior Management roles тЧП Per"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=20206",
    "job_id": "20206",
    "company_name": "Angelica International School",
    "job_title": "Assistant Teacher - Biology",
    "location": "Savar",
    "salary": "TK. 18,000",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "8 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-31",
    "industry": "Education/Training/Consultant",
    "vacancy": 2,
    "shift": "Day Shift",
    "country": null,
    "company_address": "B-83/1, Bazar Road, Savar-1340, Dhaka, Bangladesh",
    "job_description": "Responsibilities: Angelica International School (AIS), the first registered English Medium School in Savar since 1997, is proudly affiliated with British Council Bangladesh, Pearson Edexcel, and International Horizon.\n\nWe are inviting applications from passionate and qualified individuals for the following position:\n\nPosition: Biology Teacher тАУ Primary & High School Section\n\nKey Responsibilities:\n1. Deliver engaging English lessons for preschool, primary, and Lower Secondary students in an English Spoken environment.\n2. Prepare comprehensive lesson plans and teaching materials aligned with the school curriculum.\n3. Actively contribute to curriculum development and creative teaching methods.\n4. Foster a meaningful and interactive learning environment for students.\n5. Provide regular academic feedback and performance updates to school administration.\n6. Maintain effective communication with students, parents, and fellow educators.\n7. Support school activities and programs under the guidance of the Principal/Senior Teachers.\n8. Assist with academic tasks including exam invigilation, event coordination, and parent meetings.\n9. Conduct online classes when necessary using Zoom, Google Meet, or other digital platforms.\n\nSalary: Not less than 18,000 BDT\n\nHow to Apply: Send your updated CV, a cover letter, and a recent passport-size photograph to: career@angelica.edu.bd\n\nRequirements: Educational Requirements: A BachelorтАЩs degree (minimum CGPA 3.00 out of 4.00) from a recognized public or reputed private university. Experience Requirements: 1. Fresh graduates are encouraged to apply.\n2. Preference will be given to candidates with prior teaching experience in English Medium schools.\n3. Candidates with a minimum IELTS score of 6.0 will have added advantage. Additional Requirements: 1. Age between 24 to 40 years\n2. Excellent command of English with strong vocabulary and grammar skills.\n3. Ability to type from dictation and proficiency in MS Word, Excel, and Google Docs.\n4. Attention to detail with strong editing and proofreading capabilities.\n5. Strong time management, organizational, and communication skills.\n6. Familiarity with digital and paper-based document systems.\n\nAngelica International School (AIS), the first registered English Medium School in Savar since 1997, is proudly affiliated with British Council Bangladesh, Pearson Edexcel, and International Horizon We are inviting applications from passionate and qualified individuals for the following position: Position: Assistant Teacher - Biology Key Responsibilities: Deliver engaging English lessons for preschool, primary, and iLower Secondary students in an English Spoken environment .Prepare comprehensive lesson plans and teaching materials aligned with the school curriculum. Actively contribute to curriculum development and creative teaching methods. Foster a meaningful and interactive learning environment for students. Provide regular academic feedback and performance updates to school administrati"
  },
  {
    "url": "https://app.shomvob.co/single-job-description/?id=19802",
    "job_id": "19802",
    "company_name": "R. TEL",
    "job_title": "Showroom Manager",
    "location": "Paltan",
    "salary": "ржмрзЗрждржи ржЖрж▓рзЛржЪржирж╛ рж╕рж╛ржкрзЗржХрзНрж╖рзЗ",
    "experience": "1-3 years",
    "education": "Honors/Equivalent",
    "employment_type": "Full Time",
    "working_hours": "10 hours per day",
    "deadline": "2026-02-12",
    "date_posted": "2026-01-15",
    "industry": "Sales/Marketing",
    "vacancy": 10,
    "shift": "Day Shift",
    "country": null,
    "company_address": "5/33, Gulistan Shopping Complex, Gulistan, Dhaka.",
    "job_description": "Responsibilities: Managing sales staff. Providing customer service and maintaining accounts. Ensuring proper management of shipping and receiving operations according to established rules. Reporting regularly to the company chairman on sales, outstanding products, employee status, etc., and seeking assistance as needed. Ensuring proper monitoring of inventory, sales reports, transportation, and banking transactions at the showroom.\n\nRequirements: Additional Requirements\nBasic knowledge of computer (typing, MS Office) is required.\n\nCandidates must have a sincere, competent, hardworking attitude and be mentally prepared to work for long hours.\n\nQualification and experience:\nBBA (Marketing)\n\nржмрж┐ржХрзНрж░рзЯ ржХрж░рзНржорзАржжрзЗрж░ ржкрж░рж┐ржЪрж╛рж▓ржирж╛ ржХрж░рж╛ред ржХрж╛рж╕рзНржЯржорж╛рж░ рж╕рж╛рж░рзНржнрж┐рж╕ ржПржмржВ рж╣рж┐рж╕рж╛ржм рж╕ржВрж░ржХрзНрж╖ржг ржХрж░рж╛ред ржкрзНрж░рждрж┐рж╖рзНржарж┐ржд ржирж┐рзЯржо ржЕржирзБржпрж╛рзЯрзА рж╢рж┐ржкрж┐ржВ ржУ рж░рж┐рж╕рж┐ржнрж┐ржВ ржХрж╛рж░рзНржпржХрзНрж░ржо рж╕ржарж┐ржХржнрж╛ржмрзЗ ржкрж░рж┐ржЪрж╛рж▓ржирж╛ ржХрж░рж╛ред ржирж┐рзЯржорж┐рждржнрж╛ржмрзЗ ржмрж┐ржХрзНрж░рзЯ, ржкржгрзНржп ржмржХрзЗрзЯрж╛, ржХрж░рзНржорзА ржЕржмрж╕рзНржерж╛ ржЗрждрзНржпрж╛ржжрж┐ ржмрж┐рж╖рзЯрзЗ ржХрзЛржорзНржкрж╛ржирж┐ ржЪрзЗрзЯрж╛рж░ржорзНржпрж╛ржиржХрзЗ рж░рж┐ржкрзЛрж░рзНржЯ ржХрж░рж╛ ржУ ржкрзНрж░рзЯрзЛржЬржи ржЕржирзБржпрж╛рзЯрзА рж╕рж╣рж╛рзЯрждрж╛ ржЪрж╛ржУрзЯрж╛ред рж╢рзЛрж░рзБржорзЗрж░ ржЗржиржнрзЗржирзНржЯрж░рж┐, ржмрж┐ржХрзНрж░рзЯ ржкрзНрж░рждрж┐ржмрзЗржжржи, ржкрж░рж┐ржмрж╣ржи ржУ ржмрзНржпрж╛ржВржХ рж▓рзЗржиржжрзЗржи рж╕ржарж┐ржХржнрж╛ржмрзЗ рж░ржХрзНрж╖ржгрж╛ржмрзЗржХрзНрж╖ржг ржирж┐рж╢рзНржЪрж┐ржд ржХрж░рж╛ред"
  }
]